{
    "Product Name": "313 Anker Wireless Charger (Pad), Qi-Certified 10W Max for iPhone 14/14 Pro/14 Pro Max/13/13 Pro Max, AirPods (No AC Adapter, Not Compatible with MagSafe Magnetic Charging)",
    "Product Image": "https://m.media-amazon.com/images/I/614+4XNwpML._AC_SX569_.jpg",
    "Unique Key": "B07THHQMHM",
    "Reviews": [
        {
            "Date": "Reviewed in Australia on 28 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Received exactly what I ordered. Good quality, and fast shipping. Would deal with seller again."
        },
        {
            "Date": "Reviewed in Australia on 20 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Works perfectly with iPhone 11\nGreat for the bedside table because it only has one LED light and it’s very tiny, so it doesn’t make the room glow like some chargers.\nPhone doesn't seem to get overly hot."
        },
        {
            "Date": "Reviewed in Australia on 1 August 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Quite slow to charge my iPhone but gets there eventually. Seems good with the kindle though."
        },
        {
            "Date": "Reviewed in Australia on 30 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Good item at a faire price"
        },
        {
            "Date": "Reviewed in Australia on 4 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Works perfectly, arrived in a couple of days. Very happy"
        },
        {
            "Date": "Reviewed in Australia on 3 January 2023",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Works well very slow to charge"
        },
        {
            "Date": "Reviewed in Australia on 21 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Just works"
        },
        {
            "Date": "Reviewed in Australia on 19 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Just what I needed"
        },
        {
            "Date": "Reviewed in Australia on 2 April 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Kind of over heats upon charging for both phone and also bluetooth buds"
        },
        {
            "Date": "Reviewed in Australia on 26 December 2020",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Unlike the official Samsung wireless pad, this wireless charging pad does not contain a fan. However, despite the lack of fan, I have not run into any particular heat issues when it comes to wireless charging. Although the device and pad get slightly warm when in use, neither of them have been concerningly warm to date.\n\nThe rubber surface is nice for keeping the phone aligned to the charger's coil, and the charger itself on the table, although the uniformity of both rubber surfaces makes it slightly difficult to tell which way is up, and I nearly set it on the table upside-down after cleaning. The rubber surfaces also have a habit of sticking to dust very easily. I found the charger to be very dusty within a day or so of using it on a mostly clean room. Fortunately, the dust seems to be fairly easily remedied by a quick wipe-down with a damp cloth, although I do not know if this is a recommended method of cleaning the charger.\n\nAn issue that I have with the charger is that the LED is difficult to see, and is often covered by a phone if it is being used, thereby defeating the point of the LED in the first place. This makes it difficult to tell whether a phone is charging, misaligned, or if there are any issues with the wireless charger, without rotating or removing the phone, the former of which is not suitable if the charger is in a more awkward location, and the latter causes the charger to shut off within moments, making removing the phone to see the LED useless.\n\nThe wireless charger also does not seem to have any issues when it comes to thicker cases. I use an Otterbox Defender case on my phone, and I have not experienced any issues with charging the phone through the case."
        },
        {
            "Date": "Reviewed in Australia on 1 January 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Bought for my granddaughters and they report that it is very useful. Performs well and used often."
        },
        {
            "Date": "Reviewed in Australia on 15 April 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Self"
        },
        {
            "Date": "Reviewed in Australia on 22 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Initial impressions were fine, althought it didn't do fast charging. I've since bought an official Samsung fast charger with USB connection which has enabled \"fast wireless charging\". Fast wireless charging is a middle ground between slow charging and fast charging directly from the charger.\n\nReviews saying fast charging doesn't work are just wrong. Get the right charger for it and it works fine. Gets a little bit hot but nothing major."
        },
        {
            "Date": "Reviewed in Australia on 5 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I use this to charge next to my bed. It is easier then finding the charging cable and attempting to plug it in at night before bed."
        },
        {
            "Date": "Reviewed in Australia on 1 July 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Thoroughly enjoy using the wireless charger… however the disadvantage is the charger isn’t strong enough to operate properly when my iPhone 12 is in its wallet case so it’s a small matter of removing the phone to charge.\nHaving said that it’s brilliant because I’ve a new routine of charging whilst sleeping."
        },
        {
            "Date": "Reviewed in Australia on 8 November 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "A fabulous option for tradies!! I bought this for my husband who has spent more than 2 years replacing chargers and blowing dirt and dust out of his phone before successfully connecting the charger. Now he simply places his phone on top of this charger without a worry. He loves it!"
        },
        {
            "Date": "Reviewed in Australia on 18 June 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Good product but after several months it started getting testy, I had to unplug and plug back in to get it working, and then it just stopped working altogether.\n\nUpdate: they were very nice to contact me and send me a new one without having to go through the trouble of sending the old one back. Hopefully this one lasts longer because I've tried other ones and didn't like them as much as this one, especially for charging my earbuds."
        },
        {
            "Date": "Reviewed in Australia on 22 June 2022",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "I haven't actually used this yet because had to order the very specific charger USB plug thing in order for it to charge properly. It does say it in the description of this item that it doesn't come with the plug but I assumed, since I have a million laying around, that one of the plugs I have would be sufficient. I did not. BUT! I am still really excited to use this as it does seem like a great product."
        },
        {
            "Date": "Reviewed in Australia on 2 February 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Does the job as an item like this should, but you have about 1cm range of movement between not charging, and charging. So absolutely make sure it is lined up before going to bed or you will wake up with a flat phone. Surely there is better on the market....but for the price?"
        },
        {
            "Date": "Reviewed in Australia on 25 August 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "No complaints here. I was aware that this would not fast-charge my phone due to compatibility (that is my phone's fault, not the charger). I also knew that I'd have to use an existing transformer (fine). Have had no issues with placement or heating or not charging etc. This seems to work better than wireless charger in my car or an older one I had already.\nPrice is a little high compared to other brands.\nWorks well with a charger that has both USB-C and USB-A output as that way you can use cable when you need the faster charge."
        },
        {
            "Date": "Reviewed in Australia on 6 March 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Bought this charger as my original charging cable kept coming off the port on my phone. With this one, I dont need to worry about dust clogging the charging port, faulty cable etc. The same adapter that came with my Samsung phone seems to be compatible with this charger. I haven't tracked the time it takes for a full charge that much, but it does seem to charge it within a reasonable time. Overall, quite happy with the purchase."
        },
        {
            "Date": "Reviewed in Australia on 28 April 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Didnt support all of my power bricks, nor my powerbank. Not even my 45 watt fast charging brick."
        },
        {
            "Date": "Reviewed in Australia on 16 July 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I like this charger as its a combo wireless charger doing obth small W devices (earbuds, smart watches, etc) as well as high W fast charging devices (samsung S23 ultra) without breaking a sweat. Typical Anker quality which is top notch. Do recommend"
        },
        {
            "Date": "Reviewed in Australia on 25 June 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Bought 3 of these August last year when it was on sale, didn’t use it until Dec. Has not used it since May. Which means it broke in less than 6 months of use.\nThe other one still seems fine; another unopened."
        },
        {
            "Date": "Reviewed in Australia on 16 September 2022",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Tells you exactly what you need to know to use the charger. Best with a smart charge charger. Just a small premium treat to yourself that'll add so much more convenience to your device charging game."
        },
        {
            "Date": "Reviewed in Australia on 6 July 2022",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "this made charging my phone at night so much easier. All I had to do was lay it on the charger and roll over and go to sleep. No fiddling with wires or anything"
        },
        {
            "Date": "Reviewed in Australia on 6 July 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Not a lot to say really. Small, light, does the job charging my S22. Wouldn't be without it. Which is why I bought another one for the guest room :)"
        },
        {
            "Date": "Reviewed in Australia on 23 August 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Very happy with the charger, super quick delivery, very happy"
        },
        {
            "Date": "Reviewed in Australia on 6 February 2023",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "It charges quite slowly so I've kept it as a spare and bought another faster cabled one."
        },
        {
            "Date": "Reviewed in Australia on 3 January 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Arrived promptly. Sits next to my bed and I just chuck it on there overnight. Better than fumbling around in the dark with cables and fat fingers. Paired with the Anker Quick Charge 3.0 18W charger."
        },
        {
            "Date": "Reviewed in Australia on 11 April 2022",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Great little charging pad.\n\nMy only complaint is that sometimes if it is not in the correct position it will stop charging. This is not an issue if you check on it regularly (i.e. you have this charging pad on your desk while you work) but might be an issue if you leave it overnight and wakeup to your phone not being charged."
        },
        {
            "Date": "Reviewed in Australia on 17 May 2022",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "I’ve left my phone charging for an hour which would usually significantly improve the battery but not with this one. Battery never seems to improve after charging it, regardless how long left on the pad, with the charging symbol on. Really disappointed, I’d great hopes for the convenience"
        },
        {
            "Date": "Reviewed in Australia on 11 June 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The charger worked perfectly and I bought a second for my office a week later."
        },
        {
            "Date": "Reviewed in Australia on 12 October 2022",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "The product is missing some important parts and also it doesn’t have everything you need to use."
        },
        {
            "Date": "Reviewed in Australia on 4 August 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "THANK YOU\nGREAT PRODUCT"
        },
        {
            "Date": "Reviewed in Australia on 13 August 2021",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "As a simple, bedside wireless charger for my iPhone 8 even when in a leather case, this is an excellent product with a sufficiently faint charging light not to cause noticeable reflections in the bedroom."
        },
        {
            "Date": "Reviewed in Australia on 24 July 2022",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "红good value for this price product"
        },
        {
            "Date": "Reviewed in Australia on 31 May 2023",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "I bought one and it failed after 14 months. I thought it was just a dud because it works so well, but now the second has failed again in 15 months. I expect the device to last much longer."
        },
        {
            "Date": "Reviewed in Australia on 7 June 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Bought it - worked okay for about 6 weeks. Then stopped working"
        },
        {
            "Date": "Reviewed in Australia on 13 October 2021",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Does exactly what I want, but not happy that in 2021 we're still seeing products with USB A to Micro USB. Should be all USB C."
        },
        {
            "Date": "Reviewed in Australia on 9 June 2022",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Easy to use."
        },
        {
            "Date": "Reviewed in Australia on 5 February 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Just place your phone on it and it charges, even through the phone cover. Works on ipads too."
        },
        {
            "Date": "Reviewed in Australia on 3 August 2022",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Seems to charge well. How ever has to be perfectly placed to work"
        },
        {
            "Date": "Reviewed in Australia on 13 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Works as intended. Very happy with my purchase."
        },
        {
            "Date": "Reviewed in Australia on 28 December 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I received this for Christmas and love it. My old one was wearing out and not holding it’s charges."
        },
        {
            "Date": "Reviewed in Australia on 15 September 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I do not know too much about the tech side but it works flawlessly. And my phone got charged fully in reasonable amount of time."
        },
        {
            "Date": "Reviewed in Australia on 31 August 2023",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "The charger is too slow"
        },
        {
            "Date": "Reviewed in Australia on 19 November 2020",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "You can never go wrong with the best power accessory company anker! The quality and surprisingly lightweight wireless charger is amazing! This is my second time I bought a wireless charger (samsung made ones are not good) and anker really blown me away.\n\nMy phone does not overheat and charges really fast while using it. What more can you ask for?"
        },
        {
            "Date": "Reviewed in Australia on 30 July 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Use it only for my earbuds, I feel cool using them. hasn't crapped out on me or inexplicably broken down on me yet."
        },
        {
            "Date": "Reviewed in Australia on 21 July 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I liked it fast charge for the price I paid!\nPlug it in to fast charge outlet and its done!\nLove it."
        },
        {
            "Date": "Reviewed in Australia on 10 February 2021",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Work as planned, but doesn't get the fast charge for my xiaomi mi 10 phone sadly. But it's okay"
        },
        {
            "Date": "Reviewed in Australia on 16 May 2022",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Not compatible with Airpods Pro"
        },
        {
            "Date": "Reviewed in Australia on 25 November 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I have a ruggedised case on my iPhone XS. This charger works well to charge the iPhone, where the Apple MagSafe would connect but not charge the battery. This one works and saves your $$."
        },
        {
            "Date": "Reviewed in Australia on 26 November 2021",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Works fine with the Kindle, won't touch the iphone unless taken out of the case, which is too much trouble"
        },
        {
            "Date": "Reviewed in Australia on 7 December 2020",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "i have to put my phone few times until it starts charging. I don't have cover on phone so that is not the issue.\n\nApart from charging issue, it is nice. Once it starts charging, it works fine. Phone charges fine"
        },
        {
            "Date": "Reviewed in Australia on 1 December 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Literally just started working once plugging in. Even works well through Otterbox thick cover as they mentioned. Just adjust expectations as any wireless charging will take longer than when a cable is used."
        },
        {
            "Date": "Reviewed in Australia on 20 February 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I haven't actually used it yet but the delivery was super fast...I bought it with a Kindle and the price was good.\nIt certainly looks easy to use."
        },
        {
            "Date": "Reviewed in Australia on 11 October 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "It's micro usb, seriously.\n\nIt's cheap and crappy, has intermittent faults, sensitive to the phone being absolute dead centre.\n\nI cant believe amazon recommended it."
        },
        {
            "Date": "Reviewed in Australia on 15 December 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Product was a gift"
        },
        {
            "Date": "Reviewed in Australia on 4 June 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I purchased this wireless charger to replace an original Samsung one which stopped. This charger is simply brilliant, very fast & works much better than expected. I highly recommend this charger, you won't be disappointed."
        },
        {
            "Date": "Reviewed in Australia on 20 March 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This wireless charger is cheap and works well with my Samsung Galaxy S10, though the charge is as expected, slow."
        },
        {
            "Date": "Reviewed in Australia on 21 November 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Works well, doesn't take up much space, charges quickly (not as fast as Samsung plug in charger but easier) works well with new Kindle Paperwhite Signature. Recommended."
        },
        {
            "Date": "Reviewed in Australia on 3 September 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Recharging my new kindle"
        },
        {
            "Date": "Reviewed in Australia on 30 July 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great quality. Fast charging. Highly recommended."
        },
        {
            "Date": "Reviewed in Australia on 27 January 2022",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I received this for a gift with my kindle a week ago and it doesn’t even charge the kindle, only my mobile. I also thought that once charged it would work unplugged to the wall but no. I can’t see any benefits for this product. I even paid $20 for a 9v plug … total waste on money…. And my phone wasn’t even charged quick"
        },
        {
            "Date": "Reviewed in Australia on 3 November 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great charger! Super fast and charges through the protective case I have on my phone. No more fumbling with cords.\nFast delivery too."
        },
        {
            "Date": "Reviewed in Australia on 12 July 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Always performs well across their brand"
        },
        {
            "Date": "Reviewed in Australia on 7 December 2021",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Delivered without a power adaptor, when advertised , you are not told you need a special power adaptor, the product is useless and the advertising deceptive."
        },
        {
            "Date": "Reviewed in Australia on 20 November 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "It works really well and looks good. Very happy with my purchase as I was considering a cheaper option"
        },
        {
            "Date": "Reviewed in Australia on 24 June 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "It works as expected"
        },
        {
            "Date": "Reviewed in Australia on 5 December 2021",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "i should have looked closer into this product. Waste of miney because i do not have a product to use it with. i believe false advertising. Thought it would be usable with priduct i puchased. How wrong i was next time i will not purchase adfitional products as are not applicable with my goods."
        },
        {
            "Date": "Reviewed in Australia on 28 May 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Love it, easy to charge. Fast delivery ordered in the morning and received in the evening. Just amazing!"
        },
        {
            "Date": "Reviewed in Australia on 15 May 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Not bad for price"
        },
        {
            "Date": "Reviewed in Australia on 16 December 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This is the only way my iPhone will now charge."
        },
        {
            "Date": "Reviewed in Australia on 30 December 2021",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Doesn't come with a USB-C port."
        },
        {
            "Date": "Reviewed in Australia on 18 December 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Good value for money. Charges my phone quickly."
        },
        {
            "Date": "Reviewed in Australia on 18 February 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Works well, delivery next day pleasantly surprised"
        },
        {
            "Date": "Reviewed in Australia on 16 November 2020",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Charges fast and is very reliable. Have a number of them and all have been great."
        },
        {
            "Date": "Reviewed in Australia on 29 July 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "After use an year suddenly can not use…"
        },
        {
            "Date": "Reviewed in Australia on 11 January 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Works as described - no comments"
        },
        {
            "Date": "Reviewed in Australia on 6 November 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Very nice product at a cheap price"
        },
        {
            "Date": "Reviewed in Australia on 17 November 2021",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I am unable to comment as I have to wait until January next year before I actually receive my device which I have paid for at the same time as the charger and cover. I hope I will then be able to check if they operate adequately!"
        },
        {
            "Date": "Reviewed in Australia on 10 December 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "It’s easy to use. Suits it’s purpose."
        },
        {
            "Date": "Reviewed in Australia on 19 July 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Works great. Bought another. Need you own power brick."
        },
        {
            "Date": "Reviewed in Australia on 13 November 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Like its ease of use"
        },
        {
            "Date": "Reviewed in Australia on 17 December 2022",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Waste of money. Stopped working after a month and is now outside of returns window so it’s going in the bin."
        },
        {
            "Date": "Reviewed in Australia on 14 January 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Value for money"
        },
        {
            "Date": "Reviewed in Australia on 30 November 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Fast shipping, easy to use"
        },
        {
            "Date": "Reviewed in Australia on 1 November 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Awesome amazing thanks"
        },
        {
            "Date": "Reviewed in Australia on 16 May 2022",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Received this as a Xmas gift with my new kindle and less than 5 months later it barely charges. Changed the cord and still nothing. Not worth it"
        },
        {
            "Date": "Reviewed in Australia on 3 April 2021",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Didn’t end up working. Always flashing blue and when I looked it up for help it said to get their specific plug which was another 40 dollars. And they also didn’t have it working in Australia and so the wireless charger ended up being useless."
        },
        {
            "Date": "Reviewed in Australia on 4 March 2020",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "So far it hasn't let me down. Quick charge for my.phone while at work"
        },
        {
            "Date": "Reviewed in Australia on 21 January 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Easy to use, quick charging"
        },
        {
            "Date": "Reviewed in Australia on 20 September 2022",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Was great till it stopped working after 24 hours\nMaybe I got a dud"
        },
        {
            "Date": "Reviewed in Australia on 21 October 2020",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great product"
        },
        {
            "Date": "Reviewed in Australia on 29 October 2021",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "This requires a lot of patience to place your iPhone in the correct charging position. The LED indicator light is difficult to see"
        },
        {
            "Date": "Reviewed in Australia on 21 January 2022",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Delivered without a power adaptor. You are not told you need a special power adaptor. The advertising is deceptive."
        },
        {
            "Date": "Reviewed in Australia on 25 January 2022",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "It's not a fast charger. It does not charge very well."
        },
        {
            "Date": "Reviewed in Australia on 8 May 2022",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "A HIGH QUALITY wireless charger for your phone and other wireless phone accessories. If you want to take full advantage of Quick charge, you will need a Quickcharge 2.0 or greater adapter. NOTE: The charging pad itself can pick up a lot of dust if you live in a dusty environment, so be sure to clean it regularly to maintain proper operation."
        },
        {
            "Date": "Reviewed in Australia on 18 April 2021",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Charging quality"
        }
    ]
}