{
    "Category": "Amazon",
    "Product Name": "NEW X5 Mini Camera HD1080P Compact Wireless WIFI Camera with Cyclic Recording Function Suitable for Outdoor Camping at Home",
    "Product Image": "https://ae-pic-a1.aliexpress-media.com/kf/S1b16471a354648fe91dd8e6f3a071fc9W/NEW-X5-Mini-Camera-HD1080P-Compact-Wireless-WIFI-Camera-with-Cyclic-Recording-Function-Suitable-for-Outdoor.jpg_.webp",
    "Average Star": "3.9",
    "Reviews": [
        {
            "Date": "AliExpress Shopper | 17 Aug 2024",
            "Stars": 0,
            "Review Text": "works amazingly good didn't brake on the way here the app not the best but I also love the stand the charger is a good length"
        },
        {
            "Date": "V***j | 17 Aug 2024",
            "Stars": 0,
            "Review Text": "Quickly sent. Delivery ten days in the general package. All the boxes were dented. Straightened the box in the photo. The camera is visually intact. There is no time to deal with the connection yet."
        },
        {
            "Date": "E***O | 12 Jul 2024",
            "Stars": 0,
            "Review Text": "The packaging arrived well dumpled, apparently the product has not been damaged, it is loading and then I will test. Comes with app manual and QRcode"
        },
        {
            "Date": "AliExpress Shopper | 24 Jul 2024",
            "Stars": 0,
            "Review Text": "You have to read the instructions apparently of the three there is one that is deactivated I am testing it looks very good"
        },
        {
            "Date": "D***y | 13 Aug 2024",
            "Stars": 0,
            "Review Text": "Great product! Great packaging! Fast delivery! Thank you very much for punctuality and decency! Many thanks to the administration of the store and its employees! Great product! Great packaging! Fast delivery! Thank you so much for your punctuality and decency! Many thanks To the store administration and its employees!"
        },
        {
            "Date": "V***a | 09 Aug 2024",
            "Stars": 0,
            "Review Text": "Great bought for that price... recommend the product and seller... shipped very fast aprox 10 days to Slovakia... i will buy again 👍"
        },
        {
            "Date": "J***n | 18 Jul 2024",
            "Stars": 0,
            "Review Text": "Happy with supplier. Let's hope it works! Shipping was fast, delivery was poor."
        },
        {
            "Date": "AliExpress Shopper | 09 Aug 2024",
            "Stars": 0,
            "Review Text": "The package arrived devastated with the pieces scattered everywhere and without protection we hope it goes well."
        },
        {
            "Date": "F***o | 08 Aug 2024",
            "Stars": 0,
            "Review Text": "In a brief test, it is of good acceptance, easy installation. A good daytime image, leaving something to be desired when dark"
        },
        {
            "Date": "AliExpress Shopper | 16 Aug 2024",
            "Stars": 0,
            "Review Text": "Small, this is a slot for a Carty SD, a press, for a koristuvannya, you will need to get a handset on a smartphone, you will need a post-life Jerel, in the sets, you will get an English and Chinese language, cable."
        },
        {
            "Date": "AliExpress Shopper | 09 Jul 2024",
            "Stars": 0,
            "Review Text": "Order was delivered timely.And package 📦 came in disgruntled but item seems to be in good condition.I will test then come back to give update."
        },
        {
            "Date": "A***s | 18 Jul 2024",
            "Stars": 0,
            "Review Text": "Works well, it only needs to be connected to the light for it to work."
        },
        {
            "Date": "O***k | 10 Aug 2024",
            "Stars": 0,
            "Review Text": "Came to put down the shvidko, ale the packaging in the photo, even if you didn't find it."
        },
        {
            "Date": "a***s | 10 Aug 2024",
            "Stars": 0,
            "Review Text": "Hello Hello, where is who is what do you call you where are you from where do you live as you can see you meet you and all you need to see if you are to go visit him and who wants me to do that make"
        },
        {
            "Date": "A***a | 23 Jul 2024",
            "Stars": 0,
            "Review Text": "It is much larger than it is shown a little difficult to make it work but it is useful and arrived super fast"
        },
        {
            "Date": "AliExpress Shopper | 09 Aug 2024",
            "Stars": 0,
            "Review Text": "Hello, good morning, the order has arrived, has arrived quite quickly. I recommend this very communicative seller has good looks I like it very nice. I hope it works well. Thank you for all good day."
        },
        {
            "Date": "2***r | 24 Jul 2024",
            "Stars": 0,
            "Review Text": "Delivery took time and the packaging was well punished, I still haven't tested the product .."
        },
        {
            "Date": "L***z | 12 Jun 2024",
            "Stars": 0,
            "Review Text": "At first I do not understand how to install it but in a matter of minutes and a little English I understand your instructions I recommend the seller Thank you very much"
        },
        {
            "Date": "J***n | 08 Aug 2024",
            "Stars": 0,
            "Review Text": "Much bigger than in the ad photo But I liked the camera"
        },
        {
            "Date": "AliExpress Shopper | 04 Aug 2024",
            "Stars": 0,
            "Review Text": "Product delivered as combined, works well, the box came crumpled, but no damage to the product."
        },
        {
            "Date": "AliExpress Shopper | 23 Jul 2024",
            "Stars": 0,
            "Review Text": "They arrived well, now to see if I can configure them because the instructions come in Chinese and English"
        },
        {
            "Date": "AliExpress Shopper | 16 Jun 2024",
            "Stars": 0,
            "Review Text": "Package in bad condition and open I suppose the fault of the conveyor"
        },
        {
            "Date": "D***r | 16 Jul 2024",
            "Stars": 0,
            "Review Text": "Confirm the description, like it, more still I haven't tested"
        },
        {
            "Date": "S***l | 14 Jul 2024",
            "Stars": 0,
            "Review Text": "Excellent for the price, you have to always leave it connected"
        },
        {
            "Date": "S***m | 09 Aug 2024",
            "Stars": 0,
            "Review Text": "I get an app and pay, I don't know if I'll use it,"
        },
        {
            "Date": "u***A | 19 Aug 2024",
            "Stars": 0,
            "Review Text": "work good but no battery in side camera"
        },
        {
            "Date": "l***z | 21 Jul 2024",
            "Stars": 0,
            "Review Text": "Shattered packing, let's hope the product works"
        },
        {
            "Date": "J***e | 07 Aug 2024",
            "Stars": 0,
            "Review Text": "Ccccccccccccccccccccccccccccccccccccccccffccffffffffffffffcccccccccccccccf ccccccccccccccccccccccccccccccccccccccccffccffffffffffffffcccccccccccccccf"
        },
        {
            "Date": "r***r | 19 Jul 2024",
            "Stars": 0,
            "Review Text": "I thought it was a smaller diameter."
        },
        {
            "Date": "З***л | 16 Aug 2024",
            "Stars": 0,
            "Review Text": "Fast delivery. Looks good. Not tested yet."
        },
        {
            "Date": "E***s | 18 Aug 2024",
            "Stars": 0,
            "Review Text": "Incredible the product arrived perfect with the seller informs. Recommend seller..."
        },
        {
            "Date": "t***a | 16 Aug 2024",
            "Stars": 0,
            "Review Text": "«::: P :::» «::: E :::» «::: R :::» «::: F :::» «:::"
        },
        {
            "Date": "s***f | 03 Aug 2024",
            "Stars": 0,
            "Review Text": "Poor packaging Not yet tested."
        },
        {
            "Date": "F***s | 24 Jul 2024",
            "Stars": 0,
            "Review Text": "Product came correctly. Effective."
        },
        {
            "Date": "U***r | 19 Aug 2024",
            "Stars": 0,
            "Review Text": "Camera with good image, a little slow in the transition of moved camera, I found it a little big, it should be smaller, but that's okay"
        },
        {
            "Date": "J***e | 02 Aug 2024",
            "Stars": 0,
            "Review Text": "I didn't test it yet."
        },
        {
            "Date": "Н***й | 16 Aug 2024",
            "Stars": 0,
            "Review Text": "There are no motion sensors, backlights, and so on, but as a video peephole works well"
        },
        {
            "Date": "l***l | 26 Jul 2024",
            "Stars": 0,
            "Review Text": "Arrived but I haven't tested anything yet"
        },
        {
            "Date": "1***r | 18 Aug 2024",
            "Stars": 0,
            "Review Text": "Yes it was what I asked for but I think it lacks a lot of resolution and speed when recording and the audio is null, but it will help me for what I need it."
        },
        {
            "Date": "B***r | 12 Aug 2024",
            "Stars": 0,
            "Review Text": "N is as small as in the ad."
        },
        {
            "Date": "D***o | 18 Aug 2024",
            "Stars": 0,
            "Review Text": "Very good this camera, the only problem is the delay that delayed a lot"
        },
        {
            "Date": "V***k | 29 Jul 2024",
            "Stars": 0,
            "Review Text": "What is the cost and quality."
        },
        {
            "Date": "D***s | 15 Aug 2024",
            "Stars": 0,
            "Review Text": "Great camera recommend"
        },
        {
            "Date": "E***a | 12 Jul 2024",
            "Stars": 0,
            "Review Text": "Great buy! Item arrived quickly and in great condition!"
        },
        {
            "Date": "G***a | 06 Aug 2024",
            "Stars": 0,
            "Review Text": "I'm still gonna test"
        },
        {
            "Date": "G***k | 19 Aug 2024",
            "Stars": 0,
            "Review Text": "Well made, it works properly."
        },
        {
            "Date": "N***e | 09 Aug 2024",
            "Stars": 0,
            "Review Text": "Received fast and item as described. Thank you."
        },
        {
            "Date": "a***m | 15 Jul 2024",
            "Stars": 0,
            "Review Text": "Good item fast delivery Good coms many thanks"
        },
        {
            "Date": "F***t | 05 Aug 2024",
            "Stars": 0,
            "Review Text": "Not good"
        },
        {
            "Date": "J***L | 29 Jul 2024",
            "Stars": 0,
            "Review Text": "Perfect arrived very fast"
        },
        {
            "Date": "N***o | 19 Jul 2024",
            "Stars": 0,
            "Review Text": "Good product Thanks Aliexpress"
        },
        {
            "Date": "A***a | 19 Jul 2024",
            "Stars": 0,
            "Review Text": "Handy small camera works fine"
        },
        {
            "Date": "AliExpress Shopper | 14 Aug 2024",
            "Stars": 0,
            "Review Text": "Great product.."
        },
        {
            "Date": "AliExpress Shopper | 18 Aug 2024",
            "Stars": 0,
            "Review Text": "Very lightweight but isn't so compact or tiny as I expected. Overall performance yet to test out."
        },
        {
            "Date": "R***a | 29 Jul 2024",
            "Stars": 0,
            "Review Text": "I thought the images would be better but it serves the purpose"
        },
        {
            "Date": "r***o | 19 Jul 2024",
            "Stars": 0,
            "Review Text": "Arrived fast super easy to set up"
        },
        {
            "Date": "R***r | 30 Jul 2024",
            "Stars": 0,
            "Review Text": "super"
        },
        {
            "Date": "י***י | 15 Aug 2024",
            "Stars": 0,
            "Review Text": "Excellent mini camera and wine"
        },
        {
            "Date": "W***o | 29 Jun 2024",
            "Stars": 0,
            "Review Text": "Arrived fast recommend"
        },
        {
            "Date": "G***o | 18 Aug 2024",
            "Stars": 0,
            "Review Text": "Tried it and goes great OK"
        },
        {
            "Date": "M***e | 16 Aug 2024",
            "Stars": 0,
            "Review Text": "Très bien"
        },
        {
            "Date": "S***s | 26 Jun 2024",
            "Stars": 0,
            "Review Text": "we ll see how it works..."
        },
        {
            "Date": "AliExpress Shopper | 19 Aug 2024",
            "Stars": 0,
            "Review Text": "Excellent"
        },
        {
            "Date": "V***k | 25 Jun 2024",
            "Stars": 0,
            "Review Text": "Good product"
        },
        {
            "Date": "f***i | 13 Aug 2024",
            "Stars": 0,
            "Review Text": "good"
        },
        {
            "Date": "5***r | 14 Aug 2024",
            "Stars": 0,
            "Review Text": "Good reception of the mini camera which, I hope will be effective and relevant to Knife expectations. I will not try it. Soon."
        },
        {
            "Date": "C***o | 15 Aug 2024",
            "Stars": 0,
            "Review Text": "It came to me before I still don't try it but it looks good"
        },
        {
            "Date": "R***a | 13 Aug 2024",
            "Stars": 0,
            "Review Text": "I still did not manage to install the app And have to use memory card, don't have it either, I'll have to buy"
        },
        {
            "Date": "R***a | 10 Jul 2024",
            "Stars": 0,
            "Review Text": "Very good, I still do not understand how it works in question of memory card if there is any way that works away from it, I can only access the images when I am in the same way as it"
        },
        {
            "Date": "E***t | 31 Jul 2024",
            "Stars": 0,
            "Review Text": "Camera with very good finish, I still have not tested the image quality, very fast delivery, I recommend both the product and the seller."
        },
        {
            "Date": "AliExpress Shopper | 26 Jul 2024",
            "Stars": 0,
            "Review Text": "Product received on time and as described! All right: * Delivery on time combined. * Features correspond to the description."
        },
        {
            "Date": "H***g | 07 Aug 2024",
            "Stars": 0,
            "Review Text": "a very fast delivery and well packed, thank you for the effort. works perfect."
        },
        {
            "Date": "B***y | 09 Aug 2024",
            "Stars": 0,
            "Review Text": "I got my A$3.90 worth. Make of that what you will."
        },
        {
            "Date": "l***r | 25 Jul 2024",
            "Stars": 0,
            "Review Text": "Arrived safe and sound, box a little crushed but the contents were okay."
        },
        {
            "Date": "C***c | 15 Aug 2024",
            "Stars": 0,
            "Review Text": "Excellent product fulfills its function although it does not feel from very recent materials but for its price it is worth it, I still cannot link it with my device"
        },
        {
            "Date": "B***e | 09 Aug 2024",
            "Stars": 0,
            "Review Text": "Perfect, only plus left to try it, very fast delivery. Very serious seller, I recommend it."
        },
        {
            "Date": "d***l | 06 Aug 2024",
            "Stars": 0,
            "Review Text": "perfect , excellent . very very fast shipping . ..................fast delivery ."
        },
        {
            "Date": "c***n | 30 Jul 2024",
            "Stars": 0,
            "Review Text": "It has not reached me. The shattered box and the nonexistent product."
        },
        {
            "Date": "A***e | 25 Jul 2024",
            "Stars": 0,
            "Review Text": "Very well for the price, the packaging very damaged but the product in excellent condition .."
        },
        {
            "Date": "g***r | 09 Aug 2024",
            "Stars": 0,
            "Review Text": "Yak on your own cat-a bit of norm. Ale knowledge katsapnya near the Pekli is not a viide, for a swim, the body is plastic."
        },
        {
            "Date": "V***s | 07 Aug 2024",
            "Stars": 0,
            "Review Text": "it's bigger that it looked but ok haven't used it yet"
        },
        {
            "Date": "M***a | 25 Jul 2024",
            "Stars": 0,
            "Review Text": "In the ad looked smaller. I hope they work properly. I already tell you."
        },
        {
            "Date": "E***s | 31 Jul 2024",
            "Stars": 0,
            "Review Text": "I will use even later I say yes it is good or not, more the delivery was very fast in the right time are to be congratulated on the delivery😉"
        },
        {
            "Date": "P***a | 30 Jul 2024",
            "Stars": 0,
            "Review Text": "The product arrived on time. I'm satisfied."
        },
        {
            "Date": "J***a | 24 Jul 2024",
            "Stars": 0,
            "Review Text": "Excellent Product thank you very much ...."
        },
        {
            "Date": "H***y | 23 Jul 2024",
            "Stars": 0,
            "Review Text": "Arrived quickly. connected well. the quality is terrible and not comfortable. so, for all things you can use, but mostly buy the best quality and use health"
        },
        {
            "Date": "AliExpress Shopper | 12 Aug 2024",
            "Stars": 0,
            "Review Text": "This product works perfectly just that the box came broken and it says wireless but i fully charged it and took it of charge and it didnt connect but instead of that this worked fine"
        },
        {
            "Date": "E***e | 03 Aug 2024",
            "Stars": 0,
            "Review Text": "It works, a pity not having a battery, it does what it has to do"
        },
        {
            "Date": "K***z | 28 Jul 2024",
            "Stars": 0,
            "Review Text": "Good camera does not have night vision and also not a good support"
        },
        {
            "Date": "M***r | 02 Aug 2024",
            "Stars": 0,
            "Review Text": "I am writing to express my deep dissatisfaction with a recent order from AliExpress. Out of the three items I ordered, I received only two, even though the tracking information indicated that all three items were delivered. This discrepancy has been extremely frustrating. It is concerning that AliExpress does not have adequate procedures to address such issues. When I filed a dispute, I was instructed to provide documentation from the delivery company stating that the package was not delivered. However, there was no way to find the details of the delivery company to obtain this documentation. I reached out to AliExpress for assistance, but received no support or guidance. This lack of response and the inadequate dispute resolution process are extremely disappointing. I hope this review helps others be aware of the potential issues with ordering from AliExpress."
        },
        {
            "Date": "h***o | 24 Jul 2024",
            "Stars": 0,
            "Review Text": "Packaging, very defective but the. Team arrived very well, I give them a 5 The truth is that I did not believe that something so economical would work is like. For one to fix with the rest would not have a common purpose,"
        },
        {
            "Date": "D***k | 05 Aug 2024",
            "Stars": 0,
            "Review Text": "Pratsyu vid cable. Without mergers, not pratsuvatime. Not on the AKB. Jakiste huge Garna! Recommend"
        },
        {
            "Date": "AliExpress Shopper | 07 Aug 2024",
            "Stars": 0,
            "Review Text": "Quick receipt. Arrived ahead of schedule I haven't tested yet, when test I leave my feedback"
        },
        {
            "Date": "B***r | 08 Jul 2024",
            "Stars": 0,
            "Review Text": "Well received your sending quickly and in good condition. Thank you very much"
        },
        {
            "Date": "e***r | 17 Jul 2024",
            "Stars": 0,
            "Review Text": "It is the same as the photo even if I expect it to be smaller, the box arrived damaged, I have not rehearsed it yet, I hope it works bn"
        },
        {
            "Date": "D***. | 14 Aug 2024",
            "Stars": 0,
            "Review Text": "Excellent ratio, price quality"
        },
        {
            "Date": "E***a | 07 Jul 2024",
            "Stars": 0,
            "Review Text": "Very satisfied. Easy to set up and discreet After installed. Thank you and best wishes to you."
        },
        {
            "Date": "M***t | 05 Jul 2024",
            "Stars": 0,
            "Review Text": "Works the size of the presentation is not real the original is bigger, 800 quality no matter how much the menu offers more definition, cheap"
        },
        {
            "Date": "j***r | 14 Aug 2024",
            "Stars": 0,
            "Review Text": "Everything OK recommend this seller"
        },
        {
            "Date": "I***a | 01 Aug 2024",
            "Stars": 0,
            "Review Text": "It is not the best camera but it fulfills its function and for that price it is fine. The problem you have is the app. It's crap"
        },
        {
            "Date": "J***k | 14 Aug 2024",
            "Stars": 0,
            "Review Text": "Problematic with the phone. Dumbly work on the vidstani. Ale you can't do it for yourself."
        },
        {
            "Date": "S***a | 08 Aug 2024",
            "Stars": 0,
            "Review Text": "item arrived on time and seems to be great quality for the price. very happy and recommend this seller and product."
        },
        {
            "Date": "I***s | 20 Jul 2024",
            "Stars": 0,
            "Review Text": "Little resolution, reach about 8 meters, but it is very good for the price"
        },
        {
            "Date": "AliExpress Shopper | 13 Aug 2024",
            "Stars": 0,
            "Review Text": "Is bigger than you imply"
        },
        {
            "Date": "G***r | 30 Jul 2024",
            "Stars": 0,
            "Review Text": "camera frames is terrible and didn't come with SD card"
        },
        {
            "Date": "j***r | 22 Jul 2024",
            "Stars": 0,
            "Review Text": "a great little camera"
        },
        {
            "Date": "B***a | 21 Jul 2024",
            "Stars": 0,
            "Review Text": "I bought it thinking it was wireless... it needs to be connected..."
        },
        {
            "Date": "B***o | 25 Jul 2024",
            "Stars": 0,
            "Review Text": "Excellent quality. I arrived fast and in good condition. Combined order. I recommend it"
        },
        {
            "Date": "S***r | 27 Jul 2024",
            "Stars": 0,
            "Review Text": "great cant wait to set up .came earlier than estimated time .did come out packaging mixed with all my order."
        },
        {
            "Date": "g***r | 06 Aug 2024",
            "Stars": 0,
            "Review Text": "Delivery is fast, arrived a week ahead of schedule. The package is crumpled, but it did not affect the integrity of the goods-everything is whole. I haven't checked my performance yet. If everything is okay, I will buy from this seller again."
        },
        {
            "Date": "AliExpress Shopper | 20 Jul 2024",
            "Stars": 0,
            "Review Text": "In the images \"look\" smaller. But it's OK. I haven't tested it yet."
        },
        {
            "Date": "R***e | 21 Jun 2024",
            "Stars": 0,
            "Review Text": "The camera works very well. Sleep app that is bad."
        },
        {
            "Date": "p***r | 12 Aug 2024",
            "Stars": 0,
            "Review Text": "I still don't know how to program. I write more later."
        },
        {
            "Date": "A***i | 23 Jul 2024",
            "Stars": 0,
            "Review Text": "Very fast delivery and good price, Thanks"
        },
        {
            "Date": "L***s | 13 Jun 2024",
            "Stars": 0,
            "Review Text": "The product meets my needs and exceeds expectations, I certainly recommend this item."
        },
        {
            "Date": "m***r | 07 Jul 2024",
            "Stars": 0,
            "Review Text": "items as described in the listing. good quality, work as they should. well packaged and arrived undamaged."
        },
        {
            "Date": "f***e | 06 Aug 2024",
            "Stars": 0,
            "Review Text": "Very well arrived thank you very much I'll tester"
        },
        {
            "Date": "P***a | 10 Aug 2024",
            "Stars": 0,
            "Review Text": "Unfortunately I could not test the camera does not just charge but does not work. I installed app but it didn't work. Important detail by the app can only use network 2.4 GHz"
        },
        {
            "Date": "j***z | 15 Aug 2024",
            "Stars": 0,
            "Review Text": "I was surprised that it served, gives a good image and connects it to the cell phone by bluethoo but it does not connect by Wi-Fi, it asks for a qr code that did not come with the camera. That's Why I give you 3 stars"
        },
        {
            "Date": "AliExpress Shopper | 11 Jul 2024",
            "Stars": 0,
            "Review Text": "Not defective wine but unfortunate packing, the whole box crushed and opened whole"
        },
        {
            "Date": "AliExpress Shopper | 26 Jul 2024",
            "Stars": 0,
            "Review Text": "Nejde se spárovat, blbej program"
        },
        {
            "Date": "J***n | 29 Jul 2024",
            "Stars": 0,
            "Review Text": "Everything is OK. Fast delivery!! I recommend!!"
        },
        {
            "Date": "D***e | 18 Jul 2024",
            "Stars": 0,
            "Review Text": "Tested with my Android phone and it works. A WiFi camera for just over £2, this camera is about an inch in size. Great value for money."
        },
        {
            "Date": "F***s | 17 Jul 2024",
            "Stars": 0,
            "Review Text": "Arrived ahead of time, it doesn't work in the dark because everything is black, the rest was good."
        },
        {
            "Date": "M***O | 25 Jul 2024",
            "Stars": 0,
            "Review Text": "Very good product, I recommend"
        },
        {
            "Date": "f***r | 28 Jul 2024",
            "Stars": 0,
            "Review Text": "Fast delivery packing not so good"
        },
        {
            "Date": "S***e | 13 Jul 2024",
            "Stars": 0,
            "Review Text": "Very good, just like the ad. Super Indico."
        },
        {
            "Date": "M***a | 29 Jul 2024",
            "Stars": 0,
            "Review Text": "I haven't tried it yet. In brief"
        },
        {
            "Date": "I***o | 09 Aug 2024",
            "Stars": 0,
            "Review Text": "Delivered as promised: quality and date."
        },
        {
            "Date": "a***r | 14 Aug 2024",
            "Stars": 0,
            "Review Text": "Received, Thank You"
        },
        {
            "Date": "J***r | 07 Jul 2024",
            "Stars": 0,
            "Review Text": "Very bn the camera but it is a little bigger than what you see in the photo"
        },
        {
            "Date": "AliExpress Shopper | 15 Aug 2024",
            "Stars": 0,
            "Review Text": "exactly what I thought. awesome 👍"
        },
        {
            "Date": "B***r | 13 Jul 2024",
            "Stars": 0,
            "Review Text": "Arrived well packed, it took us a while to understand the way it works, but in the end it worked..."
        },
        {
            "Date": "e***r | 09 Aug 2024",
            "Stars": 0,
            "Review Text": "It is small, good size. Connects to the cel via a wifi network of the camera without internet (Bluetooth type), but when connecting the phone to the network of the camera, discounts you from the home Wi-Fi or the phone Inter. So you can't remotely see the camera videos. You necessarily have to be connected to her network and be close to it to detect you. It should always be connected, it has good audio video, it has no infrared. Good product for the cost but I thought I could connect with my internet and watch the camera videos remotely."
        },
        {
            "Date": "AliExpress Shopper | 27 Jun 2024",
            "Stars": 0,
            "Review Text": "Fast shipping. Goods top. Anytime again."
        },
        {
            "Date": "AliExpress Shopper | 23 Jul 2024",
            "Stars": 0,
            "Review Text": "Very small camera and it's good"
        },
        {
            "Date": "O***a | 23 Jul 2024",
            "Stars": 0,
            "Review Text": "The delivery is fast. Quality, normal"
        },
        {
            "Date": "V***n | 16 Jul 2024",
            "Stars": 0,
            "Review Text": "Good stuffs. After testing will update later"
        },
        {
            "Date": "L***r | 13 Jul 2024",
            "Stars": 0,
            "Review Text": "It's Little as soon as I'm going to wear it"
        },
        {
            "Date": "V***e | 22 Jul 2024",
            "Stars": 0,
            "Review Text": "I liked it very much now ai ke probalo"
        },
        {
            "Date": "I***o | 24 Jul 2024",
            "Stars": 0,
            "Review Text": "Received on time, now I will use, great!"
        },
        {
            "Date": "h***m | 12 Aug 2024",
            "Stars": 0,
            "Review Text": "I haven't tried yet"
        },
        {
            "Date": "m***r | 03 Aug 2024",
            "Stars": 0,
            "Review Text": "Strange app. But the product arrived right."
        },
        {
            "Date": "r***r | 30 Jul 2024",
            "Stars": 0,
            "Review Text": "Exactly as described"
        },
        {
            "Date": "B***o | 26 Jul 2024",
            "Stars": 0,
            "Review Text": "This product is very good I loved"
        },
        {
            "Date": "K***z | 05 Aug 2024",
            "Stars": 0,
            "Review Text": "Ab t w g h g g h k k k y y u u u u u u u u u u u u u u u u u u u u u u u u u u u u u u u"
        },
        {
            "Date": "g***r | 08 Aug 2024",
            "Stars": 0,
            "Review Text": "Cool camera"
        },
        {
            "Date": "h***y | 07 Aug 2024",
            "Stars": 0,
            "Review Text": "correspond a la description"
        },
        {
            "Date": "f***r | 09 Aug 2024",
            "Stars": 0,
            "Review Text": "Everything arrived OK... I recommend"
        },
        {
            "Date": "J***o | 02 Aug 2024",
            "Stars": 0,
            "Review Text": "Satisfactory purchase."
        },
        {
            "Date": "S***n | 15 Aug 2024",
            "Stars": 0,
            "Review Text": "good"
        },
        {
            "Date": "e***r | 27 Jul 2024",
            "Stars": 0,
            "Review Text": "excelente"
        },
        {
            "Date": "P***d | 02 Aug 2024",
            "Stars": 0,
            "Review Text": "Works Great!"
        },
        {
            "Date": "U***r | 17 Jul 2024",
            "Stars": 0,
            "Review Text": "Great product, I liked it, it was worth it, until the next one."
        },
        {
            "Date": "B***d | 26 Jul 2024",
            "Stars": 0,
            "Review Text": "Thank you !"
        },
        {
            "Date": "s***n | 06 Aug 2024",
            "Stars": 0,
            "Review Text": "It's right I didn't checked that works"
        },
        {
            "Date": "L***o | 01 Aug 2024",
            "Stars": 0,
            "Review Text": "Working"
        },
        {
            "Date": "a***r | 27 Jul 2024",
            "Stars": 0,
            "Review Text": "I really liked the product."
        },
        {
            "Date": "C***a | 15 Aug 2024",
            "Stars": 0,
            "Review Text": "At the time of the test I liked"
        },
        {
            "Date": "d***o | 03 Aug 2024",
            "Stars": 0,
            "Review Text": "Good equal to the ad"
        },
        {
            "Date": "Z***n | 21 Jul 2024",
            "Stars": 0,
            "Review Text": "The item packed well. The software sucks. Plus it should have inbuilt camera. There is no zoom in out option."
        },
        {
            "Date": "S***u | 25 Jul 2024",
            "Stars": 0,
            "Review Text": "Produits correct"
        },
        {
            "Date": "O***a | 24 Jul 2024",
            "Stars": 0,
            "Review Text": "Perfect"
        },
        {
            "Date": "R***t | 12 Jul 2024",
            "Stars": 0,
            "Review Text": "okqy"
        },
        {
            "Date": "w***n | 11 Aug 2024",
            "Stars": 0,
            "Review Text": "ok"
        },
        {
            "Date": "G***a | 10 Aug 2024",
            "Stars": 0,
            "Review Text": "I need Micro card to test it"
        },
        {
            "Date": "A***i | 07 Aug 2024",
            "Stars": 0,
            "Review Text": "Works perfectly"
        },
        {
            "Date": "E***g | 02 Aug 2024",
            "Stars": 0,
            "Review Text": "Beautiful and practical"
        },
        {
            "Date": "F***z | 03 Aug 2024",
            "Stars": 0,
            "Review Text": "Don't wait long."
        },
        {
            "Date": "AliExpress Shopper | 01 Aug 2024",
            "Stars": 0,
            "Review Text": "All good"
        },
        {
            "Date": "e***a | 01 Aug 2024",
            "Stars": 0,
            "Review Text": "Quality fair price"
        },
        {
            "Date": "B***a | 02 Aug 2024",
            "Stars": 0,
            "Review Text": "Great product, worth it"
        },
        {
            "Date": "H***o | 23 Jul 2024",
            "Stars": 0,
            "Review Text": "Very good camera."
        },
        {
            "Date": "C***s | 04 Aug 2024",
            "Stars": 0,
            "Review Text": "Top"
        },
        {
            "Date": "F***s | 23 Jul 2024",
            "Stars": 0,
            "Review Text": "Very good viewing"
        },
        {
            "Date": "AliExpress Shopper | 26 Jul 2024",
            "Stars": 0,
            "Review Text": "i have to tested"
        },
        {
            "Date": "C***é | 29 Jul 2024",
            "Stars": 0,
            "Review Text": "I liked great quality"
        },
        {
            "Date": "V***n | 05 Aug 2024",
            "Stars": 0,
            "Review Text": "Received. Thank you."
        },
        {
            "Date": "J***a | 15 Aug 2024",
            "Stars": 0,
            "Review Text": "Bom"
        },
        {
            "Date": "a***a | 01 Aug 2024",
            "Stars": 0,
            "Review Text": "Show"
        },
        {
            "Date": "AliExpress Shopper | 28 Jul 2024",
            "Stars": 0,
            "Review Text": "All good"
        },
        {
            "Date": "u***r | 18 Jul 2024",
            "Stars": 0,
            "Review Text": "Well received the order not yet tested"
        },
        {
            "Date": "R***e | 05 Aug 2024",
            "Stars": 0,
            "Review Text": "Looks good, cheap and fast"
        },
        {
            "Date": "D***z | 15 Aug 2024",
            "Stars": 0,
            "Review Text": "Ok"
        },
        {
            "Date": "T***o | 26 Jul 2024",
            "Stars": 0,
            "Review Text": "Not working"
        },
        {
            "Date": "T***r | 24 Jul 2024",
            "Stars": 0,
            "Review Text": "Very handy and easy to use"
        },
        {
            "Date": "J***s | 05 Jul 2024",
            "Stars": 0,
            "Review Text": "All perfect"
        },
        {
            "Date": "f***e | 17 Jul 2024",
            "Stars": 0,
            "Review Text": "Order well received Well"
        },
        {
            "Date": "AliExpress Shopper | 17 Jul 2024",
            "Stars": 0,
            "Review Text": "Good product"
        },
        {
            "Date": "m***r | 09 Aug 2024",
            "Stars": 0,
            "Review Text": "super"
        },
        {
            "Date": "M***L | 08 Aug 2024",
            "Stars": 0,
            "Review Text": "Good Camera."
        },
        {
            "Date": "N***r | 26 Jul 2024",
            "Stars": 0,
            "Review Text": "Very good"
        },
        {
            "Date": "M***k | 05 Jun 2024",
            "Stars": 0,
            "Review Text": "nice minicam"
        },
        {
            "Date": "B***r | 29 Jul 2024",
            "Stars": 0,
            "Review Text": "All right"
        },
        {
            "Date": "P***r | 29 Jul 2024",
            "Stars": 0,
            "Review Text": "Still trying to work it out"
        },
        {
            "Date": "A***i | 16 Jul 2024",
            "Stars": 0,
            "Review Text": "I haven't."
        },
        {
            "Date": "L***n | 19 Jul 2024",
            "Stars": 0,
            "Review Text": "Can't get it to sync easily."
        },
        {
            "Date": "G***i | 30 Jul 2024",
            "Stars": 0,
            "Review Text": "Very good."
        },
        {
            "Date": "J***z | 07 Jul 2024",
            "Stars": 0,
            "Review Text": "Thanks"
        },
        {
            "Date": "J***s | 11 Aug 2024",
            "Stars": 0,
            "Review Text": "Very good 100% recommended"
        },
        {
            "Date": "R***z | 19 Jul 2024",
            "Stars": 0,
            "Review Text": "All O.K."
        },
        {
            "Date": "S***a | 01 Jul 2024",
            "Stars": 0,
            "Review Text": "All in the timid station."
        },
        {
            "Date": "N***u | 19 Jul 2024",
            "Stars": 0,
            "Review Text": "super ok"
        },
        {
            "Date": "A***a | 06 Aug 2024",
            "Stars": 0,
            "Review Text": "Top"
        },
        {
            "Date": "Z***r | 23 Jun 2024",
            "Stars": 0,
            "Review Text": "works perfectly"
        },
        {
            "Date": "AliExpress Shopper | 11 Aug 2024",
            "Stars": 0,
            "Review Text": "Everything came"
        },
        {
            "Date": "F***i | 27 Jul 2024",
            "Stars": 0,
            "Review Text": "A+++++"
        },
        {
            "Date": "m***m | 13 Jun 2024",
            "Stars": 0,
            "Review Text": "Perfect."
        },
        {
            "Date": "A***n | 03 Jul 2024",
            "Stars": 0,
            "Review Text": "Thank you, everyone."
        },
        {
            "Date": "L***t | 23 Jul 2024",
            "Stars": 0,
            "Review Text": "good"
        },
        {
            "Date": "U***r | 09 Aug 2024",
            "Stars": 0,
            "Review Text": "good item"
        },
        {
            "Date": "N***a | 01 Aug 2024",
            "Stars": 0,
            "Review Text": "Very discreet to occupy"
        },
        {
            "Date": "g***r | 08 Aug 2024",
            "Stars": 0,
            "Review Text": "Norms."
        },
        {
            "Date": "g***a | 02 Aug 2024",
            "Stars": 0,
            "Review Text": "Ótimo"
        },
        {
            "Date": "j***i | 20 Jun 2024",
            "Stars": 0,
            "Review Text": "Oversized"
        },
        {
            "Date": "O***o | 21 Jun 2024",
            "Stars": 0,
            "Review Text": "Very good and fast"
        },
        {
            "Date": "i***v | 15 Jul 2024",
            "Stars": 0,
            "Review Text": "Not packed well"
        },
        {
            "Date": "B***j | 01 Aug 2024",
            "Stars": 0,
            "Review Text": "Great"
        },
        {
            "Date": "j***s | 20 Jul 2024",
            "Stars": 0,
            "Review Text": "Exelent"
        },
        {
            "Date": "B***r | 14 Jul 2024",
            "Stars": 0,
            "Review Text": "Best of all"
        },
        {
            "Date": "AliExpress Shopper | 09 Jul 2024",
            "Stars": 0,
            "Review Text": "ottimo"
        },
        {
            "Date": "AliExpress Shopper | 19 Jul 2024",
            "Stars": 0,
            "Review Text": "not bad Compared to the price"
        },
        {
            "Date": "H***a | 17 Jul 2024",
            "Stars": 0,
            "Review Text": "I still haven't been able to burst"
        },
        {
            "Date": "s***r | 20 Jul 2024",
            "Stars": 0,
            "Review Text": "good"
        },
        {
            "Date": "K***m | 17 Jul 2024",
            "Stars": 0,
            "Review Text": "Well received I think it only works with a memory card"
        },
        {
            "Date": "AliExpress Shopper | 03 Jul 2024",
            "Stars": 0,
            "Review Text": "Very good"
        },
        {
            "Date": "AliExpress Shopper | 18 Jul 2024",
            "Stars": 0,
            "Review Text": "Great item"
        },
        {
            "Date": "AliExpress Shopper | 09 Jul 2024",
            "Stars": 0,
            "Review Text": "It's good."
        },
        {
            "Date": "g***t | 19 Jul 2024",
            "Stars": 0,
            "Review Text": "All harazd pratsyu"
        },
        {
            "Date": "AliExpress Shopper | 10 Jul 2024",
            "Stars": 0,
            "Review Text": "Good product"
        },
        {
            "Date": "AliExpress Shopper | 29 Jun 2024",
            "Stars": 0,
            "Review Text": "can use ok"
        },
        {
            "Date": "d***c | 23 Jun 2024",
            "Stars": 0,
            "Review Text": "nice"
        },
        {
            "Date": "AliExpress Shopper | 16 Jul 2024",
            "Stars": 0,
            "Review Text": "ottimo"
        },
        {
            "Date": "H***a | 09 Jul 2024",
            "Stars": 0,
            "Review Text": "Tsikavo"
        },
        {
            "Date": "9***r | 10 Jul 2024",
            "Stars": 0,
            "Review Text": "Perfetto"
        },
        {
            "Date": "a***r | 01 Jul 2024",
            "Stars": 0,
            "Review Text": "top"
        },
        {
            "Date": "F***a | 09 Jul 2024",
            "Stars": 0,
            "Review Text": "I haven't tested yet"
        },
        {
            "Date": "G***l | 26 Jun 2024",
            "Stars": 0,
            "Review Text": "super"
        },
        {
            "Date": "T***k | 04 Jul 2024",
            "Stars": 0,
            "Review Text": "Good"
        },
        {
            "Date": "f***r | 04 Jul 2024",
            "Stars": 0,
            "Review Text": "polecam"
        },
        {
            "Date": "A***r | 31 Jul 2024",
            "Stars": 0,
            "Review Text": "I liked it exactly as advertised."
        },
        {
            "Date": "g***r | 24 Jul 2024",
            "Stars": 0,
            "Review Text": "Package damaged"
        },
        {
            "Date": "K***l | 07 Aug 2024",
            "Stars": 0,
            "Review Text": "Haven’t tried it yet"
        },
        {
            "Date": "A***t | 15 Aug 2024",
            "Stars": 0,
            "Review Text": "Received on time Correct packaging Difficult smartphone connection Very greedy application To check in the duration"
        },
        {
            "Date": "a***r | 12 Aug 2024",
            "Stars": 0,
            "Review Text": "In the photo, the camera appears smaller than it really is"
        },
        {
            "Date": "M***o | 28 Jul 2024",
            "Stars": 0,
            "Review Text": "The size is not the same as advertising and the application is very bad to use"
        },
        {
            "Date": "J***z | 14 Aug 2024",
            "Stars": 0,
            "Review Text": "It's bigger d What I expected, I still can't work, my WiFi can't find camera,"
        },
        {
            "Date": "S***a | 15 Aug 2024",
            "Stars": 0,
            "Review Text": "The camera seemed much smaller than it is. When connecting it, it is not easy. In addition, it needs to be connected to the electrical network, and does not bring charger, only the cable. I can't use it for what I wanted."
        },
        {
            "Date": "g***r | 08 Aug 2024",
            "Stars": 0,
            "Review Text": "I can't connect several cameras set, the settings via the application is very disappointing..."
        },
        {
            "Date": "A***C | 23 Jul 2024",
            "Stars": 0,
            "Review Text": "Bigger than it looks in the pictures but it works fine. Good picture quality"
        },
        {
            "Date": "F***r | 25 Jul 2024",
            "Stars": 0,
            "Review Text": "I couldn't tester the hardware because I never managed to connect it to the app."
        },
        {
            "Date": "AliExpress Shopper | 31 Jul 2024",
            "Stars": 0,
            "Review Text": "Poor quality plastic, the order arrived destroyed."
        },
        {
            "Date": "AliExpress Shopper | 01 Aug 2024",
            "Stars": 0,
            "Review Text": "The picture shows full HD and HD but does not record and does not show HD video."
        },
        {
            "Date": "6***r | 24 Jul 2024",
            "Stars": 0,
            "Review Text": "Very good, good resolution, I had a problem because it looked blurry, I had to disarm it to improve the resolution And another drawback is that it heats up a lot, but outside of that it is excellent"
        },
        {
            "Date": "AliExpress Shopper | 23 Jul 2024",
            "Stars": 0,
            "Review Text": "Camera without wide angle, it only resumes a portion. But still functioning and true to the price"
        },
        {
            "Date": "D***l | 06 Aug 2024",
            "Stars": 0,
            "Review Text": "Unfortunately, after charging for a day, I am unable to turn on the unit. The micro switch does click with each press, but no power."
        },
        {
            "Date": "M***r | 24 Jul 2024",
            "Stars": 0,
            "Review Text": "It is not bad for the price but it is a pema that always has to be connected by cable, it is not wireless as it says..."
        },
        {
            "Date": "A***O | 10 Jul 2024",
            "Stars": 0,
            "Review Text": "The camera has no battery and has a very close and closed focus"
        },
        {
            "Date": "AliExpress Shopper | 04 Aug 2024",
            "Stars": 0,
            "Review Text": "Regular, do not know connect fast and the video is neutral quality-price"
        },
        {
            "Date": "AliExpress Shopper | 24 Jul 2024",
            "Stars": 0,
            "Review Text": "Article as described. Failed to connect it"
        },
        {
            "Date": "C***a | 30 Jul 2024",
            "Stars": 0,
            "Review Text": "Received well, just add that the resolution is very low, otherwise everything according to the information."
        },
        {
            "Date": "a***r | 25 Jul 2024",
            "Stars": 0,
            "Review Text": "Can't get it to work at all. Nothing in the manual seems to work. It has no battery to work truly wirelessly. The proprietary app mentioned in the manual can't find it, the computer doesn't recognise it when plugged with USB. It never turns \"off\" it stays blinking a blue light indefinitely. Shame I'll never get to try it out."
        },
        {
            "Date": "K***t | 26 Jul 2024",
            "Stars": 0,
            "Review Text": "works good took me forever to figure out how to use because I lost the instructions but does the job"
        },
        {
            "Date": "A***a | 19 Jul 2024",
            "Stars": 0,
            "Review Text": "Deceptive image. Size other than advertising"
        },
        {
            "Date": "A***k | 20 Jul 2024",
            "Stars": 0,
            "Review Text": "Not so small as on a picture. Real size is bigger. Image quality is very poor and max video frame rate is only 7 fps, it's like a slideshow."
        },
        {
            "Date": "D***e | 26 Jul 2024",
            "Stars": 0,
            "Review Text": "I can't install this camera or call I know yet"
        },
        {
            "Date": "a***r | 04 Jul 2024",
            "Stars": 0,
            "Review Text": "Its packing was so bad and little in rough condition like used or old."
        },
        {
            "Date": "A***i | 27 Jul 2024",
            "Stars": 0,
            "Review Text": "il ne marche pas, il ne capte pas la WiFi"
        },
        {
            "Date": "S***a | 28 Jul 2024",
            "Stars": 0,
            "Review Text": "Fragile product, too big, Vagabond plastic."
        },
        {
            "Date": "F***h | 15 Aug 2024",
            "Stars": 0,
            "Review Text": "I do not know connect to a 5g network, I have not been able to activate it"
        },
        {
            "Date": "a***r | 08 Jul 2024",
            "Stars": 0,
            "Review Text": "The case is nice, although the quality is different from those from the high end, but for such a price a sensational product"
        },
        {
            "Date": "z***l | 23 Jul 2024",
            "Stars": 0,
            "Review Text": "Camera👎👎👎It's horror! Take the old phone, take the old phone, and even if you can cut it now... Knowledge, if you have a photo map of the memory ruined (this pictures, disappeared, as a result on the city of 1MP)"
        },
        {
            "Date": "a***i | 04 Aug 2024",
            "Stars": 0,
            "Review Text": "bigger than it look,complecated to operate"
        },
        {
            "Date": "F***o | 06 Aug 2024",
            "Stars": 0,
            "Review Text": "Few instructions for use, left to be desired."
        },
        {
            "Date": "R***n | 06 Aug 2024",
            "Stars": 0,
            "Review Text": "I do not get it paired with the modem"
        },
        {
            "Date": "Ж***ь | 29 Jul 2024",
            "Stars": 0,
            "Review Text": "Received, a little bit of the box is dented, so it is normal"
        },
        {
            "Date": "AliExpress Shopper | 26 Jul 2024",
            "Stars": 0,
            "Review Text": "It's kind of hard to install it"
        },
        {
            "Date": "I***l | 05 Aug 2024",
            "Stars": 0,
            "Review Text": "Product not very good plus delivery was made"
        },
        {
            "Date": "F***s | 30 Jul 2024",
            "Stars": 0,
            "Review Text": "Outdated item"
        },
        {
            "Date": "I***u | 11 Aug 2024",
            "Stars": 0,
            "Review Text": "The quality is not very good"
        },
        {
            "Date": "B***r | 12 Aug 2024",
            "Stars": 0,
            "Review Text": "Hair value, worth it"
        },
        {
            "Date": "C***i | 31 Jul 2024",
            "Stars": 0,
            "Review Text": "In a can claim for the price"
        },
        {
            "Date": "AliExpress Shopper | 09 Aug 2024",
            "Stars": 0,
            "Review Text": "Is complicated to configure"
        },
        {
            "Date": "AliExpress Shopper | 01 Aug 2024",
            "Stars": 0,
            "Review Text": "positivo"
        },
        {
            "Date": "P***a | 27 Jul 2024",
            "Stars": 0,
            "Review Text": "I'm not satisfied. The camera has no battery, only works connected to a charger. The image quality is not good. At least the app is working well yet"
        },
        {
            "Date": "M***a | 06 Aug 2024",
            "Stars": 0,
            "Review Text": "The box was totally destroyed and has a hole in which I don't know if something is missing, it gives me the feeling that a piece is missing. Poor description, implies that it has battery because put USB charge, but it does not charge, is that the current must provide via USB. The application seems to work well."
        },
        {
            "Date": "b***r | 29 Jun 2024",
            "Stars": 0,
            "Review Text": "The camera is not exactly knowledge"
        },
        {
            "Date": "j***a | 26 Jun 2024",
            "Stars": 0,
            "Review Text": "I still don't use it"
        },
        {
            "Date": "Y***i | 22 Jun 2024",
            "Stars": 0,
            "Review Text": "No battery"
        },
        {
            "Date": "W***i | 10 Jul 2024",
            "Stars": 0,
            "Review Text": "Good item"
        },
        {
            "Date": "AliExpress Shopper | 30 Jul 2024",
            "Stars": 0,
            "Review Text": "box was damaged and image quality very poor....even on full hd"
        },
        {
            "Date": "S***z | 18 Aug 2024",
            "Stars": 0,
            "Review Text": "The packaging arrived all broken and damaged, and when I connect the camera it does not turn on anything or gives a sign of life"
        },
        {
            "Date": "T***i | 28 Jul 2024",
            "Stars": 0,
            "Review Text": "The size is not according to the advertisment"
        },
        {
            "Date": "S***i | 06 Jul 2024",
            "Stars": 0,
            "Review Text": "I am happy to have it, It took me 15 years ago when I bought my first camera, costly and low resolution, and scratchy view."
        },
        {
            "Date": "AliExpress Shopper | 12 Aug 2024",
            "Stars": 0,
            "Review Text": "I still haven't been able to turn on the device Has the app but it's too complicated I'm trying to see if I can get the camera to work"
        },
        {
            "Date": "N***i | 01 Aug 2024",
            "Stars": 0,
            "Review Text": "Weak"
        },
        {
            "Date": "P***. | 29 Jul 2024",
            "Stars": 0,
            "Review Text": "Faulty wrap"
        },
        {
            "Date": "9***r | 18 Aug 2024",
            "Stars": 0,
            "Review Text": "I do not recommend it, the product arrived late and when I arrived, I tried it and it does not work for me."
        },
        {
            "Date": "l***i | 18 Aug 2024",
            "Stars": 0,
            "Review Text": "Does not have a QR X scan NN understand how to connect without instructions ce someone that a video tutorial?"
        },
        {
            "Date": "e***e | 14 Aug 2024",
            "Stars": 0,
            "Review Text": "night vision is just black screen, no images senbility is bad, need tons of lights to have good images"
        },
        {
            "Date": "P***s | 23 Jul 2024",
            "Stars": 0,
            "Review Text": "Does not work as it is impossible to turn on the camera!"
        },
        {
            "Date": "M***a | 13 Aug 2024",
            "Stars": 0,
            "Review Text": "Below Expectations need power or battery to work"
        },
        {
            "Date": "E***s | 13 Aug 2024",
            "Stars": 0,
            "Review Text": "I didn't like the product, I can't even connect to WiFi or Bluetooth"
        },
        {
            "Date": "U***o | 24 Jul 2024",
            "Stars": 0,
            "Review Text": "The price was low, therefore I'm not asking for a refurnd. but I wish to let you know that it does NOT work: - Battery: it was not possibile to charghe it (even if I let it connected to the power source for 1 full day) - When connected permanently to the power, 1 time over 10-15 it's possible to see something. but only randomly... - In these rares monents, I was able to see something, but blurred and very, very white.. Summarizing: a very nice product (looks good !) but unuseable at all..."
        },
        {
            "Date": "P***a | 10 Aug 2024",
            "Stars": 0,
            "Review Text": "can't get it to work need better instructions and bigger writing on them"
        },
        {
            "Date": "AliExpress Shopper | 10 Aug 2024",
            "Stars": 0,
            "Review Text": "Well, work, but a wifi camera without battery... Now you put an external battery with its cable and it is super discreet and wireless."
        },
        {
            "Date": "AliExpress Shopper | 14 Aug 2024",
            "Stars": 0,
            "Review Text": "The product arrived on time, but no matter how long it stays in the charger, it does not charge"
        },
        {
            "Date": "AliExpress Shopper | 19 Aug 2024",
            "Stars": 0,
            "Review Text": "Great👍"
        },
        {
            "Date": "I***F | 19 Aug 2024",
            "Stars": 0,
            "Review Text": "good"
        },
        {
            "Date": "V***O | 19 Aug 2024",
            "Stars": 0,
            "Review Text": "I'm very satisfied"
        },
        {
            "Date": "f***r | 15 Jul 2024",
            "Stars": 0,
            "Review Text": "The camera is too big to be a spy, in the photograph it looks much smaller, it is difficult to hide it without being noticed, the rest, everything is fine."
        },
        {
            "Date": "L***a | 12 Jul 2024",
            "Stars": 0,
            "Review Text": "Don't have any user manual. And no branded. And it had no catalogues. And I couldn't even fix the stand."
        },
        {
            "Date": "C***o | 26 Jun 2024",
            "Stars": 0,
            "Review Text": "I still couldn't connect to make it work. When it plugs into a cable for charging, it does not have a charging signal."
        },
        {
            "Date": "B***s | 18 Jul 2024",
            "Stars": 0,
            "Review Text": "camera image is unacurate, its far from mini, 2cm on 3cm its a huge camera..."
        },
        {
            "Date": "AliExpress Shopper | 17 Jul 2024",
            "Stars": 0,
            "Review Text": "Doesn’t work for long. Instructions are bad and the IOS app has a terrible rating and now I know why."
        },
        {
            "Date": "M***O | 17 Jul 2024",
            "Stars": 0,
            "Review Text": "Great product for the price and very low quality but all"
        },
        {
            "Date": "B***c | 19 Jul 2024",
            "Stars": 0,
            "Review Text": "No notice in the box! Does not respond to Knife messages!"
        },
        {
            "Date": "R***v | 31 Jul 2024",
            "Stars": 0,
            "Review Text": "does not work without charger is not good"
        },
        {
            "Date": "AliExpress Shopper | 17 Jun 2024",
            "Stars": 0,
            "Review Text": "for its cost it is ok. The App is terrible!! It shows often ads."
        },
        {
            "Date": "J***s | 24 Jul 2024",
            "Stars": 0,
            "Review Text": "a lot lot bigger than they make it look"
        },
        {
            "Date": "AliExpress Shopper | 10 Jul 2024",
            "Stars": 0,
            "Review Text": "I didn't take advantage of the Cams, because the instructions were unclear. The app also doesn't work."
        },
        {
            "Date": "i***u | 04 Aug 2024",
            "Stars": 0,
            "Review Text": "box was damaged and image quality very poor...."
        },
        {
            "Date": "O***a | 03 Aug 2024",
            "Stars": 0,
            "Review Text": "Terrible quality. Bigger then the ad photos. Not work without connect to USB."
        },
        {
            "Date": "AliExpress Shopper | 05 Aug 2024",
            "Stars": 0,
            "Review Text": "Very bad quality overall. Image, performance, app."
        },
        {
            "Date": "G***o | 15 Jul 2024",
            "Stars": 0,
            "Review Text": "Bad quality, indecent app, it evaluates returns"
        },
        {
            "Date": "J***a | 12 Jul 2024",
            "Stars": 0,
            "Review Text": "For the price one can't talk much😔"
        },
        {
            "Date": "R***e | 25 Jul 2024",
            "Stars": 0,
            "Review Text": "Very large"
        },
        {
            "Date": "AliExpress Shopper | 12 Aug 2024",
            "Stars": 0,
            "Review Text": "Has arrived with the packaging in poor condition and the instructions in language that is not correct with which you have to guess its operation"
        },
        {
            "Date": "a***a | 31 Jul 2024",
            "Stars": 0,
            "Review Text": "Pretty good"
        },
        {
            "Date": "G***r | 03 Jul 2024",
            "Stars": 0,
            "Review Text": "Very hard to set up as intended and still unable."
        },
        {
            "Date": "AliExpress Shopper | 04 Aug 2024",
            "Stars": 0,
            "Review Text": "I find it big"
        },
        {
            "Date": "p***r | 07 Aug 2024",
            "Stars": 0,
            "Review Text": "The quality is very poor"
        },
        {
            "Date": "E***s | 10 Aug 2024",
            "Stars": 0,
            "Review Text": "I didn't like it."
        },
        {
            "Date": "a***b | 21 Jul 2024",
            "Stars": 0,
            "Review Text": "Difficult to operate"
        },
        {
            "Date": "l***r | 23 Jul 2024",
            "Stars": 0,
            "Review Text": "Really wanted it to really work, which did not happen, and really a commodity, this seller is out"
        },
        {
            "Date": "AliExpress Shopper | 02 Jul 2024",
            "Stars": 0,
            "Review Text": "No manual to direct and operate, no place sign to on or off. I hope I will get value for money please. send the necessary instructions, manual on how to operate and use this please 🥺"
        },
        {
            "Date": "V***k | 27 Jun 2024",
            "Stars": 0,
            "Review Text": "It does not work, there is no possibility to connect"
        },
        {
            "Date": "AliExpress Shopper | 10 Aug 2024",
            "Stars": 0,
            "Review Text": "A disappointment"
        },
        {
            "Date": "a***r | 11 Aug 2024",
            "Stars": 0,
            "Review Text": "The condition of the product is not admissible. Everything that is supposed to be is coming, although the camera power manual, no (the SD card either). The product is clearly used and let's go, but it's because I plug it in, I think the camera doesn't work. It is not that the battery is discharged, it is that it never charges and must always be plugged in. As for the operation, let's not go any further with the issue of alarms, we are going to something simpler such as the detection of movements that does not work because not even I put in front and with a high level of detection, launch the photo or record the video that in theory could be made with your software. In short, because there is no zero, if not it is taken and much of the blame lies with the seller for sending a product that he knows is in poor condition."
        },
        {
            "Date": "V***n | 24 Jul 2024",
            "Stars": 0,
            "Review Text": "Tse G... no pratsyu. niyak vid words zvsim. With rozmir, exactly kidalovo. to separate Sami. in the advertising of the Whiglyadai in two times with a change of heat. Do not vitrine in vain"
        },
        {
            "Date": "U***t | 12 Aug 2024",
            "Stars": 0,
            "Review Text": "best shipping for customer"
        },
        {
            "Date": "6***r | 13 Aug 2024",
            "Stars": 0,
            "Review Text": "Overall a rubbish product. Could not get it to work at all. Don’t recommend. A waste of money. Instructions terrible."
        },
        {
            "Date": "C***z | 19 Aug 2024",
            "Stars": 0,
            "Review Text": "Very bad the application does not work and the camera less I do not recommend it at all is a useless product"
        },
        {
            "Date": "j***e | 02 Aug 2024",
            "Stars": 0,
            "Review Text": "I did not like it since the product says it is wireless and does not turn on without being connected"
        },
        {
            "Date": "A***n | 18 Jul 2024",
            "Stars": 0,
            "Review Text": "not working"
        },
        {
            "Date": "F***r | 17 Aug 2024",
            "Stars": 0,
            "Review Text": "Is not working properly. Does not record according to the paramet os introduced. A scam. I do not return it because the effort will not be profitable, for the price it cost me. Is a hoax .."
        },
        {
            "Date": "a***r | 19 Jul 2024",
            "Stars": 0,
            "Review Text": "Lent bad."
        },
        {
            "Date": "AliExpress Shopper | 03 Jul 2024",
            "Stars": 0,
            "Review Text": "Disappointment"
        },
        {
            "Date": "F***s | 17 Jul 2024",
            "Stars": 0,
            "Review Text": "order received, but I don't understand how to install. I have tried and tired! is it to be switched on, is it to be used why plugged?"
        },
        {
            "Date": "l***r | 18 Aug 2024",
            "Stars": 0,
            "Review Text": "Don’t waste your time. Mine is in the bin. It does not work"
        },
        {
            "Date": "AliExpress Shopper | 12 Jul 2024",
            "Stars": 0,
            "Review Text": "Great is not as the promotional picture and does not have an important battery to disappoint"
        },
        {
            "Date": "k***r | 07 Aug 2024",
            "Stars": 0,
            "Review Text": "received a damaged product, not working"
        },
        {
            "Date": "P***V | 13 Jul 2024",
            "Stars": 0,
            "Review Text": "Can’t really call it mini cam + I couldn’t add it to iPhone app so it’s useless to me 👎"
        },
        {
            "Date": "G***a | 01 Aug 2024",
            "Stars": 0,
            "Review Text": "Very poor quality, lousy pipeline"
        },
        {
            "Date": "D***i | 13 Aug 2024",
            "Stars": 0,
            "Review Text": "Quality is poop"
        },
        {
            "Date": "F***r | 27 Jun 2024",
            "Stars": 0,
            "Review Text": "Received in poor condition and does not work."
        },
        {
            "Date": "Y***i | 06 Aug 2024",
            "Stars": 0,
            "Review Text": "Came open and broken"
        },
        {
            "Date": "1***r | 25 Jul 2024",
            "Stars": 0,
            "Review Text": "Unfortunately it does not work😞"
        },
        {
            "Date": "AliExpress Shopper | 17 Aug 2024",
            "Stars": 0,
            "Review Text": "Very bad product"
        },
        {
            "Date": "a***i | 03 Aug 2024",
            "Stars": 0,
            "Review Text": "bas use karna nahi araha"
        },
        {
            "Date": "g***o | 11 Aug 2024",
            "Stars": 0,
            "Review Text": "Does not work RERO recention"
        },
        {
            "Date": "o***n | 25 Jul 2024",
            "Stars": 0,
            "Review Text": "hahaha 😂😂😂😂😅😅"
        },
        {
            "Date": "E***t | 18 Aug 2024",
            "Stars": 0,
            "Review Text": "I haven't received the package"
        },
        {
            "Date": "AliExpress Shopper | 17 Aug 2024",
            "Stars": 0,
            "Review Text": "Not working"
        },
        {
            "Date": "A***a | 25 Jun 2024",
            "Stars": 0,
            "Review Text": "the pack arrived destroyed!"
        },
        {
            "Date": "C***u | 16 Aug 2024",
            "Stars": 0,
            "Review Text": "It came broken"
        },
        {
            "Date": "m***h | 11 Jul 2024",
            "Stars": 0,
            "Review Text": "The app is not working and the size is large"
        },
        {
            "Date": "E***o | 31 Jul 2024",
            "Stars": 0,
            "Review Text": "Bad experience in the images make you see the small camera but it is bigger than what you see in the publication you load it and it does not work, its packaging is bad, the box was uncovered in very bad condition"
        },
        {
            "Date": "AliExpress Shopper | 31 Jul 2024",
            "Stars": 0,
            "Review Text": "Does not work!!! Don't spend your time buying it, or your money as they don't refund you"
        },
        {
            "Date": "B***f | 16 Aug 2024",
            "Stars": 0,
            "Review Text": "Frankly cest6 of anything they know that the item ordered part. part in France and I find everything in Chinese. I couldn't really understand how to install it or what to do I pre-order not this camera"
        },
        {
            "Date": "M***o | 19 Jul 2024",
            "Stars": 0,
            "Review Text": "it seems not charge at all. It works only when connected to a charger. Blue led indication is not easy visibile. UHD mode very similar to HD."
        },
        {
            "Date": "A***s | 04 Aug 2024",
            "Stars": 0,
            "Review Text": "The goods did not come working. Communication with the seller did not bring results. Besides, the product is different from the photo on the page, it is much larger. I do not recommend the seller."
        },
        {
            "Date": "AliExpress Shopper | 29 Jul 2024",
            "Stars": 0,
            "Review Text": "Not vaux la comb cannot install pfff a product to flee"
        },
        {
            "Date": "A***a | 22 Jul 2024",
            "Stars": 0,
            "Review Text": "Does not work, does not have battery or battery the software does not allow it to install because it has malware. My recommendation do not buy it. The debolution as it puts in the article, nor do I bother you have to do many procedures, photos and a lot of waste of time."
        },
        {
            "Date": "S***i | 16 Aug 2024",
            "Stars": 0,
            "Review Text": "Camere cannot connect with the app. The QR code is missing. I managed to make it work once and then stop. Dont buy it!"
        },
        {
            "Date": "AliExpress Shopper | 26 Jul 2024",
            "Stars": 0,
            "Review Text": "I am not satisfied. Because the viewing angle is narrow, the resolution is not FHD1080P."
        },
        {
            "Date": "D***r | 31 Jul 2024",
            "Stars": 0,
            "Review Text": "The instructions were not useful. It doesn't work with any \"x5\" wifi cam app offered on play store. The size is quite huge, and also it emits an audible sound that hurts the ears when it is near you. I've used wifi cams before and cannot get this to work at all. I would not buy this again!"
        },
        {
            "Date": "V***F | 26 Jul 2024",
            "Stars": 0,
            "Review Text": "A disappointment. I'm still trying to find out how it works and if it works because for me it is broken since no device recognizes it."
        },
        {
            "Date": "L***n | 01 Aug 2024",
            "Stars": 0,
            "Review Text": "Utterly useless. Only switches on when connected to power lead. Even when on, doesn’t connect to app. App is atrocious, and reviewed as such on App Store."
        },
        {
            "Date": "c***r | 06 Aug 2024",
            "Stars": 0,
            "Review Text": "Waste of space! Tried downloading app 3 times, still don't work! Instructions are a joke!"
        },
        {
            "Date": "Y***k | 12 Aug 2024",
            "Stars": 0,
            "Review Text": "Not pratsyu. If you have a QR is not a pratsyu. Do not recommend. Flattened packing"
        },
        {
            "Date": "h***e | 24 Jul 2024",
            "Stars": 0,
            "Review Text": "No interest because it is impossible to start the application so does not work!!!"
        },
        {
            "Date": "AliExpress Shopper | 23 Jul 2024",
            "Stars": 0,
            "Review Text": "item received. but not work."
        },
        {
            "Date": "p***r | 14 Aug 2024",
            "Stars": 0,
            "Review Text": "Pitiful mind the application that serves for the article does not discharge"
        },
        {
            "Date": "V***i | 05 Aug 2024",
            "Stars": 0,
            "Review Text": "Camera does not work, has no battery and does not connect with the app. The announcement does not mention that the camera must always be connected to the USB to be energized."
        },
        {
            "Date": "w***r | 04 Aug 2024",
            "Stars": 0,
            "Review Text": "This item was lost and I did not receive it took a month and in the end I did not receive this product but PA I got a refund."
        },
        {
            "Date": "f***r | 28 Jul 2024",
            "Stars": 0,
            "Review Text": "Useless. Bad product. App that does not connect a non-working toy"
        },
        {
            "Date": "k***k | 05 Aug 2024",
            "Stars": 0,
            "Review Text": "The app does not work. Because of which there is no use for the camera"
        },
        {
            "Date": "AliExpress Shopper | 06 Aug 2024",
            "Stars": 0,
            "Review Text": "This item doesn’t work the app is so bad can not connect to the camera in any way so don’t buy it ! Don’t waste your money"
        },
        {
            "Date": "A***d | 24 Jul 2024",
            "Stars": 0,
            "Review Text": "What a poor thing, I could never connect to the cam... I am real and I know that for the price I did not expect more, very disappointed"
        },
        {
            "Date": "M***a | 09 Aug 2024",
            "Stars": 0,
            "Review Text": "Ad full app I couldn't make it work"
        },
        {
            "Date": "AliExpress Shopper | 01 Aug 2024",
            "Stars": 0,
            "Review Text": "couldn't get it to work. the app required way too much phone permission and doesn't work without. It looks suspicious to me."
        },
        {
            "Date": "AliExpress Shopper | 07 Aug 2024",
            "Stars": 0,
            "Review Text": "A Camerata not for a beggar is of limited quality and not my own, but even a half-word for a beggar naksva, the image is given for a coffee machine with a box of otiva!"
        },
        {
            "Date": "H***r | 03 Aug 2024",
            "Stars": 0,
            "Review Text": "The device refuses to work as advertised. It could not find the proper wi-fi connection."
        },
        {
            "Date": "f***a | 05 Aug 2024",
            "Stars": 0,
            "Review Text": "Quickly received completely nil the application pass but the camera is not connected to the Wi-Fi network of the box but to its own network so only works nearby a pity it could be very good"
        },
        {
            "Date": "F***t | 14 Aug 2024",
            "Stars": 0,
            "Review Text": "it wouldn't turn on so I put it on charge and left it for the day because the red light wouldn't go out or change, I eventually gave in and took it off charge thinking it would at least have some charge but no, still wouldn't turn on. also, I can't return or refund it, the app physically won't let me because I need to include a photo which I added about 5 times. don't waste your money on this crap"
        },
        {
            "Date": "B***s | 05 Aug 2024",
            "Stars": 0,
            "Review Text": "The product isn’t working : been charging for two hours, the battery is dead, I can connect it only if plugged."
        },
        {
            "Date": "S***6 | 02 Aug 2024",
            "Stars": 0,
            "Review Text": "I wish i could give a big zero stars, scam, very bad quality doesn't work , the seller refused to refund ,safe your money"
        },
        {
            "Date": "6***r | 28 Jul 2024",
            "Stars": 0,
            "Review Text": "I have not even managed to turn it on. Very bad purchase. Don't do it."
        },
        {
            "Date": "L***k | 03 Aug 2024",
            "Stars": 0,
            "Review Text": "If you install the camera, you only get advertising apps. Because of this, I cannot install the camera"
        },
        {
            "Date": "a***r | 11 Aug 2024",
            "Stars": 0,
            "Review Text": "Much bigger than the images. App for unstable operation. Not recommended"
        },
        {
            "Date": "c***n | 31 Jul 2024",
            "Stars": 0,
            "Review Text": "Very bad quality, and the app has ads... this item is paying for collection of information it doesn't serve the main purpose..."
        },
        {
            "Date": "o***r | 23 Jun 2024",
            "Stars": 0,
            "Review Text": "No idea: for all I know it’s just fantastic . Currently just 2 tiny bits pieces of plastic because neither one connects!!!!!!! As far as my router is concerned, they’re non existent! Got refunded."
        },
        {
            "Date": "N***a | 15 Jul 2024",
            "Stars": 0,
            "Review Text": "It is useless and to make the return I get twice what it cost this crap"
        },
        {
            "Date": "k***r | 17 Jul 2024",
            "Stars": 0,
            "Review Text": "does not work, blue LED does not light, does not connect to the application"
        },
        {
            "Date": "G***e | 19 Aug 2024",
            "Stars": 0,
            "Review Text": "Installed with difficulty"
        },
        {
            "Date": "G***r | 18 Jul 2024",
            "Stars": 0,
            "Review Text": "Ez egy hulladék. A ysxlite aplikáció kell hozzá,nézd meg a véleményeket róla mielött megvennéd. Küzdelmes beüzemelni, nem reagál mozgásra, melegszik, folyton megszakad a kapcsolat.Nem működik távolról. Egyedül a folyamatos rögzítés működik, de csak addig amíg a telefonban megy az aplikáció, amihez bekapcsolva kell lenni a Bluetoothnak indoklatlanul. Átverés. This product is garbage. You need the ysxlite app to use it; check the reviews before buying. It's a struggle to set up, doesn't respond to motion, overheats, and constantly loses connection. It doesn't work remotely. The only thing that works is continuous recording, but only while the app is running on your phone, which requires Bluetooth to be on for no good reason. It's a scam."
        },
        {
            "Date": "E***r | 04 Jul 2024",
            "Stars": 0,
            "Review Text": "Bigger than announced. Heats up a lot. Image quality even though it puts 1080, 2k and 4k NO joke is. But the worst thing is that it disconnects every two seconds. The frame rate is 3o 4 maximum which makes it useless. The outdoor camping thing will be if you have an external battery since it has to always be connected, so the spy camera has little. In short, a disaster that I do not recommend at all. The box arrived half destroyed. The only thing is that I arrived a day earlier."
        },
        {
            "Date": "S***i | 06 Aug 2024",
            "Stars": 0,
            "Review Text": "I didn’t received my items so I would like to say bad service"
        },
        {
            "Date": "R***W | 13 Jul 2024",
            "Stars": 0,
            "Review Text": "The software is not compatible with my device. It's a Nokia not an obscure brand. Camera is useless to me. Advert should mention any incompatible devices."
        },
        {
            "Date": "f***o | 10 Jul 2024",
            "Stars": 0,
            "Review Text": "Camera not work ! I can't connect with my phone or id broken. No manuals , instruction is poor . I don't recommend this cheap plastic."
        },
        {
            "Date": "o***A | 01 Jul 2024",
            "Stars": 0,
            "Review Text": "The worst buy. Camera without battery. The record goes to the phone on command only, but writes to the memory card only when he wants. It is impossible to configure (besides, the possibilities of ARR are very limited). It heats up a lot. Does not react nor movement. It is impossible to properly install on the surface or somehow fix."
        },
        {
            "Date": "AliExpress Shopper | 19 Jul 2024",
            "Stars": 0,
            "Review Text": "Twice as big as they advertise is useless, although if you open it it is very small, it does not connect to the app and does not turn on or do anything."
        },
        {
            "Date": "P***g | 15 Jun 2024",
            "Stars": 0,
            "Review Text": "App with advertising during install, unclear explanation how to connect"
        },
        {
            "Date": "R***k | 31 Jul 2024",
            "Stars": 0,
            "Review Text": "I have not received the order, according to this it is already here but they have not called me"
        },
        {
            "Date": "R***M | 30 Jun 2024",
            "Stars": 0,
            "Review Text": "No motion detection, Bluetooth is not recognized. Too bad"
        },
        {
            "Date": "P***o | 15 Aug 2024",
            "Stars": 0,
            "Review Text": "This room literally sucks"
        },
        {
            "Date": "AliExpress Shopper | 18 Jul 2024",
            "Stars": 0,
            "Review Text": "The app doesn’t work!!! App doesn’t match the app which appears on the instructions. No way to use the camera!!"
        },
        {
            "Date": "AliExpress Shopper | 16 Aug 2024",
            "Stars": 0,
            "Review Text": "Very very bad it’s not helpful for any use"
        },
        {
            "Date": "S***t | 11 Jul 2024",
            "Stars": 0,
            "Review Text": "Item is useless. Doesn't power on. Doesn't have internal battery. Doesn't work as described. Phone app doesn't work. Phone app asks for permissions that are security risks. Phone app is full of ads for other businesses. Phone app opens ads and links to other businesses at random without interaction from user."
        },
        {
            "Date": "G***o | 15 Jul 2024",
            "Stars": 0,
            "Review Text": "It does not work if it is not in the socket, it does not work at night, it is difficult to connect. Terrible"
        },
        {
            "Date": "R***c | 25 Jul 2024",
            "Stars": 0,
            "Review Text": "Does not work, impossible connection to the Wifi."
        },
        {
            "Date": "A***i | 13 Jul 2024",
            "Stars": 0,
            "Review Text": "Camera of poor quality the drums does not charge and the night resolution even if there is non-existent you do not see anything."
        },
        {
            "Date": "N***i | 12 Aug 2024",
            "Stars": 0,
            "Review Text": "No app for Samsung phone"
        },
        {
            "Date": "L***z | 02 Aug 2024",
            "Stars": 0,
            "Review Text": "Came open all broken the piece"
        },
        {
            "Date": "e***r | 20 Jul 2024",
            "Stars": 0,
            "Review Text": "Bad not to use"
        },
        {
            "Date": "i***r | 21 Jul 2024",
            "Stars": 0,
            "Review Text": "Everyone is chewed, otherwise the car was driving"
        },
        {
            "Date": "f***r | 25 Jul 2024",
            "Stars": 0,
            "Review Text": "Bad product. It has leave the market"
        },
        {
            "Date": "AliExpress Shopper | 27 Jul 2024",
            "Stars": 0,
            "Review Text": "sorry no Good"
        },
        {
            "Date": "r***r | 22 Jul 2024",
            "Stars": 0,
            "Review Text": "Not to buy, not worth"
        },
        {
            "Date": "AliExpress Shopper | 01 Aug 2024",
            "Stars": 0,
            "Review Text": "Item not received!!!"
        },
        {
            "Date": "J***o | 17 Jul 2024",
            "Stars": 0,
            "Review Text": "Holy shit, you don't know"
        },
        {
            "Date": "P***m | 13 Aug 2024",
            "Stars": 0,
            "Review Text": "At me it does not work at all"
        },
        {
            "Date": "N***o | 05 Aug 2024",
            "Stars": 0,
            "Review Text": "si surriscalda e va offline"
        },
        {
            "Date": "D***r | 12 Aug 2024",
            "Stars": 0,
            "Review Text": "Llego colo indicates the description"
        },
        {
            "Date": "D***t | 06 Aug 2024",
            "Stars": 0,
            "Review Text": "There is No way to install it, it is useless"
        },
        {
            "Date": "r***r | 23 Jul 2024",
            "Stars": 0,
            "Review Text": "no enciende no comecta"
        },
        {
            "Date": "D***a | 14 Aug 2024",
            "Stars": 0,
            "Review Text": "No me llego"
        },
        {
            "Date": "R***a | 24 Jul 2024",
            "Stars": 0,
            "Review Text": "Half mouth"
        },
        {
            "Date": "G***t | 21 Jul 2024",
            "Stars": 0,
            "Review Text": "Does not work"
        },
        {
            "Date": "AliExpress Shopper | 05 Aug 2024",
            "Stars": 0,
            "Review Text": "Not recomanded"
        },
        {
            "Date": "H***J | 01 Aug 2024",
            "Stars": 0,
            "Review Text": "Camera doesn't work"
        },
        {
            "Date": "R***t | 31 Jul 2024",
            "Stars": 0,
            "Review Text": "Gadget"
        },
        {
            "Date": "h***r | 13 Aug 2024",
            "Stars": 0,
            "Review Text": "Not good."
        },
        {
            "Date": "R***o | 01 Aug 2024",
            "Stars": 0,
            "Review Text": "One too many to set up"
        },
        {
            "Date": "AliExpress Shopper | 26 Jul 2024",
            "Stars": 0,
            "Review Text": "Didn't work"
        },
        {
            "Date": "AliExpress Shopper | 08 Aug 2024",
            "Stars": 0,
            "Review Text": "Apparatus HS"
        },
        {
            "Date": "a***r | 16 Aug 2024",
            "Stars": 0,
            "Review Text": "Nihuya is not working"
        },
        {
            "Date": "AliExpress Shopper | 17 Jul 2024",
            "Stars": 0,
            "Review Text": "The App does not work.Waste of time."
        },
        {
            "Date": "m***l | 31 Jul 2024",
            "Stars": 0,
            "Review Text": "Something strange from six"
        },
        {
            "Date": "M***i | 28 Jul 2024",
            "Stars": 0,
            "Review Text": "useless item"
        },
        {
            "Date": "AliExpress Shopper | 29 Jul 2024",
            "Stars": 0,
            "Review Text": "too big , no battery"
        },
        {
            "Date": "S***a | 03 Aug 2024",
            "Stars": 0,
            "Review Text": "Is worth nothing"
        },
        {
            "Date": "e***r | 05 Aug 2024",
            "Stars": 0,
            "Review Text": "Does not connect with the app"
        },
        {
            "Date": "a***n | 24 Jul 2024",
            "Stars": 0,
            "Review Text": "does not work rubish"
        },
        {
            "Date": "h***i | 01 Jul 2024",
            "Stars": 0,
            "Review Text": "I do not recommend buying is not programmed with the application"
        },
        {
            "Date": "W***n | 09 Aug 2024",
            "Stars": 0,
            "Review Text": "Does not work"
        },
        {
            "Date": "3***r | 06 Aug 2024",
            "Stars": 0,
            "Review Text": "Kinda booty dont even work LEL"
        },
        {
            "Date": "AliExpress Shopper | 08 Aug 2024",
            "Stars": 0,
            "Review Text": "No shipment"
        },
        {
            "Date": "z***d | 09 Aug 2024",
            "Stars": 0,
            "Review Text": "Difficulty to install"
        },
        {
            "Date": "t***r | 02 Aug 2024",
            "Stars": 0,
            "Review Text": "did not work"
        },
        {
            "Date": "j***r | 22 Jul 2024",
            "Stars": 0,
            "Review Text": "what can I say but nothing"
        },
        {
            "Date": "Y***i | 14 Jul 2024",
            "Stars": 0,
            "Review Text": "Not as the picture"
        },
        {
            "Date": "AliExpress Shopper | 12 Aug 2024",
            "Stars": 0,
            "Review Text": "Does not work"
        },
        {
            "Date": "b***h | 20 Jul 2024",
            "Stars": 0,
            "Review Text": "Do not want to link to app"
        },
        {
            "Date": "AliExpress Shopper | 27 Jun 2024",
            "Stars": 0,
            "Review Text": "Batteriladet does not take over"
        },
        {
            "Date": "c***e | 11 Aug 2024",
            "Stars": 0,
            "Review Text": "nul"
        },
        {
            "Date": "b***d | 15 Jul 2024",
            "Stars": 0,
            "Review Text": "not working"
        },
        {
            "Date": "AliExpress Shopper | 20 Jun 2024",
            "Stars": 0,
            "Review Text": "Not working"
        },
        {
            "Date": "F***o | 19 Aug 2024",
            "Stars": 0,
            "Review Text": "Damaged Battery"
        },
        {
            "Date": "z***r | 05 Aug 2024",
            "Stars": 0,
            "Review Text": "👍"
        },
        {
            "Date": "AliExpress Shopper | 20 Aug 2024",
            "Stars": 0,
            "Review Text": "Does not work, the packaging arrived in bad condition :("
        },
        {
            "Date": "AliExpress Shopper | 20 Aug 2024",
            "Stars": 0,
            "Review Text": "Shit sucks does not work me repentance of purchase do not buy."
        },
        {
            "Date": "J***a | 19 Aug 2024",
            "Stars": 0,
            "Review Text": "didn't work"
        },
        {
            "Date": "AliExpress Shopper | 20 Aug 2024",
            "Stars": 0,
            "Review Text": "Instead of the camera came some kind of, wi-fai smart button Tuya ZigBee, and thanks for that"
        },
        {
            "Date": "a***n | 20 Aug 2024",
            "Stars": 0,
            "Review Text": "I do not know can install, the app does not work. Very bad purchase."
        },
        {
            "Date": "AliExpress Shopper | 20 Aug 2024",
            "Stars": 0,
            "Review Text": "could not find device on my smart phone"
        },
        {
            "Date": "C***e | 15 Aug 2024",
            "Stars": 0,
            "Review Text": "."
        },
        {
            "Date": "N***u | 28 Jun 2024",
            "Stars": 0,
            "Review Text": "super ok"
        },
        {
            "Date": "R***e | 25 Jul 2024",
            "Stars": 0,
            "Review Text": "Very large"
        },
        {
            "Date": "T***i | 09 Aug 2024",
            "Stars": 0,
            "Review Text": "The size of the camera is not according to the advertisment, as it is much bigger than expected. The camera gets very hot when in use."
        },
        {
            "Date": "J***o | 18 Jul 2024",
            "Stars": 0,
            "Review Text": "Terrible resolution. I do not indicate."
        },
        {
            "Date": "T***s | 08 Aug 2024",
            "Stars": 0,
            "Review Text": ""
        },
        {
            "Date": "s***r | 17 Aug 2024",
            "Stars": 0,
            "Review Text": ""
        },
        {
            "Date": "J***a | 09 Aug 2024",
            "Stars": 0,
            "Review Text": ""
        },
        {
            "Date": "M***v | 09 Aug 2024",
            "Stars": 0,
            "Review Text": ""
        }
    ]
}