{
    "Category": "Amazon",
    "Product Name": "Wireless Mechanical Keyboard B87, Gasket Mounted RGB Gaming Keyboard 75%, QMK/VIA Bluetooth/2.4G/USB-C Volume Knob PBT Keycaps, Hot Swappable Linear Aster Switch, Vintage Red",
    "Product Image": "https://m.media-amazon.com/images/I/61cPD1nDdVL.__AC_SX300_SY300_QL70_ML2_.jpg",
    "Unique Key": "B0D1XKDWFM",
    "Clean URL": "https://amazon.com.au/Wireless-Mechanical-Keyboard-Bluetooth-Swappable/dp/B0D1XKDWFM",
    "Brand": "iLovBee",
    "Average Star": "4.4 out of 5",
    "Reviews": [
        {
            "Date": "Reviewed in Australia on 15 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "👍🏻👍🏻👍🏻highly recommended"
        },
        {
            "Date": "Reviewed in Australia on 25 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Awesome buy happu i got it before the price increases"
        },
        {
            "Date": "Reviewed in Australia on 20 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Excellent keyboard, keys feel good, sound is creamy, VIA programmable and good value for money. This is my second mechanical keyboard very happy with ilovBee B87."
        },
        {
            "Date": "Reviewed in the United States on 13 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I love this keyboard! It has replaced my other keyboards for many reasons. The key switches themselves are pre-lubed, so they feel fantastic. The PBT keycaps are sturdy and with the lubed switches give an audible but quiet “thock” sound that is incredibly pleasing to the ear. It feels like typing on butter, it’s a great experience. Alongside this outstanding functionality, the keyboard features a dial that is hot swappable for a pause key that is included in the box along with 3 extra key switches, a key puller, and a switch puller. The lighting effects are highly customizable but may not be as customizable as some software offerings.\n\nThe keyboard operates via Bluetooth (up to 3 devices) or with a dongle. The battery has performed well without the lighting on in my experience, though I wouldn’t expect more than a couple of days with lighting effects. The weight of the keyboard with the rubber feet means this isn’t going anywhere, which is surprising for a smaller keyboard. All of the hot keys are well thought out and intuitive to use, and the media functionality works great. On top of all of this, the keys are hot swappable to even further customize your experience with this board.\n\nThis is a super affordable entry mechanical keyboard option that I will recommend to everyone!"
        },
        {
            "Date": "Reviewed in the United States on 11 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I think this is one of the best mid-priced mechanical keyboards I've tried. Everything about the build, layout, and typing experience is impressive. This keyboard comes with all the bells and whistles at a fraction of the price that other keyboard companies charge. It has a solid and durable plastic construction, three connection modes, a magnetic 2.4 GHz dongle slot, a knob, good aesthetics, and an awesome typing experience.\n\nThe typing experience is stellar. The Aster switches sound amazing and super satisfying. The sound is incredibly loud, so it might bother others if you work around them. The sound is hard to describe—it's poppy and clacky. The actuation force lets you type quickly without many errors or double presses. The sound is consistent across the board, and the stabs are well-lubed and tuned. The keycaps are thick, and the letter prints are large and easy to see. The knob is very useful for controlling the volume, but I think it could be swapped out for another important key if you prefer. I'm sticking with the knob, but sometimes I clash with the scroll key beside it because they are very close together.\n\nOverall, this is one of the best mid-range mechanical keyboards on the market at this price point. It has lots of features, great switches, and quality construction. It's better than some Ajazz keyboards I've tried in this range and very similar in features and performance to the Aula F87. Choosing between them is just a matter of personal preference."
        },
        {
            "Date": "Reviewed in Spain on 9 August 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Tengo que seguir investigando, pero el teclado no se carga con el ordenador y\nademás tiene muy poca autonomía de carga .No te asegura horas de juego o de trabajo"
        },
        {
            "Date": "Reviewed in the United States on 9 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This is one of my favorite mechanical keyboards this year. I like older keyboards like the Model M mini M and this keyboard has a look that calls back to classic keyboards before the era of mechanical keyboards. The linear aster switch isn’t one I’ve experienced prior to this keyboard. I’m not usually drawn to linear switches and prefer tactile switches instead, but these switches feel good and aren’t so light I make typing errors left and right. There is a distinct bottom out feel when these keys are pressed. The sound is low pitched and consistent, it’s not annoying like blue switches."
        },
        {
            "Date": "Reviewed in Germany on 9 August 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Wie ich schon im Titel der Rezension angedeutet hab, es ist eine Super Tastatur. Einfach ein super weiches Schreibgefühl und Klanglich echt entspannend für viel Schreiber. Die Beleuchtung ist nicht schlecht, finde ich aber bei den Keycaps nicht so Sinnvoll. Sehen tut man's.\n\nSoftware habe ich auf der Hersteller Website nicht gefunden also Hotkey Einstellungen oder Custom RGB ist schwierig.\n\nDas was ich bemerkt habe ist das die Tastatur bei mir wenn ich den Rechner an mache nie wirklich beim ersten mal erkannt wird. Also Stecker raus und wieder einstecken. Sehr nervig. Des weiteren werden manche Tastenanschläge Doppelt gesendet."
        },
        {
            "Date": "Reviewed in the United States on 9 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Comes with linear switches and I really like the LED lighting. It's customizable using Via if you download the JSON from the product descriptions (which links to a Google Drive) and load it in the \"design\" tab. But once it's customized it looks and feels amazing. Even my friends who are super into keyboards says this is the one they will recommend from now on to beginners."
        },
        {
            "Date": "Reviewed in Germany on 8 August 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Super Tastatur aber es gibt keine Umlaute wie Ä, Ö, Ü oder ẞ!!!!! In Deutschland nicht brauchbar"
        },
        {
            "Date": "Reviewed in Spain on 1 August 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Teclado estilo retro o vintage de la marca “Iloobee”.\nEl diseño me ha gustado mucho, ese toque antiguo lo hace muy llamativo.\nLas teclas son de tipo mecánico, es cómodo escribir y escuchar ese sonido tan característico al teclear.\nCuenta también con iluminación que podemos regular en intensidad y variar en cuanto al patrón de iluminación.\nSe puede utilizar también para juegos en PC con un resultado muy bueno.\nEs compatible tanto con Windows como con Mac Os, la reseña la estoy escribiendo desde mi macbook pero también lo utilizo para jugar en PC.\nMe ha gustado que guarde la vinculación con los dos sistemas y se vincule automáticamente al bluetooth del ordenador elegido en ese sistema.\nTambién lo podemos conectar mediante cable y con receptor Usb.\nTiene teclas de atajo y acceso rápido además de una ruedecilla para controlar el volumen comodamente.\n\nAhora os comento un par de cosas que podrán ser mejorables, el teclado es QWERTY pero de la región americana por lo cual no tenemos tecla Ñ visible aunque si la reconoce al configurar el teclado como español.\nTambién cambian de lugar distintos símbolos, y caracteres pero que una vez que aprendes su nuevo lugar no interfieren en su utilización.\n\nTeclado de calidad, versátil, utilizable en los dos sistemas operativos, también para juegos y con características variadas."
        },
        {
            "Date": "Reviewed in France on 1 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Un clavier qui tient donc bien ses promesses. Une frappe assez agréable, un beau design et une bonne finition. Pas de plastic qui craque ou autre. Certaines touches configurable en macro. Les key caps sont bien sur changeable tout est fourni pour.\nLe seul petit point négatif c'est peut-être le soft de configuration car la doc n'est pas en français mais avec quelques recherches on finit par y arriver !\nJe recommande !"
        },
        {
            "Date": "Reviewed in the United States on 30 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The keyboard is very decent for its price. But I have a problem with connecting it to my MacBook Pro. The bluetooth does not appear in a list when I put it in pairing mode and 2.4 never connects. It just blinks. I tried putting 2.4 in the pairing mode as well but no luck. It just blink rapidly and stops. Can anyone help?\n\nupdate: Tried this morning and suddenly bluetooth connected. Have not tried 2.4 yet but happy that at least BT works now. changing the rating to 5 stars as the price/quality is very good."
        },
        {
            "Date": "Reviewed in France on 29 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "En tant que développeur et passionné de jeux vidéo, j’étais à la recherche d’un clavier mécanique sans fil qui puisse répondre à mes besoins spécifiques en matière de programmation et de gaming. Ce clavier, avec son design personnalisable et sa connectivité versatile semblait être le candidat idéal.\n\n📦 Le carton est tout à fait adapté au produit pour le recevoir dans de bonnes conditions.\n\nCe que j’apprécie :\n💚 La structure qui offre une frappe confortable et silencieuse sur un socle très stable\n💚 La possibilité de personnaliser le clavier avec le logiciel QMK/VIA pour une expérience sur mesure.\n💚 Les touches multimédias en alliage qui ajoutent une touche d’élégance et de durabilité.\n💚 La connectivité tri-mode (BT5.0/2.4G/USB-C) qui permet une utilisation flexible dans différents environnements.\n💚 Les touches de haute qualité qui résistent à l’usure et offrent une sensation agréable au toucher.\n\nCe que je regrette :\n⚠️ L’absence d’une disposition en AZERTY pour les utilisateurs francophones et l’impossibilité de passer réellement en ZERTY (même en déplaçant les lettres, il reste le problème des accents).\n⚠️ Le prix reste élevé comparé à d’autres solutions Gamers avec un peu plus de fonctionnalités.\n\nEn résumé, ce clavier est une excellente option pour ceux qui cherchent un clavier mécanique sans fil performant, personnalisable et compact. Bien qu’il puisse représenter un investissement conséquent, ses fonctionnalités avancées et sa qualité de construction justifient le prix pour les utilisateurs exigeants acceptant de travailler en QWERTY."
        },
        {
            "Date": "Reviewed in the United States on 27 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I've been using this keyboard for a little over a week now and I've been fairly impressed with its performance so far. I do have a couple of very small complaints but for the most part, I think it's a really strong value option in highly contested market.\n\nFirst things first, build quality is fantastic. It's made from mostly plastic, but it still manages to feel extremely solid in the hands, with no flex whatsoever. There does seem to be bit of metal, but I feel like it's mostly there to add weight, not to provide support to the chassis. In terms of appearance, the design is fairly simple, but it has some really nice accents along the outer edges. It also has a cool, retro color theme that reminds me of classic PC design. As for the performance, it has really great switches, even better stabilizers, and pretty good dampening. The switches are medium weight with a bit of a clacky sound profile, so they might be a bit inappropriate for an office environment. They're not super loud, but I feel it could be enough to disrupt an overly-quiet setting. The stabilizers are perfect and absolutely dunk of a lot of high-end brand boards out there (I'm looking at you, Glorious and Varmillo). The keycaps feel nice and are decently thick as well. They also feel very nice to type on.\n\nSo I do have a couple complaints. Firstly, the board has RGB but not shine-through keycaps. I will lodge this complaint every time it happens. I realize it sorta messes with the theme of the board a bit, but I'm willing to sacrifice that aspect if it means having illuminated keys. So yeah, I will be replacing these keycaps with either front-facing, or possibly pudding caps. Also, the RGB on my board is a bit wonky. I usually set all my keyboards to have rolling rainbow RGB, which is my favorite setting. A few of the colors, specifically the red, orange, and yellow are very strange on that particular setting, however. The greens, blues, and purples will scroll in a nice, wide, even spread. The red, yellow, and orange all scroll in a single column, which looks a bit jank. I'll probably download the app to see if there's a way to customize the RGB to my liking, but most boards usually don't have that issue.\n\nTLDR - Has a couple of small issues that don't really affect the performance of the board. Everything else is either solid or great. The switches and stabilizers in particular are top notch. Great price too, especially for a wireless board. 5/5 stars"
        },
        {
            "Date": "Reviewed in the United States on 27 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Wow wow wow! I've gone through several keyboards in my journey of just modding and finding the right sound, and here comes along this thing, and I feel like I've wasted my time when I could have just bought this thing. The combination of the super heavy case and the switches and the caps and all the foams make this a REALLY solid sounding keyboard. Even though it's linear, it sounds way louder than any clicky keyboard. There isn't any resonating or echo at all. IT's like the difference between having solid wood speakers vs plastic speakers. It's a great value. I don't want to do anything to it, I don't even wany to take it apart because I don't want to change the sound at all.\n\nThere are little features that put this over the top, like the dongle slot to hold it, it has side RGB lights, a real switch instead of weird little keyboard shortcuts for Bluetooth and 2.4G. You can even change out the volume knob for another switch (3 extra are included). Having QMK/VIA support is the tops too. It's nice having a trusted open source program instead of some sketchy one.\n\nOverall this is a GREAT value for what you get. Definitely something to get a person who doesn't want to dive into the expensive world of mechanical keyboards."
        },
        {
            "Date": "Reviewed in Italy on 26 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "[Confezione📦]: La scatola contiene la tastiera, un cavo con uscita USB-C, un ricevitore wireless, un tool multiuso pinzetta/estrattore di tasti ,un tasto “Pause” aggiuntivo, 3 switch di ricambio e il manuale delle istruzioni (assente la lingua italiana).\n[Qualità costruttiva e Caratteristiche⚙️⌨️]: Anche se non amo particolarmente le tastiere 75%, esteticamente questa è splendida. Ogni elemento e dettaglio è pulito e ben curato. Ad una buona immagine si aggiungono materiali di ottima qualità, un feedback e un suono dei tasti eccezionali e una reattività eccellente sia in scrittura che in gioco. Sul retro sono presenti piedini doppi per regolare la tastiera su 3 altezze diverse. Sul bordo superiore troviamo l’alloggiamento per il ricevitore wireless (un dettaglio molto apprezzato), l’interrutore per passare tra le varie modalità di connessione e l’ingresso USB-C.\n[Connettività🛜]: La tastiera lavora su 3 modalità: cablata, wireless e bluetooth. Con quella bluetooth, in particolare, è possibile connettersi rapidamente a 3 dispositivi diversi alternandoli con i tasti funzione FN+Q/W/E. Per tutte le modalità, l’associazione è stata immediata e priva di problematiche.\n[Applicazione e tasti funzione🔠]: Moltissime funzionalità vengono svolte da una combinazione di tasti funzione e illuminazione RGB. Tramite i tasti funzione è possibile cambiare sistema (Windows o Mac), gestire i multimedia, controllare lo stato di carica direttamente sulla tastiera e gestire tutto il reparto RGB (illuminazione, colori, effetti, schema). Il listone di combinazioni che ne consegue può essere in parte sostituito dall’applicazione open source “usevia.app”, accessibile da browser e che permette di modificare i tasti, l’intensità. l’effetto e il colore dell’illuminazione frontale e settare le macro. Per farlo bisognerà prima caricare il profilo della tastiera, scaricabile tramite il collegamento presente nella pagina del prodotto.\n[Qualità/Prezzo📊]: Seppur con qualche sbavatura la tastiera è sicuramente di ottima qualità. Se non vi interessa il layout US perché avete memorizzato la posizione dei tasti italiani e potete passare sopra un’applicazione non dedicata e poco curata, allora questa tastiera è totalmente consigliata. L’assistenza clienti, inoltre, è stata gentile e puntuale nel risolvere alcuni miei dubbi."
        },
        {
            "Date": "Reviewed in Germany on 25 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Mit dem Druckpunkt und dem Klang des Tasteneinschlags hat mich iLovBee auf Anhieb gewonnen. Endlich eine Tastatur, die sich genauso verhält, wie ich es mag – auch wenn sie aussieht, als ob ich sie von einem Technikmuseum ausgeliehen hätte.\n\nDirekt nach dem Auspacktn musste ich hier und da die eine oder andere Taste fest(er) hineinstecken. Das ist nicht weiter schlimm und war nur einmal nötig. Die Tasten abnehmen und hineinstecken ist übrigens ein Leichtes. Klasse gemacht.\n\nDas größte Highlight: Ich kann im Blindmodus, also ohne Hinzuschauen, sehr entspannt tippen, und werde dabei nicht müde.\n\nDa ich mich zwischendurch auch als Entwickler betätige, kommt mir die US-Tastaturbelegung sehr gut gelegen. (Eigentlich “Beschriftung”, da man die Tastenbelegung per Software ändern kann).\n\nOb stundenlanges Tippen oder Spielen, beides macht mit dieser Tastatur Spaß. Mir würde dennoch eine Funktion zum Umschalten zwischen Tippen (stärkerer Andruck) und Gaming (leichterer Tastendruck) vorschweben.\n\nDer Retro-Look dieser Tastatur erinnert mich an einen IBM XT der 1980er Jahre – und doch hat sie moderne Anschlüsse, RGB-Beleuchtung und alles Drum und Dran an nützlichen Features. Die hyper-moderne Funktionalität kontrastiert mit dem gewollt “angestaubten” Look des Technik-Museums. Besonders als Mac-Nutzer muss ich da immer schmunzeln, wenn einer meiner Freunde zu Besuch ist und sieht, wie ich mit dieser Tastatur arbeite. Da packt einen echt die Nostalgia!\n\nEin paar kleine Ungereimtheiten sind mir dennoch aufgefallen. Bei jedem (Neu)start von meinem PC schaltet die Tastatur auf das Mac-Layout um, warum auch immer. Dasselbe passiert, wenn ich einfach nur die Tastatur aus- und wieder einschalte. Seit ich rausgekriegt habe, wie ich das Layout per Tastenkombination zwischen macOS und Windows umschalten kann, komme ich damit problemlos klar.\n\nFAZIT\n\nTrotz der kleinen Ungereimtheiten finde ich die Tastatur eine großartige Wahl. Das Tastengefühl ist klasse, die Bauweise ist sehr stabil und (auch) im Langzeitbetrieb läuft die Tastatur wie eine Eins. Sie verhält sich wie ein High-End-Produkt, obwohl sie ganz klar etwas günstiger ist.\n\nInsgesamt eine klare Empfehlung."
        },
        {
            "Date": "Reviewed in the United States on 25 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The iLovBee B87 Wireless Mechanical Keyboard offers a superior typing and gaming experience with its gasket-mounted design and customizable RGB lighting. This 75% keyboard supports QMK/VIA and features Bluetooth, 2.4G, and USB-C connectivity for versatile use. The volume knob adds convenience, while the hot-swappable Linear Aster switches ensure smooth keypresses. Its PBT keycaps are durable and provide a satisfying tactile feel. The retro red design adds a touch of style to your setup, making this keyboard both functional and aesthetically pleasing."
        },
        {
            "Date": "Reviewed in the United States on 24 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "WOW, I wasn't expecting much at this price point. This has SO many qualities for the tag. It is gasket, has incredible ASTER linear switches, and is wireless. A keyboard like this is hard to find on a budget. It is hot-swappable and has the retro gaming console colors.\n\nYou can customize it further if you prefer different keycaps or switches. There are endless options for customization. I only wish they had a pink color to match my desk. Overall, it has been a pleasant surprise. I highly recommend."
        },
        {
            "Date": "Reviewed in the United States on 24 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I bought this keyboard to replace my old Logitech keyboard that stopped working. And, they quit making them! All their current keyboards just didn't fit the bill.\nI didn't think I'd like a mechanical keyboard. Sounds like the click clack would be annoying!\nNope, apparently not when you're the one doing it!\n\nThis thing seems way better than any of the alternatives I've been looking at. It's HEAVY!\nThe light options are pretty cool too. I selected one that sort of sends pulses out on key press like ripples on a pond. Really cool!\n\nLike when you've driven a car for years and get a new one, I still need to get used to the hight and feel, but I'm looking forward to it.\nI do miss my number pad, though"
        },
        {
            "Date": "Reviewed in Germany on 23 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Wenn Sie nach einer preisgünstigen Tastatur mit einem guten Klang suchen, der dem einer Tastatur mit braunen Schaltern ähnelt, haben Sie Glück. Der Klang ist gedämpfter als bei einer linearen Tastatur mit roten Schaltern, bietet aber beim Tippen einen so cremigen Klang. Für alle mit kleinem Budget, die eine leisere, aber zufriedenstellende, klickende Tastatur suchen, ist dies die richtige. Die Tasten sind vorgeschmiert, sodass sie einen großartigen Klang haben und keine Probleme mit dem Feststecken zu haben scheinen. Die Tastatur ist für alle, die die Schalter austauschen möchten, im laufenden Betrieb austauschbar. Wenn Sie also eher an der Optik als an der Haptik dieser Tastatur interessiert sind, ist ein Wechsel ganz einfach. Sehr empfehlenswert für alle, die nach einer guten preisgünstigen Tastatur suchen oder zum ersten Mal eine Tastatur anpassen. Ich werde nach diesen ähnlichen Schaltern suchen, um sie zu meinen anderen linearen roten Tastaturen hinzuzufügen!"
        },
        {
            "Date": "Reviewed in the United States on 22 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "The overall build quality of this keyboard is excellent. The pre-lubed switches are not bad and provides a great typing experience and sound profile. The sound is slightly marbly and creaminess. The removeable knob is awesome and I wish more manufacturers would adopt a similar style. The special keys sounds OK while the spacebar has a slight ping to it. Nothing some lube can't fix. All in all, you will probably be hard pressed to find another keyboard the performs this well at this price point. The only better options would be stepping up to aluminum chassis keyboards."
        },
        {
            "Date": "Reviewed in Germany on 22 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Hatte die Tastatur ein wenig mehr als 2 Wochen im Dauertest und mochte sie größtenteils. Werde alles auflisten was ich so bemerkt habe.\n\nSie hat wie beworben kaum flex, man kann sie also nicht einfach wild rum biegen, ihre Strukturelle Bauweise ist also gut gelungen.\nDer Akku hat bei mir ca. 15 Tage lang gehalten ohne das RGB an war (man muss kurz RGB anschalten um mit einer Tastenkombination zu checken wie viel Saft noch im Akku ist, was ich jeden Tag einmal gemacht habe).\nDas Aufwachverhalten der Tastatur aus dem Sleep-Modus ist mal was anderes. Normalerweise braucht eine Tastatur ein paar Sekunden oder sie reagiert sofort. Hier reagiert sie scheinbar nicht sofort aber sie registriert die Inputs wodurch diese dann wiedergegeben werden, wenn auch verzögert. Hatte mich am Anfang ein wenig verwirrt 😅\n\nIch mag die verfügbaren RGB Effekte, es gibt etwas mehr als die Standardpalette. Allerdings ist sie nicht optimal für Lichtspektakel, es wird bei solcher Einfassung der Tasten und der Tatsache das es undurchsichtige Tastenkappen schwer mit RGB Feuerwerk. Man kann bei Bedarf die Tastenkappen als auch Tasten frei austauschen und Liebhaber habe wahrscheinlich eh ihr favorisiertes Tastenkappenset parat.\nAn beiden Seiten befindet sich auch noch RGB die man individuell ansteuern kann, ein kleines Stylisches Detail. Meiner Meinung nach passt das sehr gut zum Design dieser Tastatur auch wenn es für manche vielleicht abgespeckt wirken kann.\n\nAlle Tasten lassen sich sehr einfach aus dem Board lösen und wieder einfügen, was sich erstmal gut anhört, kann man nicht viel kaputt machen. Dadurch lockern sich beim Transport, insbesondere beim Versand die Tasten und man muss sie wieder rein drücken. War hier kein Problem aber das hatte ich bei einem ähnlichen Modell. Immerhin sind die ausklappbaren Standfüße standhafter 😅\n\nBei der Verpackung wurde gespart, sieht nicht wirklich Premium aus, ist mir aber total egal. Besser ist wenn das Budget in die Tastatur fließt anstatt in eine Verpackung die mich mit schönem Eindruck blenden soll. Was hier meiner Ansicht nach geschehen ist.\nEin Beispiel dafür sind unter anderem die Stabilisatoren, habe dort kein klappern zu vermelden. Sind glaube ich die Besten Standard Stabilisatoren die ich in meiner ganzen Sammlung habe, muss ich also ein großes Kompliment aussprechen.\n\nMein Tipperlebnis war also ausgezeichnet. Fürs gamen sind sie mir auf Dauer aber etwas zu schwer zu betätigen. Für jemand der stattdessen viel tippen will für den eignen sie sich prima. Der Sound der Tastatur ist wohl zu Laut fürs Büro mit anderen, alleine habe ich davon allerdings keine Kopfschmerzen bekommen. Man hat ein wohltuendes klackern im Ohr, von der Frequenz eher tiefer angesiedelt. Im 2. Produktvideo von einem Reviewer bekommt man einen recht guten Eindruck auch wenn es dort mehr hallt als in Realität.\n\nHabe auch noch ein paar Dinge die mir negativ aufgefallen sind. Aus irgend einem Grund setzt sich die Tastatur beim an und ausschalten oder beim hoch und runterfahren des Computers auf Mac anstatt Windows Layout. Kann man mit einem 2 schnellen Tastendrücken beheben, ist aber seltsam. Sie will manchmal auch nicht erkannt werden, aus und wieder einschalten fixt das Problem.\n\nTrotz der Strukturell guten Bauweise des Rahmens flext das innere doch sehr. Was man vor allem beim Volume Drehknopf bemerkt. Die PCB auf dem alle Tasten ruhen biegt sich extrem nach innen wenn man Kraft ausübt, wie z. B. beim stumm schalten (auf den Drehknopf drücken). So einen Flex habe ich noch nie gesehen, zeigt das es innen gut mit Schaum gepolstert ist um den Sound zu verbessern, macht aber auch sorgen das man auf Dauer was beschädigt.\nZudem ist der Volume-Knopf zu glatt und zu nahe an anderen Tasten als das man ihn komfortabel verwenden könnte.\n\nUm die Tastatur einzustellen braucht man Software, die steht aber als online open Source App oder so zur Verfügung. Habe mich damit nicht lange befasst da meiner Meinung nach die Basiseinstellungen gut sind. Ist für mich aber ein wenig seltsam als Konzept. Man hat alle Settings die man braucht, wie verschiedene Effekte, dimmen in Stufen etc. von daher kein muss sich damit rum zu ärgern.\n\nInsgesamt finde ich die Tastatur bombensolide, man hat ein Chassis auf dem man aufbauen kann. Egal ob man andere Tasten oder Tastenkappen verwenden will um alles noch persönlicher nach eigenen Vorlieben zu gestalten. Wenn ich Zeit und Lust habe werde ich mich der Sache auf jeden Fall annehmen. Wer eine grundsolide Tastatur will sollte hier zugreifen. Von meiner ganzen privat gekauften und getesteten Sammlung ist diese hier easy top 2 als Gesamtpaket obwohl sie kein teures Markenflaggschiffmodell ist."
        },
        {
            "Date": "Reviewed in the United States on 21 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "If you're looking for a budget keyboard that has a good sound that is similar to a brown-switch keyboard - you're in luck. The sound is more subdued than a linear red switch keyboard but, offers such a creamy sound when you type. For those on a budget looking for a more quiet, but satisfying, clicky clack (or THOCK) keyboard - this is the one. The keys are pre-lubed so they have a great sound and don't seem to have any issues with sticking. The keyboard is hot swappable for those looking to change out the switches so, if you're interested in the look rather than the feel of this keyboard than it makes for an easy switch. Highly recommend to those looking for a good budget keyboard or are a first time keyboard customizer. I will be looking for these similar switches to add to my other linear red keyboards!"
        },
        {
            "Date": "Reviewed in Germany on 21 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Bin mehr als zufrieden kann ich nur empfehlen. Hört sich richtig gut an fühlt sich auch gut an."
        },
        {
            "Date": "Reviewed in the United States on 21 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Short, sweet and super accurate. Response time is fantastic on this. Clickiness is great, solid thump with no movement fantastic feel. Feels much more expensive than it is. Love how the keys are close together too, makes moving, pivoting and shooting in game so easy and smooth!\n\nThe lights are pretty cool, and the keyboard is really heavy so it doesn't shift at all. Really think whoever made this put a lot of thought into its use as a gaming keyboard. Looks really cool in general, retro colors. Kind of like typewriters from the 80s.\n\nAll in all, love this new keyboard!"
        },
        {
            "Date": "Reviewed in the United States on 20 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "It looks just like my Japanese SNES colors! I think that's the point, but I wanted to point out how excited I was to find this. They also make a key cap set that is vaguely Nintendo themed that is also the same color way. Looks amazing and works even more amazing.\n\nNot too loud when typing, great smaller size for desk space and super versatile knob/switch spot. Love it.\n\nCouldn't be happier. Highly recommend."
        },
        {
            "Date": "Reviewed in the United States on 19 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This mechanical keyboard works great, easy plug and play set up. I like the loud clicks the keys make. It types smoothly and the colors are great. It's very sturdy and the keys do not feel like they are going to fall off like other mechanical keyboards I have used. It's a great keyboard at a great price."
        },
        {
            "Date": "Reviewed in the United States on 18 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Subtracting a star because when I used this with the USB-C cable, it would not wake up the computer automatically after initial booting. I had to disconnect and reconnect the USB cable for the keyboard to register properly. I used this for a week as my main keyboard with no other complaints. Build quality is good, it has a nice weight to it. The keys sound great and you get a satisfying click-y noise when using it. It's not quite a crisp click (more subdued) sounding as my Razer Black widow keyboard, but I like the more subdued sound these make. The keyboard design is great, it has a nice retro feel to it. Reminds me of the old-school commodore keyboards that were floating around in the 80's. Definitely has a nice color scheme and the shortened keyboard is a good design."
        },
        {
            "Date": "Reviewed in the United States on 18 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Works well. This keyboard was a bit difficult for my son (whom this was for) and I to pair up. We had some issues with the instructions. My husband, a bit more technical, easily paired it with the computer and it works perfectly. It is now used as an all around keyboard but also works, I understand, for gaming.\nThe only 'con', and this isn't really a 'con' - the red background is truly retro looking. But the keyboard has lights in blue and pink which don't really match the overall look. Still, it appears to be a solid working keyboard."
        },
        {
            "Date": "Reviewed in the United States on 18 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This mechanical keyboard is perfect for gaming and offers a vintage aesthetic. The build quality is good, and the keyboard feels solid and sturdy. The RGB lights are customizable and look great, and the volume knob is a convenient feature. The keyboard also includes several sound-absorbing foam layers to reduce typing noise and improve the typing experience. My husband loves it."
        },
        {
            "Date": "Reviewed in France on 16 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Clavier mécanique sans fil, QMK/Via Gasket Clavier gamer 75% TKL BT5.0/2.4G USB-C\nBande lumineuse latérale avec couleur réglable.\nPoids du produit 1.35kg.\nIl est ergonomique et programmable\n\nCe que j'aime le plus :\n- qualité des switchs, le touché est exceptionnel, ce qui permet d'avoir un clavier silencieux\n- ce démontes facilement pour changer les switchs\n- réglage lumineux\n- beauté de l'ensemble\n- touche molette superbe mais un peu dure à tourner\n- couleurs d'un rétro fantastique\n- bundle assez complet\n- bt ou 2.4gh ou filaire : parfait !!\n- clavier lourds mais plein de détail, franchement il est très beau\n\nCe que j'aime le moins:\n- manque un pave numérique sur le cote du clavier\n- qwerty mais c'est pas trop grave\n- un peu compliqué à régler les leds, je l'ai mis en mode naturel usine, et ça le fait.\n\nConclusion:\n\nUn clavier numérique vintage, plutôt solide et de bonne qualité.\nC'est un vrai et très beau clavier, travaillé et irréprochable sur le plan qualitatif, bravo !!\nBon rapport qualité prix, je recommande ce produit, il convient parfait au amoureux du vintage."
        },
        {
            "Date": "Reviewed in the United States on 15 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Wow this thing is surprisingly well-built; solid, heavy, and great to type on. The keys smoothly actuate and I am very accurate with this keyboard. The keyboard stays in place and there's no movement when typing. I find that this is the perfect size for me.\n\nI actually ordered this not knowing it had RGB (none of the photos displayed it), so when I turned it on and it lit up that was a pleasant surprise. You can cycle between static and animated RGB themes. I do wish I had more control over the exact colors used when using static colors; for example, the white color has a slightly blue tint to it. Definitely a nit-pick. The keys also change color underneath them when typing which is fun. The LEDs on the sides of the keyboard are also customizable which is a nice touch.\n\nThe volume knob feels good, but is very close to other keys; it would make more sense to move it elsewhere, but there's not really room.\n\nI appreciate that there is a way to switch between Windows and Mac key bindings using a shortcut.\n\nThere's an embossed phrase on the back \"LIVE FAST DRIVE FASTER\" which, for me, resonates because I enjoy racing cars. But I'm not sure why it's on the back of a keyboard. Maybe they all come with something different? A little odd.\n\nOverall, very pleased with this; it's probably my favorite budget mechanical keyboard out of the other few that I have, so I'll definitely be using it."
        },
        {
            "Date": "Reviewed in Germany on 14 July 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Die Tastatur hat einen Tag lang funktioniert. Am nächsten Tag gab sie kein Lebenszeichen mehr von sich. Nach langen Aufladeversuchen funktionierte sie immer noch nicht. Ging also zurück."
        },
        {
            "Date": "Reviewed in the United States on 14 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "The good. This is a great overall value for what you get. It feels sturdy, has lots of options for lighting and custom programming, good keycap with a nice retro color scheme and multiple connectivity options including USB-C, Bluetooth or dongle.\n\nThe bad. I could not get Bluetooth to work on two different computers. The keyboard was put into pairing mode and it would fast flash indicating it was in pairing mode, but it would never show up as an option to pair with. So not sure what is going on there, but USB-C and dongle both worked OK.\n\nThis is definitely NOT a keyboard you want to use around others within earshot. For example, don’t take this to the office as others around you will not like you. It is LOUD. Even though these are linear switches the “CLACK” noise is very, very loud. I think these would benefit greatly from key dampeners to help reduce this, but if in an area where noise doesn’t matter, I will say this keyboard is really nice to type on and is very satisfying."
        },
        {
            "Date": "Reviewed in the United States on 13 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I have been looking for a mechanical keyboard to upgrade what I have in the office and the iLovBee gaming keyboard so far fits that bill perfectly. I have used 75% keyboards in the past and am familiar with them so the transition to this was so easy. I love that its wireless with a dongle and not just bluetooth because I've had so many issues with bluetooth only devices in the past. So far the battery life has been good for me, and typing experience great. The keys aren't too loud but do have a satisfying sound to them and the rgb lights are nice to play with from time to time. Lastly I love the knob to control the volume. Things like that make it so easy and are greatly appreciated at such a reasonably priced keyboard like this one."
        },
        {
            "Date": "Reviewed in the United States on 12 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "In short, this keyboard has almost any feature you could want in a gaming keyboard, and at only $59.99 at the time of this review!\n\nI included a short video so you can hear and see how the keys respond.\n\nHere's a rundown of some of the good stuff: Key puller included so you can swap keys and switches. Switches are lubricated for an excellent feel and response often reserved for higher-end keyboards. Very minimal flex. Bright backlight. Double-shot keycaps so the image will never wear off since the letter and the key are two different pieces of plastic.\n\nNote that the backlight won't illuminate the letters on these keys since they're double-shot so the backlight doesn't shine through but surrounds the keys.\n\nAll in all, I highly recommend this keyboard!"
        },
        {
            "Date": "Reviewed in the United States on 12 July 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Picked this keyboard up because it looked interesting, and I have a thing for mechanical keyboards. I'm no expert by any means, I just like trying out the different switch types.\n\nSo far, I'm absolutely loving this keyboard. It's more of a grey and beige type color, so it would go PERFECTLY with some of my retro vintage PC builds. So that's a huge plus. It's definitely more of a \"vintage\" color scheme, and that's one of the reasons I wanted this board. It's also very heavy, the built in battery is obviously pretty robust on this keyboard. It's very sturdily constructed, seems to be of high quality plastic and metals.\n\nNow, onto the actual meat of it, the switches. This keyboard features \"Linear Aster Switches\", and yes these are very linear and ZERO tactile feedback. So keep that in mind. Honestly, this keyboard FEELS like you're typing on a REALLY nice and expensive rubber dome or something. It's very quiet to type on, even bottoming it out. The key caps feel sturdy and premium.\n\nFinally, the RGB and physical size of it. The RGB functions are slightly annoying to change, as they always are on keyboards using the hotkey shortcuts. However, I do appreciate that I can customize the coloring. You can change through a variety of preset \"motion\" type colors, or solid colors. You can also do the same (and seperately) for the side lighting. Honestly, I cannot complain about the lighting options on this board. They're perfectly fine. The physical size however, that might be something that SOME people might have a problem with. If you're reliant on the 10key pad function of a keyboard, then you will not want to buy this board. Obviously, there's no 10key pad. That's about the only thing this board is actually \"missing\" (and I already have a mech \"linear\" wireless 10key pad if I need to use one).\n\nOverall, this is a fantastic budget mech keyboard if you're into \"quiet\", linear, and more of a rubber dome type experience. The keyboard is fantastic, and honestly a welcome change from my other boards I've been using. Seriously, its a REALLY nice keyboard. If you're in the market, pick one up and give it a try!\n\nEDIT:\nAfter one month of ownership, my keyboard no longer turns on. I have to edit my review from a 5 star to a 1 star. I've never, NEVER had a keyboard only last a month and then just spontaneously die. I absolutely LOVED this keyboard, and now its completely dead. I did absolutely nothing to it, it just stopped working entirely. Nothing was spilt on it. Sigh."
        },
        {
            "Date": "Reviewed in Germany on 10 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Man möchte einfach nicht aufhören zum Schreiben, auch wenn mein Mann von dem Geräusch einfach genervt ist.\n\nDie Verbindung ging ruckzuck, aber nicht ohne ein Auge in die Bedienungsanleitung zu werfen, da ich sie mit Bluetooth verbinden wollte. Einmal verbunden, ist die Verbindung stabil und man muss sich, um nichts mehr kümmern.\nDie Tasten lassen sich butterweich drücken. Die Füsschen für die Erhöhung haben zwei Höhen: Sowas habe ich echt noch nicht gesehen, finde aber echt flexibel. Das Design und die Farbe der Tastatur sind angenehm: Eine Art Cappuccino-Farbe mit ein rotweinlichen Buchstaben bzw. einige Tasten. Das macht die Tastartur sehr edel und hochwertig wirken. Die Beleuchtung der Tastatur ist dezent und einstellbar mit der Bedienungsanleitung.\nEine volle Ladung der Tastatur hält lange und geht mit einem USB-C-Kabel: Das finde ich sehr praktisch und umweltfreundlich, dass man auf Batterien verzichtet, wo man es kann. Alle Tasten funktionieren einwandfrei und die Lautstärkeregler ist auch eine sehr praktische Sache. Die Gummifüßchen auf der Rückseite ist ein nettes Plus und die Tastatur rutscht einfach vom Platz nicht.\n\nEin einziges Manko ist, dass die Tastatur ein US-Layout hat. Man lernt damit umzugehen, trotzdem nervt es manchmal. Und keine „intuitive“ Verbindung bzw. Bedienung ohne Bedienunganleitung. D.h. wenn man Lichtfarbe wechseln möchte oder Bluetooth aktivieren möchte, muss man die Tastenkombination kennen bzw. aus der Bedienungsanleitung entnehmen.\n\nDer Preis von 80 Euro ist angemessen und entspricht auf jeden Fall der Qualität. Empfehlung für alle die Vielschreiber sind und Komfort mögen.\n\nKeine Empfehlung für alle die Tastaturgeräusche hassen bzw. vermeiden wollen, da sind Sie aber bei einer mechnanischen Tastatur komplett falsche Adresse."
        },
        {
            "Date": "Reviewed in the United States on 7 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This is my 6th or 7th budget keyboard and this one is my new favorite, though I'm probably going to switch out the keys and switches with tactiles and SA profile, but those are both personal preference.\n\nThe keyboard is VERY heavy; it stays in place. It's a tad thicker than it should be, but it's not too bad. Only one level on the the legs. Plastic material has little to no flex. Has a magnetic slot for the USB dongle which is a huge plus and frankly should be standard on everything with a USB dongle. There's sort of a dumb saying embossed on the top/back, but you don't see that when sitting at your desk so itt doesn't matter.\n\nThe keycaps are cherry mx and have essentially a flat profile. This is my least favorite part - I strongly prefer the SA profile. However, they are nice quality and some people might love them. The colors are nice too, and the alternative functions are printed on the side, which is neat.\n\nRGB is wonderful on this keyboard, bright and south facing. Have not customized yet. Really happy with it though. There's some sort of silly RGB on the sides, the light bleeds through on the keys on the sides. I'll probably turn it off if I can.\n\nThe switches are some linear thing. Very little travel distance to engage - I bet gamers will love this. I don't game with my keyboard, so I prefer a little more travel and a tactile switch. However, they are clearly a quality switch, better than any reds I've used.\n\nThe unique feature is the removable knob. In the default position it's unfortunately a good idea with bad implementation. The knob is right next to a key and is the same height- in other words you can't easily grab the knob and instead have to sort of push on if from the sides. I don't think the knob can be moved to another space; too bad since there are a few places it would work much better than where it currently is (there's a singlular CAL button which I'll never use...).\n\nThe sound of this keyboard is absolutely top notch. Very nice thump sound, solid not hollow. Keys are perfectly stabilized, no movement at all. I enjoy typing and, frankly, just tapping on the keys.\n\nThis is a budget keyboard that feels very high end. I sort of wish it had a number pad and I really wish the knob had been placed better. Personal preferences on keycaps and switches aside, this is a fantastic keyboard for the price!"
        },
        {
            "Date": "Reviewed in the United States on 6 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The landscape for mechanical keyboards is starting to become rather crowded with expensive keyboard with very little offerings. By comparison, while this is not low budget, this keyboard comes a lot This keyboard in my opinion needs to stand out more. I own quite a few custom keyboards and iLovBee's keyboard is perfect stock, right of the box, no need to mod or customize.\n\nThere is plenty of foam and PET on multiple layers rendering the need to do any tape mod unnecessary. Plate stabs are well lubed on the wires and the sides, no rattling. I checked the wires and they are perfectly flat without any need to tune. Hotswap sockets are made by Jerzi and easy to swap switches out.\n\nVolume knob is a little on the small side measuring only 7.61mm. You would need a potentiometer extension if you want to use a taller knob. It's quite easy to accidentally take out the volume knob and the pins can be very fragile. Not sure who really needs the pause/break button, but the option is there should you want to change out the knob for a switch. Extra switches and a keycap is included if you so choose.\n\nDisassembly is easy requiring only the removal of 5 screws and care to not damage the ribbon cable. The leafspring and gasket gives the keyboard a light bounce when you type.\n\nBalance of the keyboard is weighted more towards the back, and left where the battery is situated. Battery is 3150 mAh and is fairly sizeable.\n\nKeycaps are relatively thick, but vary in thickness. A keycap can have one wall as this as 1.5mm and as thick as 1.75mm on the same keycap. The only 'needed' customization is maybe changing to a different switch if you dislike the included linear switches. Otherwise, nothing else really needs to change."
        },
        {
            "Date": "Reviewed in Germany on 6 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Was soll ich sagen, die Tastatur spielt in der obersten Liga mit. Bester Sound, bestes Tippgefühl. Konnektivität via Dongel und Kabel. Die Tastatur leuchtet in vielen Farben.\n\nDer Sound ist mit so das wichtigste an so einem Keyboard. Und hier klingt die Tastatur einfach wie die teuersten epischen Tastaturen. Das Gefühl der Switches ist linear und es wird zum glück nicht viel Anpressdruck benötigt. Es sind alle wichtigen Tasten enthalten! Allerdings ist das Layout US. Und die Tastatur ist nicht leicht, tendiert sogar eher zu schwer."
        },
        {
            "Date": "Reviewed in France on 6 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Ce clavier mécanique m'a vraiment impressionné par son design rétro avec des touches gris et beige. Les sensations de frappe sont excellentes, les touches mécaniques offrent un retour agréable et un bruit satisfaisant, parfait pour les amateurs d'ASMR. Il propose une flexibilité maximale avec ses connexions sans fil via Bluetooth, 2.4Ghz, et USB-C. Bien que le clavier soit en disposition QWERTY, ce qui peut être un inconvénient pour certains, il reste un produit de qualité avec une bonne finition."
        },
        {
            "Date": "Reviewed in France on 6 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Disposition en QWERTY. C'est visible sur les images, mais pas explicitement mentionné dans l'annonce au moment de ce commentaire, donc à garder à l'esprit si vous êtes attachés à l'AZERTY. Des outils sont fournis pour retirer les touches, donc vous pourrez au pire changer la disposition des touches si vous ne voulez pas écrire en QWERTY, les touches font toutes la même taille, donc c'est une possibilité, mais il faudra vous souvenir des touches pour les accents. Au pire, cela peut être une bonne occasion de vous essayer au QWERTY.\n\nLa batterie intégrée au clavier le rend lourd, forcément. Ce ne sera clairement pas un clavier qui se fera oublier sur vos genoux. Mais la frappe est agréable, donc peut le destiner plus facilement à un bureau. Si vous voulez quand même éviter de l'utiliser via son dongle USB, qui est astucieusement placé à l'arrière, dans un logement aimanté pour ne pas qu'il s'échappe, vous pouvez l'utiliser en bluetooth, et donc techniquement avec n'importe quel appareil compatible, que ça soit tablette, smartphone, etc... Mais comme je l'ai dit, le poids le rend pas forcément adapté à cet usage."
        },
        {
            "Date": "Reviewed in France on 5 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Très jolie clavier mécanique, le son et la sensation à la frappe sont vraiment très bonnes, j'aime beaucoup par rapport à ce qu'on peut trouver même en haut de gamme sur des marques connues comme L*gitech.\nIl est bien épais et lourd, ca sent la qualité. Les couleurs feront fortement penser à des consoles rétros comme la famicom (Nes Japonaise).\nSeul point à noter, clavier en Qwerty, mais si vous êtes débrouillard, vous pourrez changer la disposition des touches avec une pinces conçu pour les retirer puis de façon logicielle si jamais votre machine a une autre disposition de base. Vous pouvez également installer des softs spécialisés pour customiser les inputs.\n\nBon produit, parfait pour les amateurs de ce genre de matériel."
        },
        {
            "Date": "Reviewed in Germany on 4 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Ich habe mir die Tastatur in der Farbe \"Taupe\" bestellt und bin sehr begeistert von den verbauten Switches / Schaltern. Ich mag eigentlich keine linearen Schalter, hatte viele MX-Red oder auch andere \"Rote\", diese Schalter gefallen mir echt gut, die besitzen einen weichen Anschlag, keinen Hall.\n\nDer Drehknopf zur Lautstärkesteuerung war bei mir schon verbaut, diesen kann man aber durch zwei mitgelieferte Schalter tauschen. Mit der Steuerung für die RGB-Beleuchtung tu ich mich noch etwas schwer, das kommt mit der Zeit. Auch mit US-Layout erkennt Windows 11 das Y als Z beim schreiben, es macht also nichts das Z und Y von der Position vertauscht sind.\n\nFür den Preis von knapp 90€ kann man bei der Tastatur nicht falsch machen. Ist empfehlenswert.\n\nP.s. Ich habe die Keycaps getauscht gegen HyperX Pudding White Keycaps. Damit kommt die Beleuchtung viel besser zur Geltung. Die Originalen Tastenkappen lassen ja leider kein Licht durch."
        },
        {
            "Date": "Reviewed in Germany on 4 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Die iLovBee B87 ist eine mechanische Tastatur. Mit ihrer kabellosen Funktionalität und den vielseitigen Verbindungsmöglichkeiten über Bluetooth, 2.4G und USB-C bietet sie maximale Flexibilität. Besonders hervorzuheben ist das Vintage-Rot-Design.\n\nVerpackung\nDie Tastatur wurde sicher und kompakt verpackt geliefert. Die Verpackung enthält neben der Tastatur selbst auch ein USB-C-Kabel, einen Tastenkappen-Abzieher, drei zusätzliche Switches und eine Pause-Taste. Die Bedienungsanleitung könnte etwas ausführlicher sein, enthält aber alle notwendigen Informationen, um die Tastatur in Betrieb zu nehmen.\n\nMaterial und Verarbeitung\nDie Materialqualität der Tastatur ist beeindruckend. Die Tastenkappen fühlen sich robust und angenehm an und sind zudem resistent gegen Abnutzung. Die Tastatur verwendet lineare Aster-Switches, sie haben ein sanftes und leises Tippgefühl. Ein kleiner Verbesserungsvorschlag wäre eine Gummierung oder Riffelung des Soundknobs, um den Grip zu verbessern.\n\nDesign\nDas Vintage-Rot-Design der Tastatur ist ein echter Hingucker. Die RGB-Beleuchtung lässt sich individuell anpassen und verleiht der Tastatur einen modernen Touch.\n\nPreis-Leistungs-Verhältnis\nFür die gebotene Leistung und Qualität ist der Preis der Tastatur absolut gerechtfertigt.\n\nFazit\nDie iLovBee B87 überzeugt durch ihr ansprechendes Design, die hochwertige Verarbeitung und die vielseitigen Nutzungsmöglichkeiten. Kleine Verbesserungen wie ein optimierter Soundknob und eine ausführlichere Bedienungsanleitung würden das Gesamtpaket abrunden. Insgesamt bietet die Tastatur ein hervorragendes Preis-Leistungs-Verhältnis."
        },
        {
            "Date": "Reviewed in Germany on 3 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Relevante Stichpunkte:\n- Sehr gute Verarbeitung (es quietscht / knarzt rein gar nichts)\n- Im Lieferumfang ist eine Anleitung enthalten, worin alle Tastenkombinationen draufstehen. Den Akkustand kann man beispielsweise ablesen, indem man \"Fn + Enter\" gedrückt hält\n- Der Sound ist unfassbar gut (siehe Video im Anhang)\n- Die Switches sind factory-lubed, was ich auch bestätigen kann\n- Es handelt sich um eine Gasket-Mount Tastatur, somit wird die Tastatur nicht durch Schrauben zusammengehalten, sondern durch Gummidichtungen\n- Die Keycaps sind aus PBT, und fühlen sich auch hochwertig an\n- Der Knob oben rechts ist hot-swappable, man kann stattdessen auch den \"Pause\"-Button anbringen, welcher im Lieferumfang enthalten ist\n- Die Webseite von iLovBee ist offline, somit hat man keinen Software Support oder ähnliches\n- Die Tastatur hat VIA-Support, allderdings nicht out of the box. Damit es funktioniert muss man eine bestimmte .json Datei herunterladen, welche leider etwas versteckt ist. Ich bin mir nicht sicher, ob ich einen Link dazu in meiner Rezension hochladen darf, aber wenn man auf der Amazon-Produktseite etwas herunterscrollt, findet man es\n- RGB ist vorhanden (sogar an den Seiten), die Keycaps sind jedoch nicht lichtdurchlässig, einige könnten es somit schwierig finden, im Dunkeln zu tippen\n- Es handelt sich hierbei um das ANSI-Layout, somit wird es schwierig, Umlaute einzugeben. Dafür gibt es allerdings Abhilfe; EurKey. Sobald man das installiert und eingerichtet hat ist man (u.a) in der Lage Umlaute einzugeben (Alt Gr + a / s / u / o / ...)\n- Es gibt (wieso auch immer) eine Taste, um den Taschenrechner zu starten"
        },
        {
            "Date": "Reviewed in France on 3 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Ce clavier est une option de personnalisation pour les claviers mécaniques de format 60% et TKL. Il est en plastique.\nLe profil ASA donne une sensation de frappe agréable et confortable. Je le trouve joli et je suis assez content du résultat.\n\nLa disposition ANSI US correspond à la norme de disposition de clavier américaine, ce qui facilite l'installation sur la plupart des claviers mécaniques standard disponibles sur le marché."
        },
        {
            "Date": "Reviewed in France on 3 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Ce clavier était presque parfait mais je ne peux malheureusement pas modifier la disposition des touches sur mon iPad, en revanche sur mon ordinateur sous Windows il est reconnu en AZERTY ( c'est ma configuration d'origine ) donc pour une personne qui voudra l'utiliser sur son PC aucun probleme.\n\nLa frappe est agréable et le bruit aussi, coté design c'est un peu rétro mais le RGB en fond le modernise plutot bien, j'aime beaucoup.\n\nBonne qualité globale"
        },
        {
            "Date": "Reviewed in France on 2 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "J'aime beaucoup le côté Retro de ce clavier et la coloration des touches. C'est un chouette produit.\nIl est appairable Bluetooth ou Wifi selon vos préférences ou filaire mais esthétiquement c'est dommage.\n\nJ'aime :\n* la qualité des switchs qui en font un clavier presque silencieux (par rapport à mon précédent)\n* le fait de pouvoir démonter les touches et changer les switchs (la base d'un clavier)\n* la multitude de réglage lumineux possible\n\nJ'aime moins : (mais ça je le savais avant)\n* l'absence de pavé numérique latéral mais ça c'est mon feeling à moi\n* la disposition QWERTY du clavier (ce qui entraine le déplacements de certaines touches selon la pratiques (developpeurs par exemple)\n\nDe manière générale, je dirais produit solide et stylé. Si le QWERTY ne vous fait pas peur, n'hésitez pas.\nJe recommande ce beau clavier rétro !"
        },
        {
            "Date": "Reviewed in Germany on 2 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Ich schreibe diese Rezension gerade auf dieser Tastatur und muss sagen, der Sound wir wirklich unglaublich befriedigend. Die Tastatur selber ist sehr stabil gebaut, fühlt sich absolut nicht billig an und auch der Retro-Style sieht meiner meinung nach sehr cool aus. Soweit sogut!\n\nAuch die Tatsache, dass man Kabel, Bluetooth UND 2,4ghz stick verwenden kann ist mega! Quasi für jede Situation geeignet.\n\nDas beste an der Tastatur ist aber der klang. Die Tasten haben ein unglaublich schönes \"Tack\" Geräusch beim anschlag, so wie man es sonst eigentlich nur von 200€+ tastaturen kennt. Für Keyboard-Enthusiasten also perfekt geeignet!\n\nMein einziges Manko ist, dass es keine Software gibt sondern alles über Shortcuts eingestellt wird. Da ich aber auch ganz zufrieden bin nicht NOCH eine software benutzen zu müssen gibt es trotzdem 5/5 Sterne!"
        },
        {
            "Date": "Reviewed in Germany on 2 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Als Mitglied des Amazon Vine Clubs hatte ich die Möglichkeit, die iLovBee B87 Mechanische Tastatur zu testen.\nHier sind meine Eindrücke:\n\nDie iLovBee B87 ist eine hochwertige mechanische Tastatur, die sowohl für Gaming als auch für allgemeine Computernutzung geeignet ist. Sie bietet eine Vielzahl von Funktionen, darunter eine 75 Prozent RGB-Beleuchtung, QMK/VIA Bluetooth/2.4G/USB-C-Konnektivität und PBT-Tastenkappen im US-Layout. Die Tastatur verfügt über einen Hot Swap Linearen Aster Schalter, der ein angenehmes und reaktionsschnelles Tippgefühl bietet.\n\nDie Tastatur ist in einem ansprechenden Vintage-Rot gehalten, was ihr ein einzigartiges und stilvolles Aussehen verleiht. Sie ist gut verarbeitet und fühlt sich robust an, was auf eine lange Lebensdauer hindeutet.\n\nEin kleiner Nachteil ist, dass die Tastatur \"möglicherweise\" nicht vollständig mit Smart TVs kompatibel ist. Während sie grundsätzlich über Bluetooth mit einem Smart TV verbunden werden kann, können einige spezielle Funktionen oder Tastenkombinationen auf einem Smart TV möglicherweise nicht funktionieren.\n\nDie Kompatibilität einer externen Tastatur mit einem Samsung Smart TV hängt von verschiedenen Faktoren ab. Generell unterstützen z.B. Samsung Smart TVs ab der H-Serie (2014) externe Tastaturen, sowohl USB- als auch Bluetooth-Tastaturen. Es ist jedoch wichtig zu beachten, dass dabei nur externe Geräte genutzt werden können, die keine speziellen Treiber benötigen. Die iLovBee B87 Mechanische Tastatur verwendet QMK/VIA Bluetooth/2.4G/USB-C für die Verbindung, was im Allgemeinen mit Samsung Smart TVs und auch anderen gängigen TV Geräten kompatibel sein sollte.\nAllerdings kann es bei einigen Apps auf dem Smart TV zu Einschränkungen kommen. Nicht alle Apps unterstützen die Texteingabe über eine externe Tastatur. Daher könnte die Nutzung der Tastatur in bestimmten Apps eingeschränkt sein.\nDas alles werde ich an meinem neuen Samsung OLED Smart TV aus dem Jahre 2023 ausgiebig testen, was aber sehr zeitaufwendig sein wird. Bei Gelegenheit gibt es dann hier ein entsprechendes update meiner Rezension.\n\nInsgesamt ist die iLovBee B87 eine ausgezeichnete Wahl für jeden, der eine vielseitige und stilvolle mechanische Tastatur sucht. Trotz der kleinen Einschränkung bei der Nutzung mit Smart TVs, vergebe ich 4 von 5 Sternen, natürlich mit einer Kaufempfehlung verbunden."
        },
        {
            "Date": "Reviewed in Italy on 30 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Sono rimasta positivamente sorpresa da questa tastiera meccanica! Ha uno stile di colori un po' retro, con questo grigino misto bordeaux. Però vista di persona fa davvero un bell'effetto e sembra di ottima qualità.\nLa cosa che mi è piaciuta tantissimo è sia il feeling dei tasti meccanici, sia il rumore che fanno, davvero piacevole, effetto ASMR, perfetta per tutti coloro che amano il rumore dei tasti.\nUnica cosa che mi sento di far notare è che purtroppo non ci sono le lettere accentate, perchè è una tastiera con layout US.\nE' una tastiera wireless che funziona sia con 2,4Ghz, sia con cluetooth, sia con cavo USB-C. Insomma, davvero un prodotto fantastico, la consiglio assolutamente"
        }
    ]
}