{
    "Category": "Amazon",
    "Product Name": "Wireless Mechanical Keyboard, B87 Gasket Mounted RGB Gaming Keyboard 75%, QMK/VIA Bluetooth/2.4G/USB-C Volume Knob PBT Keycaps, Hot Swappable Linear Aster Switch, Vintage Red",
    "Product Image": "https://m.media-amazon.com/images/I/61cPD1nDdVL.__AC_SX300_SY300_QL70_ML2_.jpg",
    "Unique Key": "B0D1XKDWFM",
    "Clean URL": "https://amazon.com.au/Wireless-Mechanical-Keyboard-Bluetooth-Swappable/dp/B0D1XKDWFM",
    "Brand": "Brand: iLovBee",
    "Average Star": "4.4 out of 5",
    "Reviews": [
        {
            "Date": "02 September 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "No complaints, for a $80 keyboard it sounds and feels fantastic. Keep in mind that if your battery dies the keyboard wont immediately be usable upon plugging it in. Mine was unresponsive for 5-10min. But once I let it charge everything worked perfect again."
        },
        {
            "Date": "15 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "👍🏻👍🏻👍🏻highly recommended"
        },
        {
            "Date": "25 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Awesome buy happu i got it before the price increases"
        },
        {
            "Date": "20 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Excellent keyboard, keys feel good, sound is creamy, VIA programmable and good value for money. This is my second mechanical keyboard very happy with ilovBee B87."
        },
        {
            "Date": "01 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Un clavier qui tient donc bien ses promesses. Une frappe assez agréable, un beau design et une bonne finition. Pas de plastic qui craque ou autre. Certaines touches configurable en macro. Les key caps sont bien sur changeable tout est fourni pour.\nLe seul petit point négatif c'est peut-être le soft de configuration car la doc n'est pas en français mais avec quelques recherches on finit par y arriver !\nJe recommande !"
        },
        {
            "Date": "21 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Bin mehr als zufrieden kann ich nur empfehlen. Hört sich richtig gut an fühlt sich auch gut an."
        },
        {
            "Date": "21 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "If you're looking for a budget keyboard that has a good sound that is similar to a brown-switch keyboard - you're in luck. The sound is more subdued than a linear red switch keyboard but, offers such a creamy sound when you type. For those on a budget looking for a more quiet, but satisfying, clicky clack (or THOCK) keyboard - this is the one. The keys are pre-lubed so they have a great sound and don't seem to have any issues with sticking. The keyboard is hot swappable for those looking to change out the switches so, if you're interested in the look rather than the feel of this keyboard than it makes for an easy switch. Highly recommend to those looking for a good budget keyboard or are a first time keyboard customizer. I will be looking for these similar switches to add to my other linear red keyboards!"
        },
        {
            "Date": "30 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Sono rimasta positivamente sorpresa da questa tastiera meccanica! Ha uno stile di colori un po' retro, con questo grigino misto bordeaux. Però vista di persona fa davvero un bell'effetto e sembra di ottima qualità.\nLa cosa che mi è piaciuta tantissimo è sia il feeling dei tasti meccanici, sia il rumore che fanno, davvero piacevole, effetto ASMR, perfetta per tutti coloro che amano il rumore dei tasti.\nUnica cosa che mi sento di far notare è che purtroppo non ci sono le lettere accentate, perchè è una tastiera con layout US.\nE' una tastiera wireless che funziona sia con 2,4Ghz, sia con cluetooth, sia con cavo USB-C. Insomma, davvero un prodotto fantastico, la consiglio assolutamente"
        },
        {
            "Date": "09 August 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Tengo que seguir investigando, pero el teclado no se carga con el ordenador y\nademás tiene muy poca autonomía de carga .No te asegura horas de juego o de trabajo"
        },
        {
            "Date": "05 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Très jolie clavier mécanique, le son et la sensation à la frappe sont vraiment très bonnes, j'aime beaucoup par rapport à ce qu'on peut trouver même en haut de gamme sur des marques connues comme L*gitech.\nIl est bien épais et lourd, ca sent la qualité. Les couleurs feront fortement penser à des consoles rétros comme la famicom (Nes Japonaise).\nSeul point à noter, clavier en Qwerty, mais si vous êtes débrouillard, vous pourrez changer la disposition des touches avec une pinces conçu pour les retirer puis de façon logicielle si jamais votre machine a une autre disposition de base. Vous pouvez également installer des softs spécialisés pour customiser les inputs.\n\nBon produit, parfait pour les amateurs de ce genre de matériel."
        }
    ]
}