{
    "Category": "Amazon",
    "Product Name": "Bosch 18V Cordless Mower and Grass Cutter with 4.0Ah Battery and Fast Charger, Lightweight and Ergonomic Design (EasyMower 18V-32-200 & EasyGrassCut 18)",
    "Product Image": "https://m.media-amazon.com/images/I/61Pr1h6eFvL.__AC_SX300_SY300_QL70_ML2_.jpg",
    "Unique Key": "B0CQN3FNDH/",
    "Clean URL": "https://www.amazon.com.au/Bosch-Lightweight-Ergonomic-18V-32-200-EasyGrassCut/dp/B0CQN3FNDH/",
    "Brand": "Bosch",
    "Average Star": "4.2 out of 5",
    "Reviews": [
        {
            "Date": "Reviewed in Australia on 27 July 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Bought on prime day. Doesn’t work out of the box. No option to reply and now can’t mow my lawn, careful when buying just unnecessary inconvenience. Disappointed supposed to be Bosch quality"
        },
        {
            "Date": "Reviewed in Australia on 23 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great lawnmower for the price, couldn't ask for more"
        },
        {
            "Date": "Reviewed in Australia on 30 May 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Feels a little wimpy but it does the job."
        },
        {
            "Date": "Reviewed in Australia on 4 May 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Due to illness the mowing had to become my responsibility so I bought this quaint female savvy easy mower. It's basic & does the job. Only disappointment is I can't find replacement blade F016800626 anywhere within Australia. Otherwise it is what it is. A basic entry level helpful mower."
        },
        {
            "Date": "Reviewed in Australia on 2 April 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "This mower is very bad. The performance is disgusting. I called warranty to grt if fixed. They took it for 3 weeks and returned it with the same bad performance."
        },
        {
            "Date": "Reviewed in Australia on 26 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I am impressed! So light, easy to operate, thank you!"
        },
        {
            "Date": "Reviewed in Australia on 24 March 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Useless. It always stuck and you have to clear the blade with your hand. The battery lasts for less than 7-8 minutes. If you adjust the wheels heights to cut short, it never works.\nI have to recharge the battery so many times to be able to clean cut a small backyard. So disappointed"
        },
        {
            "Date": "Reviewed in Australia on 13 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Very happy with the quality, light weight easy to use."
        },
        {
            "Date": "Reviewed in Australia on 5 March 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I ordered this mower... IT COMES WITHOUT A BATTERY!!!\nI paid a fortune for a battery which took nearly a month to arrive.\nIT DIDN'T HAVE A CHARGER!\nSo angry... now have ordered a charger.\nVery deceptive from BOSCH.\nPoor customer service. Disgusting hidden charges."
        },
        {
            "Date": "Reviewed in Australia on 3 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I like the fact the this compact mower does its job without strenuous pushing and pulling. Easy to start and get on with it."
        },
        {
            "Date": "Reviewed in Australia on 12 February 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "This machine does not work for tick grasses such as buffalo gras, it does not work in grasses longer than 60 mm, very light , low noise"
        },
        {
            "Date": "Reviewed in Australia on 28 January 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "The only issue I’ve had with this mower is that on dense/tall patches, it cannot keep going and stalls so you have to take it easy and work around those bits. Otherwise it’s a pretty handy and compact mower, and being able to use the battery for my Bosch power tools is pretty convenient."
        },
        {
            "Date": "Reviewed in Australia on 5 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "After having only ever used a petrol Mower I was a little sceptical of how this would perform but needn't have been.\n\nI love how light and quiet it is. It doesn't have as much cutting width as my old petrol mower so takes slightly longer. But because it is much lighter and easy to manouver it actually takes less effort.\n\nVery happy with this purchase and to be able to get rid of my last petrol powered tool."
        },
        {
            "Date": "Reviewed in Australia on 23 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I have not actually used it as yet. We move into a new home in a month and I am keeping it for then."
        },
        {
            "Date": "Reviewed in Australia on 21 December 2023",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "It is quite a bit smaller than I thought."
        },
        {
            "Date": "Reviewed in Australia on 3 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I wasn't expecting to be as impressed as I am with this mower. Having started to dip into the Bosch 18v fleet of tools recently, I decided it was time to move away from the need to store petrol at home and go electric for keeping our, relatively small yard, neat and tidy.\n\nThe mower is super light and easy to spin around quickly. The cutting height is best on its lowest setting if you keep your grass short, but if it gets away on you then you have a couple of higher settings to help bring it under control.\n\nI used one 4Ah battery starting with the Bosch 18v line trimmer to edge my nature strip as well as my neighbours, and also my back yard. Then with the same battery I mowed my lawn, which was long, and also both nature strips. Then, again with the same battery, I used the Bosch 18v blower to clean up the clippings and leaves.\n\nI was probably 1 minute away from finishing with the blower when the 4Ah battery was fully drained. I have spare batteries, so it wasn't a big deal.\n\nThe mower also had no trouble blasting through sticks and twigs that fall from my trees and all up I filled the catcher 3 times fully and then a partial fill before I was done.\n\nTo say I was impressed is an understatement. I simply couldn't believe it worked as well as it did, and I only used 1 battery for the entire process.\n\nI've only used it twice so far and it's performed well both times. Long term ownership will be interesting but at this point I would definitely recommend."
        },
        {
            "Date": "Reviewed in Australia on 30 November 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "For what is really a plastic toy like mower, it does a pretty good job. Had to deal with a well overgrown yard on its first outing, and with a few charges, it did a pretty decent job"
        },
        {
            "Date": "Reviewed in Australia on 13 November 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Lawn Mower"
        },
        {
            "Date": "Reviewed in Australia on 28 October 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I have a small back yard and only took me 20 minutes to mow the lawns and cleaned up\nGreat to use and to handle"
        },
        {
            "Date": "Reviewed in Australia on 27 August 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "This mower is the absolutely worst! It worked for 10 seconds, didn’t collect the grass, it kept shutting off and only working for 3-5 seconds and it doesn’t work anymore at all! I literally wasn’t able to cut 1 square meter of grass! And I can’t return because I missed the window."
        },
        {
            "Date": "Reviewed in Australia on 10 July 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Used once with great result. After recharging battery, stooped working. Ignition started mower, but after 4 seconds, it stopped. Cannot be fixed after contacting customer support. Unfortunately had to send back via post office. Lots of trouble.\nNot worth it.\nWill try other brand."
        },
        {
            "Date": "Reviewed in Australia on 18 June 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "The machine stopped working after 1 month of use. Will not turn on even with a full battery. The process of getting repairs is lengthly. Would not recommend it."
        },
        {
            "Date": "Reviewed in Australia on 16 June 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This mower is perfect for our small courtyard lawn. It is extremely lightweight, manoeuvrable and cuts perfectly. I'm using the smaller 2.5mAh battery and no problems at all."
        },
        {
            "Date": "Reviewed in Australia on 20 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Still on its first mow, so far so good. Pros: Light and easy to handle, does a good clean cut. Cons: Catcher basket is small, and you cannot mow without it (if you were looking) to spread the clippings over your lawn to act as compost, you can’t it is spring loaded to stay closed. You will need more than 1 battery. Although it does recharge in 90 minutes, it takes 90 minutes to recharge.Having to do that to mow each of my laws equals a two day job. I recommend buying the next version up (its $10 more for a longer runtime). UPDATE: Still happy, but two issues; the handles underside needs to be less rough.When carrying the mower, it gets painful quite quickly. Secondly, you need to hold the one of the red buttons in the handgrips the whole time or it stops running, great safety feature, but once again cause’s irritation."
        },
        {
            "Date": "Reviewed in Australia on 27 April 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Really like this aplenty!\nLight to push. Easy to use. Quality stuff. Small lawns.\nIt’s a game changer for me so easy to use ; versus , my old petrol lawn mower which is too heavy and temperamental\n\nIt’s easier than using our house vacuum !\n\nThe bigger one would be a hoot.\n\nThe instructions manual is rather thin on assembly notes: go on YouTube and find a video on that.\nFront lawn and pool side lawn never been better ."
        },
        {
            "Date": "Reviewed in Australia on 15 March 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Perfect for the small amount of grass I have."
        },
        {
            "Date": "Reviewed in Australia on 8 March 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "it works"
        },
        {
            "Date": "Reviewed in Australia on 12 February 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Good quality stylish sturdy and low noice cordless lawnmower. Quite happy with the quality and price."
        },
        {
            "Date": "Reviewed in Australia on 20 December 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "You expect a Bosch to be better than an Ozito lawnmower, but I’m actually surprised how much difference there can be between two battery powered 18v lawnmowers.\n\n1. WEIGHT - this is so much lighter than my Ozito. I’m a woman and can still pick it up with one hand and carry the entire thing like a handbag.\n2. Steering - pushing is much easier.\n3. Edge cutting - my old Ozito left me basically having to mow with my trimmer in some places. This one, I can skip trimming entirely in some places.\n4. Finish - very tidy.\n5. Assembly - about 20 minutes? Slightly tricky putting together the grass catching basket. Also some drama getting the handles to align for the screws. Still miles easier than the Ozito, which took about an hour.\n\nCons:\nBattery - no included battery, and the 2.5Ah 18v battery (which came with my hedge trimmer) I have had to be recharged twice to mow and trim my two small lawns totaling about 100sqm. Was pretty quick to recharge tho, and I still got it done in one day. It’s not such a bad thing to have a break on a hot summer day, but do make sure you leave yourself time for the recharge - or spring for a bigger battery. Ozito came with an 18v 4Ah battery, which at least managed to do the lawnmower in one go, if not the trimmer."
        },
        {
            "Date": "Reviewed in Australia on 15 December 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great product for small gardens. A cordless mower is much more practical than the fueled products.\nGood quality, light weight, easy installation, easy use"
        },
        {
            "Date": "Reviewed in the United Kingdom on 25 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Perfect if you don’t want a heavy mower. Can be picked up by anyone, especially if you put the battery in after moving it. Small and narrow so you end up mowing more rows up and down your lawn. But great for low weight and size."
        },
        {
            "Date": "Reviewed in Germany on 18 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "für unser Stadtgrundstück völlig ausreichend, mit 2 Accu bin ich einmal 150m²rum"
        },
        {
            "Date": "Reviewed in Germany on 17 August 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Kompakt, leicht, praktisch, gut!"
        },
        {
            "Date": "Reviewed in Germany on 17 August 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Bereits nach einem halben Jahr hat das Gerät seinen Geist aufgegeben. Der Motor startet, nur um nach wenigen Sekunden wieder auszugehen. Insgesamt wurde der Rasenmäher maximal 10 x genutzt. So stelle ich mir keinen wertigen Artikel einer deutschen Firma vor. Ich bin nun auf den Kundenservice gespannt, da der Defekt noch in die Garantiezeit fällt..."
        },
        {
            "Date": "Reviewed in Germany on 16 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Was soll man sagen, halt Boschqualität, alles gut..."
        },
        {
            "Date": "Reviewed in the United Kingdom on 10 August 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Stoped working after 5 min ……"
        },
        {
            "Date": "Reviewed in Belgium on 7 August 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Je dois recharger la batterie toutes les 10 minutes ..."
        },
        {
            "Date": "Reviewed in Germany on 2 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Nur für kleine Mäharbeiten angeschafft. Tut was er soll bei 4,5 Ah Akku."
        },
        {
            "Date": "Reviewed in Germany on 30 July 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Die Akkus überhitzen schnell, so dass auch schon einer getauscht werden musste, weil er durchgebrannt ist. Kann maximal 10 Minuten mähen, dann muss ich Pause machen, sonst brennt der nächste durch. Jetzt hat das Gerät endgültig seinen Dienst versagt. Ich hatte von Bosch mehr erwartet. Nie wieder."
        },
        {
            "Date": "Reviewed in Germany on 23 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "I have owned the CityMower and the electronics died after a few years (overheating?). The price of the EasyMower without battery was comparable to the price of the spare part needed for the CityMower, so I bought the EasyMower and used it for a few months now. I would say that both are good engineering with different goals: City is a well built machine for the given task with some nice ergonomic features, while Easy is almost as good, with a drastically lower price.\nThe material of the Easy (handle, blade) feels cheap compared to City, but it is good enough. The height of the City can be easily adjusted with one lever, while the Easy, you have to turn upside down and adjust each wheel -- not something that I do regularly anyways. The handle of the City is much more sophisticted, but Easy is considerably lighter, so I feel I can manouver it better. The motor of the City feels much stronger, it starts and stop almost immediately, Easy has some lag, but it is slightly less loud (City is also quite quiet).\nMy personal preference would be to buy the Easy again and spend the price difference on beer. But hopefully I won't need to buy yet another one."
        },
        {
            "Date": "Reviewed in Germany on 18 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Ist sehr gut in Handhabe , leicht und wiendig"
        },
        {
            "Date": "Reviewed in the United Kingdom on 11 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "A very good mower"
        },
        {
            "Date": "Reviewed in the United Kingdom on 7 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This mower is easily adjustable for the height of cut, it's light and maneuverable.\n\nYou'll have to make sure you have a battery as this particular version does not come with one."
        },
        {
            "Date": "Reviewed in Italy on 6 July 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Non compratelo, ho un giardino piccolo di misura 7x7, se avete l’erba alta più di 15 cm non arrivate in fondo , non faccio più di mezzo giardino e si scarica la batteria. Piccolo e con solo tre regolazioni di altezza e anche scomodo da regolare."
        },
        {
            "Date": "Reviewed in Sweden on 29 June 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Köpte denna för att sköta mina 40 kvm gräsmatta. Hade tidigare en Bosch klippare som drevs med el via sladd.\nDenna dyrare klippare är maximalt kostnadreducerad. Tunn plast, sladdrig elbrytare och värst - en underdimensionerad elmotor. Klarar bara att fylla halva gräsuppsamlaren innan motorskyddet löser ut.\nOförklarligt att Bosch sätter sitt namn på denna produkt"
        },
        {
            "Date": "Reviewed in the United Kingdom on 22 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This lawnmower is absolutely amazing. It’s so light to lift and is perfect for a lawn on a slope."
        },
        {
            "Date": "Reviewed in France on 21 June 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Ayant déjà des outils Bosch, j'ai acheté cette tondeuse en toute confiance.\nA l'arrivée, une seule de mes 4 batteries fonctionne avec la tondeuse.\nSAV Bosch : Renvoyez la tondeuse.\nTrès déçu par le sérieux des produits Bosch."
        },
        {
            "Date": "Reviewed in Germany on 20 June 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Gute Leistung aber mit hoher Akkuverbrauch"
        },
        {
            "Date": "Reviewed in Germany on 16 June 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Gefallen hat mir dass er so schön Leicht ist\nWeniger schön die schnitthöhen einstellung Etwas umständlich\nBei Mittlerer Einstellung ist das Resultat Sagen wir mal Geht so"
        },
        {
            "Date": "Reviewed in the United Kingdom on 4 June 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "It is a con as you are not told on purchase that you must spend much more to use it on battery and charger"
        },
        {
            "Date": "Reviewed in Germany on 15 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Ideal for small gardens up to 50-60m2. if it is a larger one, it can be annoying because the bin is not so big. In my case I have to empty it at least 1-2 times depending on the length of the grass.\nit easy very lightweight and easy to rotate on the corners."
        },
        {
            "Date": "Reviewed in Germany on 5 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Endlich schnell mal Rasen mähen ohne Kabelsalat."
        },
        {
            "Date": "Reviewed in Germany on 30 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Vor allem für ältere Menschen sehr sinnvoll, leicht und wendig. Leider hat das Vorgängergerät nicht lange gehalten, trotz Bosch!! (Garantie vorbei, Maschine tot)"
        },
        {
            "Date": "Reviewed in Belgium on 21 November 2023",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Je l'ai utilisée durant une saison. Passe difficilement si l'herbe est trop haute. Ne semble pas très solide, à voir sur la durée. Est composée majoritairement de plastique.\nElle fait toutefois le job pour le moment."
        },
        {
            "Date": "Reviewed in Germany on 11 November 2023",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Der Akku-Mäher wurde in einem geöffneten verschrammten Originalkarton geliefert, daher ging er zurück."
        },
        {
            "Date": "Reviewed in the United Kingdom on 7 November 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The best lawnmower I have ever used"
        },
        {
            "Date": "Reviewed in Germany on 23 October 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "sehr klein, kommt in jede Ecke, schneidet an Kanten sehr gut, für sehr kleine Flächen ideal"
        },
        {
            "Date": "Reviewed in Germany on 1 October 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Schneller Aufbau, gut zu handhaben."
        },
        {
            "Date": "Reviewed in Germany on 28 September 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Einfacher uusammenbau und sehr gutes Mähergebnis sowie Handhabung"
        },
        {
            "Date": "Reviewed in the United Kingdom on 27 September 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great lawn mower. Lightweight, easy to change battery. Little bit ‘cheap plastic’ feel especially on battery cover which you need to open basically every time you want to use it. No issues so far."
        },
        {
            "Date": "Reviewed in the United Kingdom on 21 September 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My only regret is that I waited so long to buy this mower. It is the cheapest mower in the Bosch cordless range making it a little basic but is does exactly what it is designed to do. I have 2 batteries and each one lasts about 20-30 minutes, depending on how long the grass is. The mower itself is lightweight making it easy to manoeuvre around the garden and has three cutting heights. Adjusting the cutting height is a little fiddly but is not a feature I will use much. The batteries are interchangeable across a wide range of Bosch home and garden power tools reducing the need for different batteries and chargers. One thing to note is that this mower DOES NOT come with battery or charger. Overall I am very happy with my purchase and would highly recommend it."
        },
        {
            "Date": "Reviewed in Germany on 6 September 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Wie erwartet,klein handlich läuft super und schneidet sauber an den Randsteinen entlang."
        },
        {
            "Date": "Reviewed in Germany on 2 August 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Hatt mich das kleine Gerät wirklich. Ich habe das gleiche Modell in der 230 V Version und war damit stehts zufrieden, bis auf die lästige Kabel zieherei und das ewige aufpassen das man nicht darüber fährt. Die lieben Nachbarn fragten auch gleich, was ich denn mit dem neuen Spielzeug will. Sie kommen mit ihren 36 Volt Geräte gerade so hin. Schon klar die haben auch ein paar cm mehr an Schnittbreite. Ich laufe jetzt ein paar mal mehr, als die Nachbarschaft auf meiner Rasenfläche hin und her. ABER mit einem leichteren und Günstigeren Rasenmäher. Bin ja auch daran gewöhnt das Kabel Gerät hat die selbe Schnittbreite. Besonders gefällt mir das geringe Gewicht mit dem man schnell und wendig ist. Wer viele Hindernisse auf seinem Rasen hat dem kann ich diesen Rasenmäher wirklich nur empfehlen. PS. Ick bin keen Mitarbeiter von die Firma."
        },
        {
            "Date": "Reviewed in Germany on 1 August 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Ich suchte einen kleinen Akkumäher.\nHandlich ist er.\n\nSchmal auch.\nAufbewahrung braucht viel Platz.\n\nUnd den Auffangkorb muss man ganz vorsichtig behandeln, weil der Kunststoff extrem dünn und filigran ist."
        },
        {
            "Date": "Reviewed in France on 28 July 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Très bonne tondeuse"
        },
        {
            "Date": "Reviewed in Germany on 27 July 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Ich gebe volle Punktzahl. Mein Benziner hatte kurzfristig seinen Geist aufgegeben und ich bin auf dieses eher kleine Teil ausgewichen. Natürlich fehlt es ihm an Breite und Kraft im Vergleich zum Benziner. Aber für einen Akku-betriebenen Rasenmäher macht er seine Sache gut. Er kämpfte sich durch ziemlich hohes und dichtes Gras, was ich ihm so nicht zugetraut hätte. Natürlich macht da der Akku nicht ewig mit, also ist es gut, wenn man über Wechselakkus verfügt. Der Rasenmäher aber hat seine Aufgaben anstandslos erledigt."
        },
        {
            "Date": "Reviewed in Spain on 20 July 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Para 70m2 perfecto"
        },
        {
            "Date": "Reviewed in the United Kingdom on 17 July 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "I was fed up of the cord faffing so decided to get a battery mower.\nI have a small suburban front and back garden. I can get three cuts of both done before i get battery angst and charge the (4A) battery i have for it.\nIts a shame the Bosch batteries dont have a charge level light on the them like some other manufacturers do . Also the battery isn't as easy to slide in as for example as the Ryobi ones which have led indicator and slot in easy peasy (but other aspects of design let that brand down in my opinion)\nThe mower is quite light and the collector works great leaving little of any grass behind. Its a reasonably quiet lawn mower compared to my old corded one and my neighbours petrol beast machine.\nOverall 4/5, one removed for battery design/fiddliness."
        },
        {
            "Date": "Reviewed in France on 15 July 2023",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Eh bien non, les batterie bosch GBA 18 v ne sont pas compatibles avec les outils power for all. L'alliance \"power for all\" ne concerne pas les vieux outils bosch ni les outils bosch professional. Ça c'est ridicule si on considère que l'objective c'est de acheter moins de batteries et chargeurs. Heureusement Kunlun propose un adaptateur pour pas cher."
        },
        {
            "Date": "Reviewed in France on 13 July 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Bon produit ,notice un peu légère"
        },
        {
            "Date": "Reviewed in the United Kingdom on 2 July 2023",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "As many other reviews mention, the battery only lasts a few minutes.\n\nHowever, what I realised is the battery isn't drained within 2 or 3 minutes, it just shuts itself off because it gets so hot, and you have to wait for it to cool down.\n\nI was mowing for the first time in 21 degree cloudy weather. Every two or three minutes I would have to switch the battery out for another one, and wait for it to cool. This was workable for me because I already have six batteries and could rotate them in and out, but if this is your first 18v tool and you only have one battery, you are going to have to wait for the battery to cool down every couple of minutes before you can continue.\n\nWhy they designed the battery compartment to be essentially a giant black heat box is beyond my comprehension. When the mower functions it is actually great, I'm very impressed how well it cuts for something battery powered. But the whole thing is let down by this one design flaw. You can feel the battery compartment cover is hot to touch on an overcast day, whilst the rest of the mower isn't. And it isn't just the battery getting hot from use, as I put a fresh battery in, went to do something else for 10 minutes, and when I came back the battery was boiling and wouldn't turn on!\n\nIt is definitely false advertising when they say you can cover x square metres on one charge, because you can do it, just not in one go."
        },
        {
            "Date": "Reviewed in Germany on 22 June 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Top"
        },
        {
            "Date": "Reviewed in Germany on 14 June 2023",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Warum diese kritische Überschrift? Ich habe einige Geräte der Bosch 18V-Serie gekauft, weil man eben nur einen Typ Akku benutzen muß, um alle Geräte zu betreiben. Das funktioniert prima. Was aber, wenn ein Gerät defekt ist? Gleiches Gerät wieder kaufen? Genau das ist mir passiert. Ich hatte von 3 Jahren den Rasenmäher schon einmal erworben. Funktionierte prima, kein Grund zur Klage. Garantie auf 3 Jahre verlängert durch Registrierung bei Bosch. Dann der \"worst case\": 5 Tage nach Garantieablauf stellte das Gerät seine Funktion ein. Das nun Folgende mit dem Bosch-Kundendienst war eine unschöne Erfahrung. Ein Schriftwechsel mit ständig wechselnden Bearbeitern, Einschicken zur Reparatur (Gerät wurde von Bosch abgeholt - aber erst nach mehrmaliger Kontaktaufnahme, irgenwas ging immer schief), Kostenvoranschlag (140€ Reparatur). Ich stellte die Frage nach Kulanz, weil ja nur 5 Tage nach Garantie. Plötzlich hieß es, ich hätte ja eine Garantieverlängerung abschließen können (auf 3 Jahre), dann hätte man über Kulanz reden können. Hatte ich ja. Aber das Dokument sei weg. Ich hatte es aber als PDF mitgeschickt. Im Kundenkonto sei nichts zu finden. Wenn ich ins Kundenkonto schaue, ist alles da. Wie auch immer, da ich wie besagt die Akkus der 18V-Serie habe, habe ich wieder das Gerät gekauft. Hoffentlch hält es diesmal länger als 5 Tage über die Garantie. Ich bin sonst sehr zufrieden mit meinen Bosch-Geräten, aber das war enttäuschend... Deswegen für die Robustheit nur einen Stern. Es ist ja nicht so, das von den Betriebsstunden her gesehen das Gerät 24/7/365 x 3 Jahre in Betrieb war...."
        },
        {
            "Date": "Reviewed in Germany on 7 June 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Zuerst war ich eher skeptisch ob der Rasenmäher für meine Zwecke ausreicht. Rasenfläche ist ca. 180 Quadratmeter. Der Akku hält für ca. für 2,5 mal. Die Ladezeit beträgt ca. 1,5 h. Der Rasenmäher ist schnell zusammengebaut und ist sehr leicht und handlich. Einen Stern Abzug gibt es für den, aus meiner Sicht, zu windigen Auffangkorb, der fällt bei viel Gras auseinander und der Tragegriff fällt auch raus. Das könnte man etwas stabiler machen."
        },
        {
            "Date": "Reviewed in Germany on 2 June 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Es wundert schon, wie konsequent günstiges Plastik zum Einsatz kommt. Beim Fangkorb ist es wenigstens flexibles, hochwertigeres Plastik.\nDer Rasenmäher ist dann nach nur einem Einsatztag kaputt gegangen und ließ sich am Folgetag nicht mehr starten. Der Akku war ok und hat die Bosch Heckenschere problemlos bewegt. Eine riesige Enttäuschung und viel Ärger beim Aufbau, Abbau und Karton wegbringen…"
        },
        {
            "Date": "Reviewed in the United Kingdom on 29 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Used for the first time today, excellent lightweight easy to manoeuvre around our lawn right up to the edges."
        },
        {
            "Date": "Reviewed in Germany on 14 April 2023",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Das Versprechen von BOSCH \"1 Akku für alle Geräte\" ist humbug. 18V ist zwar 18V, aber danach kommt noch der Ah Wert und der ist offensichtlich je Gerät verschieden, jedenfalls mein 18V Akku hat lediglich 2,5 Ah, der Rasenmäher benötigt aber 4 Ah."
        },
        {
            "Date": "Reviewed in the United Kingdom on 6 April 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Received item and packaging stated it came with battery + charger, none to be found, very misleading. Tried to return as product is not powerful enough for intended purpose and unable to do so despite it never being used, avoid purchasing from this seller and avoid buying bosch in general, not worth time or money."
        },
        {
            "Date": "Reviewed in Germany on 3 January 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "klein und handlich... das ganze netzunabhängig bei Gebrauch."
        },
        {
            "Date": "Reviewed in France on 17 December 2022",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "avec une batterie 4Ah la surface pouvant être tondue est faible si l''herbe est un peu haute"
        },
        {
            "Date": "Reviewed in Germany on 18 August 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Mit 4.0 Akku Rasen gemäht und Hecke geschnitten mit einer Akku Ladung"
        },
        {
            "Date": "Reviewed in Germany on 9 July 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Super Artikel. Langt für kleine rasen Flächen allemal und man spart sich das blöde Kabel durcheinander. Hab jetzt mehrere Artikel von Bosch u kann wechseise in den Geräten alles Akkus nutzen"
        },
        {
            "Date": "Reviewed in Germany on 4 July 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Die Einfache und gute Handhabung!😀"
        },
        {
            "Date": "Reviewed in Germany on 29 May 2022",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Zunächst das Positive: Der Mäher ist klein, leicht, handlich, die Leistung ist ausreichend. Es macht Spaß damit zu arbeiten.\nNegativ: Was sich Bosch bei Konstruktion der Motorkühlung gedacht hat, ist mir ein Rätsel... oberhalb des Messers hat man Lüftungsgitter in das das Gehäuse eingelassen. Der vom Messer erzeugte Luftstrom soll vermutlich den Elektromotor kühlen. Diese Gitter setzen sich aber mit Grasschnitt zu. Das an sich ist noch nicht weiter schlimm. Man muss Grasreste eben regelmäßig entfernen. Es dringt aber auch Grasmulch durch die Gitter und der Motorraum füllt sich nach und nach mit Schmutz und Grasschnitt. Man sollte also regelmäßig den Deckel entfernen und Schmutz aus dem Motorraum entfernen, sonst wird dieser nicht mehr ausreichend gekühlt. Was sich die Entwickler dabei gedacht haben ist mir ein Rätsel. Eine Kühlung von oben mit einem kleinen Ventilator über dem Motor wäre sicher die nachhaltigere Lösung. Nach ca. 20 Betriebstunden war der 1. Motor hinüber. Die Garantie war leider bereits abgelaufen. Beim neueren Modell befindet kein Aufkleber mehr am Gehäuse mit der Berschriftung \"longlife motor\"..... ;-)"
        }
    ]
}