{
    "Category": "Amazon",
    "Product Name": "100PCS Magnetic Tiles STEM Building Toys Set with 2 Cars, Sensory Stacking Magnetic Blocks for Toddlers & Kids, Ideal for Preschool Montessori Toys Christmas Birthday Gifts for Boys & Girls Ages 3+",
    "Product Image": "https://m.media-amazon.com/images/I/91UUewlD7BL.__AC_SX300_SY300_QL70_ML2_.jpg",
    "Unique Key": "B0BVVF6V1S",
    "Clean URL": "https://www.amazon.com.au/Magnetic-Building-Preschool-Montessori-Christmas/dp/B0BVVF6V1S",
    "Brand": "Coodoo",
    "Average Star": "4.8 out of 5",
    "Reviews": [
        {
            "Date": "Reviewed in Australia on 28 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I don't usually write reviews, but this ine deserves one.\nMonths back i bought a knock off product (from another site), which were smaller tiles, only sides, and one magned per side. Recently my 5 year old started playing with them and really enjoyed it. I thought I'll upgrade, and it was the best decision! Blocks are amazing in a sense theatre you can build on top of each other without them toppling over! We'll, rest is upto your - *cough cough* I mean to your little one's imagination 😉\nOh, it even comes with small balconies for your castle!"
        },
        {
            "Date": "Reviewed in the United States on 29 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My son loves magnatiles but the packs are so small and pricey. These work the same, and he has so many more to play with! 10/10"
        },
        {
            "Date": "Reviewed in the United States on 8 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "We bought these for my little girl she is only 1 so I just kept out the cars which have the wheels and look to be the only choking hazard. They stick to the door fridge and very well to each other. They are lots of fun even tho she can’t make the cool shapes yet. I would say they are great for kids of all ages."
        },
        {
            "Date": "Reviewed in the United States on 3 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Granddaughter loves these very colorful magnetic tiles. At first her buildings were very simple but as time goes by she’s building more sophisticated designs, expanding into multiple layers. It’s very interesting to see the increasing sophistication in her building."
        },
        {
            "Date": "Reviewed in the United States on 31 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Nice colors, sizes and shapes to work with. First toy kids go to when they come to our home"
        },
        {
            "Date": "Reviewed in the United States on 19 July 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Nice magnetic tiles, but several pieces were broken on opening. 🫤"
        },
        {
            "Date": "Reviewed in the United States on 17 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Love them. Just as good as the expensive ones. Only con was it came with quite a few no magnetic pieces that snapped into the square magnets. Too many of those but otherwise great."
        },
        {
            "Date": "Reviewed in the United States on 13 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Magnets a little bit stronger than original. Fun to play"
        },
        {
            "Date": "Reviewed in the United States on 3 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Need more squares!!!"
        },
        {
            "Date": "Reviewed in the United States on 2 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Grandchildren love them!!!"
        },
        {
            "Date": "Reviewed in the United States on 26 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "These were a xmas gift for my son, dude could be an architect one day with his imagination and engineering skills with magna tiles. The set came with a little booklet full of ideas for builds, as well as a carrying case, though we don’t use the carrying case since they stay at home anyway. They’re also surprisingly durable for how often they’re dropped and/or accidentally stepped on by the kids."
        },
        {
            "Date": "Reviewed in the United States on 23 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Good for hand-eye coordination. The magnets make it easy for a toddler to build things."
        },
        {
            "Date": "Reviewed in the United States on 22 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My 3yo kiddo loves his magnet tiles! He builds castles, cubes, ramps, and all kinds of different shapes. He plays with them every single day. They take a pretty good beating and are still on great shape. The colors are bright and they are perfect for working on STEM activities:)"
        },
        {
            "Date": "Reviewed in the United States on 15 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "True to colors, description and sizes. A much desired addition to any playroom to inspire and develop creativity."
        },
        {
            "Date": "Reviewed in the United States on 9 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Purchased as an indoor choice when we can't get outside. My grandson and I have spent hours and hours building and building new. He can easily put them together and build. This set is off great quality and I am really pleased with the number of different shapes."
        },
        {
            "Date": "Reviewed in the United States on 29 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "They were a hit with my grandson."
        },
        {
            "Date": "Reviewed in the United States on 15 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great magnetic tiles, my 4 y.o. adores playing it, this is our second set. For us it was worth the money"
        },
        {
            "Date": "Reviewed in the United States on 29 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "After having these tiles for a couple months, these are still his favorite thing to play with. He is super hard on toys (throwing, smashing, chewing) and none of them have broken. We will likely buy more so he can keep building bigger!"
        },
        {
            "Date": "Reviewed in the United States on 29 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "So great - we bought them twice!"
        },
        {
            "Date": "Reviewed in the United States on 23 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Our grandson loves playing with these, fantastic for a pre-k with a mechanical mind. Hours of interest at a time."
        },
        {
            "Date": "Reviewed in the United States on 22 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My kids love it"
        },
        {
            "Date": "Reviewed in the United States on 12 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Grandkids love playing with these and they bring out their creativity. Easy cleanup as well."
        },
        {
            "Date": "Reviewed in the United States on 6 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Grandchildren love\nplaying"
        },
        {
            "Date": "Reviewed in the United States on 28 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The colors are beautiful! I love to put blue and red together to make purple and show my daughter it’s like magic to her lol and fun for me!"
        },
        {
            "Date": "Reviewed in the United States on 27 March 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Bought a bundle set for my grandson to go with another set he got for Christmas(same brand) and have noticed many edges have cracked or broken off pieces and that unlike his original set these actually repel from each other and do not sit flush when building. I purchased these bundles because it was the same brand and the the original was such a good set. Very disappointed"
        },
        {
            "Date": "Reviewed in the United States on 24 March 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "The best brand of magnetic tiles I’ve purchased! My only con is that every package option comes with several tiles we never use. I wish I could just buy more squares at this point. I have purchased 3 packs of Coodoo tiles and we have so many fences(?) and plastic porches(?) that just sit in the bin because we don’t need them. Other than that, the colors are bright and the tiles are VERY durable. EASY CLEAN UP! My kids love them!"
        },
        {
            "Date": "Reviewed in the United States on 22 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Made for a wonderful birthday gift, playing with it everyday"
        },
        {
            "Date": "Reviewed in the United States on 20 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "These are always a win kids love them"
        },
        {
            "Date": "Reviewed in the United States on 20 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Our preschool students love these. I had to buy another pack so there is enough to go around."
        },
        {
            "Date": "Reviewed in the United States on 16 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Both my 7 and 3 year old love these. They work well with another set we already. The magnets are strong but not too strong for the little one to pull apart. I would definitely recommend this set."
        },
        {
            "Date": "Reviewed in the United States on 3 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My granddaughter loves her tiles and say she needs more!"
        },
        {
            "Date": "Reviewed in the United States on 26 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My son loves these tiles so much. He loves to tinker and construct things while his baby brother acts as Godzilla and knocks it all over. It's his go to toy and wakes up in the morning saying \"build! build!\" With how well built these are, I have minimal worries about chocking hazards i.e. the magnets falling out"
        },
        {
            "Date": "Reviewed in the United States on 22 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Granddaughters loved them. Easy for toddlers to also use. Worth the money"
        },
        {
            "Date": "Reviewed in the United States on 19 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Got these for my nephew for Xmas and he wanted to build bigger things so got more for his birthday. He loves how sturdy they are when they're built but also how easily they come apart to make new things. He's 4yo"
        },
        {
            "Date": "Reviewed in the United States on 16 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Love using these with the kids! Easy for all ages."
        },
        {
            "Date": "Reviewed in the United States on 7 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My 2 year old granddaughter loves this toy! No choking hazard for the littelist ones. Buying more for them!"
        },
        {
            "Date": "Reviewed in the United States on 6 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Really fun toy for my little niece"
        },
        {
            "Date": "Reviewed in the United States on 5 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Kids can create so many things. Keeps them happy and busy and encourages creativity"
        },
        {
            "Date": "Reviewed in the United States on 3 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "These tile were great for a 4 year old. He loves them. Constantly build new things. Uses them with other toys like cars and has a blast making tunnels and garages for them 😂"
        },
        {
            "Date": "Reviewed in the United States on 2 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "So many possibilities. My kid loves playing with these."
        },
        {
            "Date": "Reviewed in the United States on 31 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Package came on time and was in good condition. We are satisfied"
        },
        {
            "Date": "Reviewed in the United States on 31 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This product worked well. It matched up and worked well with the other set I have"
        },
        {
            "Date": "Reviewed in the United States on 31 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Grand kids like these so much I bought the larger set."
        },
        {
            "Date": "Reviewed in the United States on 23 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My 3 year old grand daughter LOVE THEM!!!\nAmazing creativity with these!!!"
        },
        {
            "Date": "Reviewed in the United States on 16 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Granddaughter really enjoying her time with this item."
        },
        {
            "Date": "Reviewed in the United States on 13 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I hate when they make these things with weak magnets. This set, however, is pretty strong and can lift 3 or 4 connected pieces. Your creations won't fall apart as easily as other sets I've tried. The other great thing is that the magnets are sealed within the plastic, I don't need to worry about the magnets getting swallowed by the baby!\n\nComes with a storage bag which is a very welcome addition.\n\nRecommended!"
        },
        {
            "Date": "Reviewed in the United States on 12 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Me and my kids absolutely love these magnetic blocks. We play them every day it seems. We plan to get another set or maybe two to be able to make more stuff. They are very fun and can be educational to. I love the little insert pieces to make balconies and stuff if your building the castle. It makes it more immersive for the kids. It's the little things that make their day. These will keep my kids entertained for hours and honestly me and my wife enjoy them as well. They fit together nicely to. Sometimes you have to flip a piece so they magnetize right but that should be expected. If you are considering these for a Christmas or birthday present I would highly recommend them. I would even recommend you get two or three sets to make the fun last even longer. You won't regret buying these. Also the little trains included make it even more immersive for the kids. They love making crazy cars."
        },
        {
            "Date": "Reviewed in the United States on 9 January 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "My boys (Freshly 2 & almost 4 years old) were absolutely overjoyed to start playing with these tiles. However because they aren't used to building with them, all their builds easily collapse and they get frustrated. My oldest has figured out how to use them after some trial and error but my younger son always has whatever he is building collapse which leads to many tears. So definitely recommend this more for older kids."
        },
        {
            "Date": "Reviewed in the United States on 4 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "We are very happy with this set of toys!! It keeps all of my children (ages 2 to 11) occupied for hours on end. These toys encourage creativity and imagination, good motor skills and dexterity. I will most likely be ordering more in the near future."
        },
        {
            "Date": "Reviewed in the United States on 1 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This was a gift for my grandson. He says it is the best gift he ever received! He plays with them everyday and shows no sign of getting tired of them. His two older sisters enjoy playing with them with him. Happy I bought them!"
        },
        {
            "Date": "Reviewed in the United States on 30 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My four year old DS grandson loves to build with these magnetic tiles. It’s so good for his coordination, imagination, and fine motor skills. Best toy ever!"
        },
        {
            "Date": "Reviewed in the United States on 29 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Durable and easy to use toddlers independent playtime and fun for all ages"
        },
        {
            "Date": "Reviewed in the United States on 28 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My grandkids love them!!!"
        },
        {
            "Date": "Reviewed in the United States on 27 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Grandkids spend hours playing with these blocks"
        },
        {
            "Date": "Reviewed in the United States on 12 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "They are amazing to play with. She loves the fact that they stay together until she takes them apart."
        },
        {
            "Date": "Reviewed in the United States on 25 November 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I bought for my classroom and my first graders love them! They ask to play with them every day. I just wish I could buy more."
        },
        {
            "Date": "Reviewed in the United States on 30 October 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Very nice, had to return as daughter bought exact same set"
        },
        {
            "Date": "Reviewed in the United States on 21 October 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Bought for my young nephew and he hasn’t grasped how to build with them yet but loved stacking them on cars and moving them around. He’ll get it in time!"
        },
        {
            "Date": "Reviewed in the United States on 21 October 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Bought these for my 3yo grandson and he absolutely loves them."
        },
        {
            "Date": "Reviewed in the United States on 21 October 2023",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Purchased this for a Christmas gift. It was delivered in its original product box with only a shipping label stuck to it. The product itself is decent quality but no longer is a Christmas gift as my 5 year old was immediately able to recognize it since it came in no packaging at all other than the original. Buyer beware if ordering for Christmas or a gift."
        },
        {
            "Date": "Reviewed in the United States on 15 October 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great tiles, my son loves them!"
        },
        {
            "Date": "Reviewed in the United States on 8 October 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great gift, my nephew has spent hours playing with these so far."
        },
        {
            "Date": "Reviewed in the United States on 2 October 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The kids love this! It works just as great as the more expensive name brand & comes with interesting pieces. They play with them for hours!\nDon’t hesitate to buy it!"
        },
        {
            "Date": "Reviewed in the United States on 17 September 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Magnatiles are such a big hit with my pre-k students. This set is similar to others but the magnet seems much stronger and this set comes with windows and balconies and even bases for cars. These are great and comes with a nice amount of tiles, a little book with included examples of things they can make and a storage bag."
        },
        {
            "Date": "Reviewed in the United States on 6 September 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I got these for my classroom for an indoor recess item and they are a hit! The kids love them. They are lightweight but strong magnetically. They all fit into the carrying bag that comes with it. The booklet with the instructions and ideas on what to build is enjoyed by all of my students. I hope to get another set or two so that everyone can enjoy them instead of having to draw names. I love them. I have students in the 6th grade that come in during indoor recess to play with these."
        },
        {
            "Date": "Reviewed in the United States on 29 August 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "At first we liked this set. And then the magnets started to come out of the pieces. The pieces can be pulled apart and magnets taken out. Not safe for a child under 5 that still puts things in their mouths."
        },
        {
            "Date": "Reviewed in the United States on 30 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "3yo loves this. He loves vehicles and he loves puzzles. We saw this when we went to a children’s museum and he loved it. So I gave this to him the following day and he is over the moon. The pieces are big enough for small hands, magnets works well and lots of fun ideas came up when I gave it to him. He was able to make lots of things while working on it. We even took it our so he can stick it on our garage door. Lots of pieces in each pack which causes lots and lots of opportunities for endless play, creativity and development of fine motor skills. The price is cheaper than the original brand so I’d say get it. The quality is the same."
        },
        {
            "Date": "Reviewed in the United States on 25 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "There are a plethora of Chinese companies selling these magnetic plastic tiles on Amazon right now. For the most part, you can mix-and-match the sets to create larger buildings and such. I use them in a residential school environment and kids of all ages really love building with these magnetic tiles. This particular set has bases with wheels so you can create a train.\n\nThis set is made in China and being sold by Chinese company on Amazon. At the current price of fifty bucks I’m sure as well over twice the price it should be. Look around for the best price per-tile before purchasing."
        },
        {
            "Date": "Reviewed in the United States on 12 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "We own the main name brand Magna tiles, as well as another off brand called Mag shapes. These are just as good as name brand, and you get more for your money.\nMy son liked the balcony inserts that our other sets don’t have.\nThe only con I can think of is it would be nice if this set came with a large base plate."
        },
        {
            "Date": "Reviewed in the United States on 11 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My kids are obsessed with magnetic tiles and I keep buying more because their builds keep getting more intricate. We have a lot of different sets in different colors but I’d never seen a set include balconies until this one! Since my kids love building hotels and castles the balcony pieces are so cool for them! All you do is attach one of the four balcony designs to an open square piece and voila! I love that this set includes the car pieces as well as varying shapes and colors. A really great set for a beginner or a veteran!"
        },
        {
            "Date": "Reviewed in the United States on 10 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Add this magnetic toy set to the collection if your child is a builder. My daughter is almost 8 years old and still loves to build. My husband is almost 50 and loves these as well. The colors are vibrant and each piece feels substantial. The magnets are also very strong.\n\nI love sets like these because it's open-ended, no rules, and it sparks imagination. Every time we play, it's slightly different. My daughter enjoys making little blueprint houses and adding her dollhouse furniture. My husband enjoys building high skyscrapers. I personally like making a house of \"cards\" that I know won't blow over.\n\nAnything magnet is awesome. But when you add a variety of color and pieces, it just makes for a great time."
        },
        {
            "Date": "Reviewed in the United States on 9 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "We love magnetic tiles and have previously gotten some from other brands, so I was a little hesitant to get an off brand set, but I was very pleased with the quality! This set included a couple of different types of tiles such as the balconies and arches that our other sets have not included and my kids loved the variety! The connectable cars were also a hit!"
        },
        {
            "Date": "Reviewed in the United States on 9 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "For all ages! These magnets are fun and keeps kids focused."
        },
        {
            "Date": "Reviewed in the United States on 6 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This set offers multiple pieces with strong magnets. The colors are bright yet transparent. I love the open ended possibilities that this offers. I use these as stem kits and I have purchased several sets from different brands. I would consider this above average."
        },
        {
            "Date": "Reviewed in the United States on 6 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "These building tiles will keep the kids occupied for hours and hours! Nice set."
        },
        {
            "Date": "Reviewed in the United States on 4 May 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "These tiles are great and work just the same as your name brand tiles. The reason I deducted a star is that you actually only get 88 magnetic pieces and then the other 12 are plastic inserts that can go in the square ones to look like a balcony etc. It is not a bad thing, but I searched the listing to try to find this information first because I don't want to be paying a premium price for plastic pieces. Otherwise great set!"
        },
        {
            "Date": "Reviewed in the United States on 4 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "These are perfect for my first grade class room during free time. Students imaginations goes wild. They learn by working together. In making interesting buildings, that are never the same. They are easy to clean, almost unbreakable and safe. A win win win 🏆"
        },
        {
            "Date": "Reviewed in the United States on 4 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My kids really like building with these magnets. As you can see the magnets are strong enough to build even a tall tower as pictured. That tower that my kids made is standing on its own even on carpet, and I was able to pick it and move it so I had a background for the photo, and it didn't fall apart! I was impressed. I also liked that the kit came with pieces with wheels and also squares that have balconies. These features really add the ability for creativity. They are easy to clean up too. To take structures apart and throw pieces in a bin takes no time at all."
        },
        {
            "Date": "Reviewed in the United States on 4 May 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "One of the kids in our family is a huge huge fan of magnetic tile sets. Most of their sets are name brand but they’re young enough and these are similar enough we’re not concerned they’ll notice. I like the variety of tile types in the set and these little cars are going to be a big hit."
        },
        {
            "Date": "Reviewed in the United States on 3 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My wife is a teacher, and she already has a few smaller sets of these magnetic building toys. This is probably the nicest set that she has. The plastic is very strong with built-in magnets. Some versions of these have weak magnets of very little magnets. This brand uses strong magnets along the edges.\n\nThe price is also nice. As many of you may know, STEM toys are not cheap. They are very expensive, and to get a good price, you are probably buying a small set. This is a large 100 piece set, nicely packaged into the box, for a descent price.\n\nGreat for children, teachers, or homeschooled. Also nice for adults who like to build..."
        },
        {
            "Date": "Reviewed in the United States on 3 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "We got this set as an addition to our other magnetic tiles, and these work well with all the miscellaneous brands. There were some new things for us in this set, including the cars, the smaller rectangles, \"E\" shaped tiles, and the window balconies that clip into the squares. One thing that is different with these is the larger size of the opening in the squares. This means that the plastic, nonmagnetic window balconies only fit into the squares that came with this set. The outer dimensions are the same, so the magnets still line up to be used together that way. The other difference is that the magnets in these are bigger and stronger. I first noticed that they held together more firmly, and so then I looked and saw the larger magnets. The price is comparable to similar tiles, but this set has some more unique pieces and stronger magnets, making it an even better value."
        },
        {
            "Date": "Reviewed in the United States on 3 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "100PCS Magnetic Tiles STEM Building Toys Set with 2 Cars, Sensory Stacking Magnetic Blocks for Toddlers & Kids\n\nBasic plastic parts with magnet but yet fun to play with. Great building toy for kids which allows their imagination to run wild. A bit easier to use than legos and easier for younger kids to be more creative with them. Price seems fair for how many pieces you get out of this."
        },
        {
            "Date": "Reviewed in the United States on 3 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I like these because the magnets are enclosed. Some other brands have them where over time they fall out. There is lots of great pieces and tons of ideas in the book. Great for kids and adults too."
        },
        {
            "Date": "Reviewed in the United States on 2 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Both my toddler and my 8 year old have a great time with these. It’s a fun way to play together while stimulating one’s imagination. It also comes with a catalog for some cool inspiration and a storage bag."
        },
        {
            "Date": "Reviewed in the United States on 2 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "If you've never had these, you may not understand why they're so amazing. I've been collecting sets of them for a year or two now because I've got 3 kids close in age so I'm always trying to find toy options that fit the following criteria:\n\n1. Great for multiple ages.\n2. Able to be used in as many ways as a child can imagine.\n3. Aesthetically pleasing for not only the kids but for ME; my children share this house too so I want them to have their \"stuff\" easily accessible but I also don't want to stare at ugly junk that doesn't actually engage the kids for more than 30 seconds.\n4. Good enough quality that I can expect all 3 kids to use them often without having things break often.\n\nThis really hits all 4 categories.\n\nMy youngest is 1; he loves the sound of dumping these out, breaking apart creations, or looking through them. My spouse is 37; he loves getting challenged to build specific things (like a \"monkey robot\") and then spending a full hour building massive things for the kids. We ALL enjoy playing with magnetic tiles.\n\nWe've been able to make ball runs, animals, houses/castles, huge rainbows, small world set ups... They stick to the fridge AND our doors so we use them in vertical ways too, like covering an entire door with them or seeing how far OUTWARD we can build before it's too heavy.\n\nThey're beautiful. The colors are vibrant, they're not sharp enough for the corners to hurt (as a mom of 3 boys I've seen the strangest things become WMD in this house), they match other brand sets of similar tiles, they're easy to spot AND easy to clean up (I just stack them together as I go since they stick together.)\n\nI haven't had this set for long, but I do have another set from the same brand (and a few other sets from other brands) and with daily, heavy use, we've had 2 tiles break in the last few YEARS. In both situations it was due to a grown man accidentally stepping on one while wearing boots. We use these a lot and they've managed to last through soooo much abuse.\n\nThis set is the perfect birthday gift for kids of any age. Once you start playing with them it becomes addictive and you'll want more and more so you can build bigger things. We probably have 400+ at this point and we never, ever run out of ways to use them. And this one comes with a booklet of ideas, and you can find tons of cool inspiration and creations with a quick search online. The possibilities are literally endless."
        },
        {
            "Date": "Reviewed in the United States on 2 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I have little grandsons ranging in ages 4 thru 10, and every one of them loves magnet tiles! I also work with elementary school children who are crazy about the magnet tiles at the learning center. Bottom line, magnet tiles are sure winners with children of all ages, and this particular large set is really great.\nWith most magnet tile sets you don't get the little magnetic cars, but this set has two. That along with the large quantity of quality tiles you get makes this set an easy 5 star winner. Well made with strong magnets that won't fall out, combined with the variety of shapes and bright colors makes this set one my grandchildren will totally enjoy adding to their collection. And I can rest assured they'll be safe playing with the pieces.\nIf you want to make a child happy, this set will do it. Totally giftable and the price is right."
        },
        {
            "Date": "Reviewed in the United States on 2 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "These really are fun"
        },
        {
            "Date": "Reviewed in the United States on 1 May 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "I love that this set comes with 100 pieces! It gives the builder the opportunity to basically build whatever they may want to. It's colorful and fun and the magnet strength is pretty good. It would make a nice gift for the little builder in your life."
        },
        {
            "Date": "Reviewed in the United States on 1 May 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Update 5/4/23\nThere are only 2 cars in this set, although picture 1 clearly shows 4 cars. I took screenshots of picture 1 & picture 6 to document the ambiguity. Picture 6 list all parts and states 2 for the cars.\n\nThis 100 piece Magnetic Tiles STEM Building Toy from Coodoo arrived quickly and in excellent condition.\n\nI am adding this to the other magnet tile sets I have ordered in the past couple of years. My grandsons, daughter and son-in-law love building with magnetic tiles. This is a great addition to my growing collection.\n\nI’m a bit confused about the listing page for this magnetic tile set because the 1st picture clearly shows 4 cars, but the 6th (last) picture list quantities of each piece and car is listed as ONLY 2 pieces. I ordered this for the 4 cars. I will update this review, when I open and assess the pieces.\n\nHighlights\n👍 Cross compatible\n👍 100 pieces, including 2 cars\n👍 Safe - sealed so magnets won’t fall out\n\nAt the time I ordered this 100 piece Magnetic Tiles STEM Building Toy from Coodoo, it was competitively priced at $50, but LUCKY YOU, at the time of this review, there is a 20% coupon. I am happy with this order and I highly recommend.\n\n🤗 Thank you so much for taking the time to read this review, have a FANTASTIC day!!😊\n\n4★"
        },
        {
            "Date": "Reviewed in the United States on 1 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The variety of tiles/pieces in this set is REALLY cool. It includes little snap in pieces so that you can create balconies and shadow boxes out of window panes as well as a variety of sizes and shapes (triangles, squares, crosses, etc.). Pieces stick together nicely and seem very sturdy. The box also included a drawstring bag to tuck all of the pieces in rather than having to leave them in the box, which was good since the box itself wasn't as sturdy as I would have hoped. Great set!"
        },
        {
            "Date": "Reviewed in the United States on 1 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great set of building toys. The magnets work well and you can build so many different things with them. The quality is very good. The magnets are strong. Arrived in perfect condition."
        },
        {
            "Date": "Reviewed in the United States on 1 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This is a great set of magnetic tiles. I have many sets of tiles, all from different companies. These have good and sturdy magnets, transparent colors, lots of different shapes and 2 things that set it apart from other sets.\n\nThis actually does have the 2 cars shown on the front of the box (not always the case) and there are 12 balcony pieces that can be snapped in and out of the pieces that are a square with a cut out square inside. None of my other sets have the balcony pieces.\n\nAlso included is a direction booklet with ideas for building, and a drawstring bag for storage. I actually just like to throw all my magnetic blocks in a large clear plastic bin with a cover on it. I only keep those that are compatible with each other (these are compatible!) and I pass the other sets on. Or I pass on the ones with weak magnets.\n\nThis is a great set at a very good price point. Highly recommend and would purchase again."
        },
        {
            "Date": "Reviewed in the United States on 1 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Magnetic tiles are a lot like Lego's in the fact that you can never have enough. This set comes with a substantial amount of basic building blocks as well as neat arches and windows. Pink is a color we had not come across. This set has it in several different pieces. Works fine with the other brands of magnetic tiles we already have, even if the sizes are a little different, they all still build. Main noticeable difference was that these don't have the metal grommet in the corners. Does not affect their build quality in any way."
        },
        {
            "Date": "Reviewed in the United States on 30 April 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "These blocks are amazing!!!! My 5 year old will play with them or hours!! We had a some before getting these but the 100 pack is the best deal! Sooo many hours of fun! They are well made and came quickly. Definitely will be purchasing more!!! Can't reccomend them enough!"
        },
        {
            "Date": "Reviewed in the United States on 27 April 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My kids really like this set. At 100 pieces it's the perfect amount for 1 kid to build with and can work for 2 kids if they share. As you can see from my photo my kids made a play enclosure for their stuffed animals so it is good sized. They also liked how it comes with 2 cars so they could each build one and have races. I liked how there are pretty flowers on the balcony pieces. All of the magnets are good quality with zero sharp edges so this would be suitable for younger children too."
        },
        {
            "Date": "Reviewed in the United States on 25 April 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My kids are 4 and 5 years old. They can't seem to get enough magnetic tiles. We originally bought what I think is the brand name tiles because they were the only ones we had ever seen. Eventually as we needed more tiles, we came across less expensive ones like these on Amazon. They all seem to work and last exactly the same. My kids do try to use the little \"car\" piece like roller skates, so that's about the only thing I'd say to watch out for. Otherwise, they can pretty much play with these unsupervised."
        }
    ]
}