{
    "Product Name": "Smart Plug WiFi Socket with RGB Light, Compatible with Alexa, Google Home (2 Pack)",
    "Product Image": "https://m.media-amazon.com/images/I/519WqvNDiNL._AC_SY450_.jpg",
    "Unique Key": "B0916RWMLL",
    "Reviews": [
        {
            "Date": "Reviewed in Australia on 28 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great little product, easy to connect to Alexia, you can control the lighting shades and colours super happy with this device. You will need to Download the Smart life app to set up the device but it's very easy. Feels good quality too, these was only a couple of devices it won't work with like my defuser as it needs to be turned on with its own switch but apart from that everything else works."
        },
        {
            "Date": "Reviewed in Australia on 22 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Easy to install, easy to use..."
        },
        {
            "Date": "Reviewed in Australia on 29 November 2022",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "A little difficult to initially set up. For me I have had to use the slightly more manual set up. But once connected to wifi there is no problem. Similarly needed a few attempts to link to Google Home. But once set up it works well. They are a great size and allow you to use all sockets on a multi plug."
        },
        {
            "Date": "Reviewed in Australia on 26 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Solid units, have not let me down to date, the RGB light is controlled separately so great for other automations such as garage door being left open etc."
        },
        {
            "Date": "Reviewed in Australia on 8 July 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Have been using them for a while now with multiple and different items connected, never had an issue they work well, best part is they fit in almost every socket just like a regular power plug fits. They do take a bit of time to set up, not overly difficult, have created a few routines with them.I'd rate them 4.5 stars though (If i could) as set up did take a little bit of learning, once you understand how they work though it's easy enough."
        },
        {
            "Date": "Reviewed in Australia on 3 May 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Another rubbish product\nJust does not work well end up throwing it away after persistence\nJust keep saying poor connection and cuts out while other brand woks well"
        },
        {
            "Date": "Reviewed in Australia on 21 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "These are great, much smaller than many other smart plugs so they can fit onto powerboards more easily."
        },
        {
            "Date": "Reviewed in Australia on 19 March 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Pros: Prompt delivery, item as described. Not too big and only takes up one plug space.\nCons: Could not download required app. From the literature provided this is a known issue, however the suggested work around is to download an alternative app that also was unable to download.\nEventually downloaded app on an old phone and \"shared\" with new phone in order to access. App has absolutely horrendous UI but have managed to get plug programmed. Have been unsuccessful linking plug with Google home.\nRecommend getting an alternate brand if you're not concerned about plug size."
        },
        {
            "Date": "Reviewed in Australia on 4 April 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "A little mucking about but pretty good."
        },
        {
            "Date": "Reviewed in Australia on 16 December 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Quality is good and work straight out of the box"
        },
        {
            "Date": "Reviewed in Australia on 20 May 2022",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "I bought a pack of 2. With the Smart life application the, the plugs works fine. The maximum brighness of the LED is not even nearly enough to call it a night lamp, as they advertise. But yes, it is a luminated rings, which looks nice on its own. With the google home app, one switch got divided into three segments. two of them is light and one plug. And even though you just tap to close the light, it will shut off the whole system. But With their own app, this works fine. If you are invested in google system already. this plugs are not for you. :)"
        },
        {
            "Date": "Reviewed in Australia on 17 February 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Written instructions in the box! Downloaded the App and then turned the plug on into pairing mode (hold power button 5 sec). Took a while but it paired, best to do this close to your router, especially if there's a software update like I had. Trick is to understand this is really two devices, a plug and a (circular ring) light. Need to name them differently to use voice commands. Worked straight up with Alexa. Can set up timers or a \"Scene\", which I did so that the light turned on/off with the plug (if/then commands). Android App has on/off widget which is great. Light isn't real bright, not as strong as a \"night light\". Can fit two side by side in Oz power point. Great device."
        },
        {
            "Date": "Reviewed in Australia on 2 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I even connected them to Google assistant and set a schedule to turn on the lights when I'm away. I was wary but the whole process was super intuitive and I love them.\nI don't use them when I'm at home because I don't want unnecessary wifi signals bouncing around the house."
        },
        {
            "Date": "Reviewed in Australia on 26 August 2023",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "VERY difficult to set up and instructions on box too small to read comfortably. Not clear from the start that you need to use the 2G network and then you have to check to see if your router can handle that and 5G simultaneously.\n\nI just wanted a device to switch two devices on at a certain time and off a few hours later and spent some time trying to set this up. I think I have succeeded with one but I need to push the little button on the side of the device to connect to the network and hence turn the heater on.....\n\nI suspect this means I still have not got the connection process correct.\n\nOne difficulty was that the language default was Mandarin(?) and despite changing to English and restarting, the device names remain in the original language - but most of the app text is english.\n\nAlso assumed that it would easily connect to ALEXA but they were not recognised. Then discovered when my network did connect them, that Alexa was irrelevant.\n\nSo altogether frustrating but it seems like a too much trouble to return them"
        },
        {
            "Date": "Reviewed in Australia on 4 June 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "I used the plug to turn on the fairy lights in our bedroom. Set it to turn on with the lamps and turn off on a 'Goodnight' routine. Works like a charm."
        },
        {
            "Date": "Reviewed in Australia on 10 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I'm always impressed with the speed of Amazon delivery. Though equally as good as this smart plug, it's synchronised my life a little more."
        },
        {
            "Date": "Reviewed in Australia on 8 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Easy to use. Handy timer"
        },
        {
            "Date": "Reviewed in Australia on 8 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Fantastic wifi plug"
        },
        {
            "Date": "Reviewed in Australia on 24 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Works well and looks cool"
        },
        {
            "Date": "Reviewed in Australia on 31 July 2023",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "I have had issues with these not responding.to alexa/google after a month or.so, they still work! I was just toggling them manually, our internet is a bit c**p though, so it could.be a reconnection issue rather than the item. They work fine otherwise :)"
        },
        {
            "Date": "Reviewed in Australia on 9 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Works great and came on time love them goes perfect with my echo 10"
        },
        {
            "Date": "Reviewed in Australia on 11 July 2022",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Really handy and use for terrariums and fish tanks where reliability really counts. Just wish manufacturers could design these things so they fit side by side on a power board. Can only use every second plug unless forced. Perhaps it's just Australian plugs. Just a few mm and these would be awesome"
        },
        {
            "Date": "Reviewed in Australia on 6 January 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I'd love if this device would 'just work' over the local network without the need for any internet access, however (as with many devices) it is Tuya / Smart Home connected, which means the app will work when your not at home, but also that you need active-internet for it to operate.\nHaving stated the above, this is my 5th device, I love the little ring-LED-light (although not as smooth in reality as picture, but still pleasant), and the hardware-button keeps it compact (but don't expect to stack multiple next to each other on a power board with access to the button for AU-plug type)"
        },
        {
            "Date": "Reviewed in Australia on 27 November 2021",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "First time user of these plugs and pleasantly surprised. Set up was easy and got these working on the phone app. Have yet to connect to my Alexa to appreciate the voice commands. Lots of colour choices (for night light?) but a simple green/red would have sufficed.\nStill learning the options but basic functions were easy. Will buy a couple of more for around the house."
        },
        {
            "Date": "Reviewed in Australia on 25 May 2022",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Love the led lights around it looks cool @ night and also good value for money , I use one of the plug for Nespresso coffee machine , with google assistance , works perfectly. Only down side it took bit of time to install for me anyway ."
        },
        {
            "Date": "Reviewed in Australia on 6 February 2022",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Overall a good product, have been using them for months.. the inital setup process can be a little painful. Was unable to sync them up using the so called \"EZ method\", only supports 2.4ghz so you may have to disable 5ghz on your router temporarily, save yourself the time and just pair up using the \"AP method\"."
        },
        {
            "Date": "Reviewed in Australia on 20 May 2022",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Not easy to install if you have dual band mesh wifi as you have to get your phone and the device on the 2.4g band but once you get past that it pretty much does what it says it will do."
        },
        {
            "Date": "Reviewed in Australia on 21 July 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Bought a couple to see how they went. Easy to set up and connect to Alexa. Will be buying many more as I keep thinking of other things I'd love to voice control in my home!"
        },
        {
            "Date": "Reviewed in Australia on 18 May 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "The advertiser does not tell you this will only work on old tech. It is not 5mhz wifi compatible it will supposedly only work on 2.4mhz. If you can’t dump down your wifi this is no good. Double checked their advertising specs and this is not mentioned anywhere."
        },
        {
            "Date": "Reviewed in Australia on 16 November 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Good value for the price"
        },
        {
            "Date": "Reviewed in Australia on 16 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Of all the smart plugs I have at home. These are the best, not due to function but due to their small size.\nThese do not take up extra space that prevents you from plugging something else next to it.\nHighly recommended."
        },
        {
            "Date": "Reviewed in Australia on 11 August 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "These plugs are great value for money. They are small enough to not get in the way of other plugs. These are not my first Tuya products but the setup was very easy as always. One good thing about the ring light is that it is controlled separately from the switch, but can be linked to the switch by creating an automation in the Smart Life app."
        },
        {
            "Date": "Reviewed in Australia on 28 November 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "As above - no problem setting up to work with Alexa (via their app) according to the instructions - I found that it can take a minute or so to connect, so don't decide it's not working too early. The plugs are small and fit on my power strip, and have LED light with adjustable colour and brightness."
        },
        {
            "Date": "Reviewed in Australia on 19 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I have been gradually \"alexifying\" the house... first lights now plugs. this works great and connects to Alexa to turn the heating on before I get out of bed on cold mornings"
        },
        {
            "Date": "Reviewed in Australia on 16 July 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Have been using these wi fi switches for several years. Very easy to set up & so convenient to install around the house to manage lights & other devices. Work reliably well via the Smart home app & also linked to Google home. Every home could benefit from these devices as part of 'home automation' project."
        },
        {
            "Date": "Reviewed in Australia on 4 July 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Easy to setup and install works well with ever increasing elec costs"
        },
        {
            "Date": "Reviewed in Australia on 7 April 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Better than meross ones as it takes less space in socket. Led makes it even better as a night light"
        },
        {
            "Date": "Reviewed in Australia on 17 April 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "These plugs are quite unreliable. Out of the 8 that I bought, one popped/smoked on me. They all heat up quite a lot. They also seem to let tiny amounts of power through. I bought these to completely turn off all the electronics in the room so that there would be no lights. However some of the LEDs in my electronics continue to stay on even if the plug is showing as off. I thought it may have been my electronics but I've since bought some zigbee smart plugs and all the LEDs turn off with these ones"
        },
        {
            "Date": "Reviewed in Australia on 22 May 2022",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "the manual and instructions are to small and very hard to read could have done a better fob of presenting the product the socket works ok and i like the led rgb lights"
        },
        {
            "Date": "Reviewed in Australia on 9 April 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Delivered the next day which surprised me and even more surprised me is the cute size and shape. Worked perfectly with Google Assistant & Home Apps and now I can switch the power on or off with the voice command or just a click on the phohe. Loving it!"
        },
        {
            "Date": "Reviewed in Australia on 12 April 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Well designed, so easy to instaill. The app controlled the power and the LED light, worked like a charm!\n\nAlso used the LED light as the nightlight with a schdule so it is on and off itself, and the RGB color is so beautful in the dark."
        },
        {
            "Date": "Reviewed in Australia on 12 March 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This plug is slim enough that you can install side by side on the double wall plug!"
        },
        {
            "Date": "Reviewed in Australia on 18 May 2022",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Works as indicated. Nice and small."
        },
        {
            "Date": "Reviewed in Australia on 12 January 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "It's easy to set up and works well with Google Home.\nLike the title says you can fit plugs in the next socket."
        },
        {
            "Date": "Reviewed in Australia on 30 January 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I bought 6 of these plugs because they fit into the socket and doesn't take up another socket space. After 8-10months, 2 are broken. So there's about 33% chance yours will fail in less than a year. Waste of money"
        },
        {
            "Date": "Reviewed in Australia on 29 March 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Easy to setup use and perfect for making home products smart"
        },
        {
            "Date": "Reviewed in Australia on 8 July 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Good value smart plug. Works great with Alexa. Used to turn bedroom TV off at wall because the standby light is too bright at night when just turning TV off with remote."
        },
        {
            "Date": "Reviewed in Australia on 9 April 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Easy to install used on table lamp"
        },
        {
            "Date": "Reviewed in Australia on 20 April 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "easy to setup, colorful ring and good size to fit into the power socket. turning on/off lights without moving my feet, scheduling power on/off devices, remote controlling with voice, very lovely product to have."
        },
        {
            "Date": "Reviewed in Australia on 2 August 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "These Wi Fi plugs are one of the best for value and are so easy to set up without any issues. They also work so easy with Alexa!"
        },
        {
            "Date": "Reviewed in Australia on 21 December 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Nice and small fits on multipu port sockets and works fine with Eco or Alexa"
        },
        {
            "Date": "Reviewed in Australia on 19 April 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Good, would recommend"
        },
        {
            "Date": "Reviewed in Australia on 5 February 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Took a little time to setup but these are used for our wax melt devices. I like that I can set timers to turn them off at night to save power and the melt scent lasts longer"
        },
        {
            "Date": "Reviewed in Australia on 1 September 2022",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Keeps turning off before scheduled time or fails to turn on when scheduled. I use it for my kids heaters and it’s been unreliable so far. Looking for a new brand."
        },
        {
            "Date": "Reviewed in Australia on 30 January 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "These plugs work well. If you want to use them with Apple Homekit you will have to set them up in the Tuya app and then set them up individually in Homebridge."
        },
        {
            "Date": "Reviewed in Australia on 26 November 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Very easy to operate compact and funky"
        },
        {
            "Date": "Reviewed in Australia on 31 October 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great for controlling lighting through Google Assistant"
        },
        {
            "Date": "Reviewed in Australia on 13 September 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Have plenty of these - work well and connect quickly"
        },
        {
            "Date": "Reviewed in Australia on 3 January 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "These items no longer have support with Amazon Alexa. Unfortunately, the advertising was wrong."
        },
        {
            "Date": "Reviewed in Australia on 26 August 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Easy setup and value for money when on special"
        },
        {
            "Date": "Reviewed in Australia on 7 May 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Work well with Alexa, small problem setting up, had to use the advance mode."
        },
        {
            "Date": "Reviewed in Australia on 23 December 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I like this product. It is amazing because it is lightning and wifi smarting. Very convenient for home smart. I recommend it."
        },
        {
            "Date": "Reviewed in Australia on 7 April 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I love the LEDs on them they work very well and are easy to use"
        },
        {
            "Date": "Reviewed in Australia on 12 August 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great way to automate many items."
        },
        {
            "Date": "Reviewed in Australia on 23 July 2022",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "These are pretty difficult to setup in the first place. Once I had them all connected they were a little flaky with often going offline. Then one day they just stopped connecting to the Wifi at all.\nHave wasted hours trying to get them to work and now given up. Too unstable, would not recommend."
        },
        {
            "Date": "Reviewed in Australia on 20 August 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Easy to use"
        },
        {
            "Date": "Reviewed in Australia on 10 October 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This device is great, easy to install, you can use voice control or the app."
        },
        {
            "Date": "Reviewed in Australia on 11 June 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "👍👍👍"
        },
        {
            "Date": "Reviewed in Australia on 28 July 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Will not connect to 2.4GHz wifi.\nUseless."
        },
        {
            "Date": "Reviewed in Australia on 14 November 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Easy to connect. Fast delivery and value for money. Will definitely purchase more"
        },
        {
            "Date": "Reviewed in Australia on 26 January 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The product worked as advertised."
        },
        {
            "Date": "Reviewed in Australia on 8 March 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "could not get them to connect to wifi at all"
        },
        {
            "Date": "Reviewed in Australia on 14 July 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Easy to install"
        },
        {
            "Date": "Reviewed in Australia on 8 July 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Works perfect."
        },
        {
            "Date": "Reviewed in Australia on 5 May 2022",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "One worked okay and one fails to be setup.please contact me to have this faulty one replaced for a refund?"
        },
        {
            "Date": "Reviewed in Australia on 5 February 2022",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Followed all the 8nstructions and have the right WiFi but even after numerous resets and attempts niether plug is connected"
        },
        {
            "Date": "Reviewed in Australia on 13 January 2022",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Tried to sync it as per instruction! no result, such a waste of money and time!!"
        },
        {
            "Date": "Reviewed in Australia on 21 January 2022",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "doesn't connect to 5ghz and 2.4 connection doesn't even work"
        },
        {
            "Date": "Reviewed in Australia on 11 November 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great socket. Does what it should. Must admit that I bought it as a sacrificial item to see if it was easy to open and Tasmota. Is is NOT at all and some unnecessary force was involved and I ruined it. :)\n\nIf you're not looking to hack it, it's fine! You can stare all day at the pretty colours and fiddle with them with the app."
        },
        {
            "Date": "Reviewed in Australia on 13 October 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This product is so easy to setup and use. It took around 15 minutes to setup both plugs to Alexa. Now I don’t have to lean and stretch over the lounges to turn on/off the lights. My back says thank you Smart Plug. I should have thought of doing this earlier."
        },
        {
            "Date": "Reviewed in Australia on 7 December 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I bought this for my partner, now she loves them. I highly recommend them."
        },
        {
            "Date": "Reviewed in Australia on 24 September 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "It. Was the ease of use from unboxing to installing to use and connection"
        },
        {
            "Date": "Reviewed in Australia on 17 May 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Just what I wanted with fast delivery Thanks"
        },
        {
            "Date": "Reviewed in Australia on 27 January 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I got this smart plug to program my Christmas lights in my home...\n\nIt was quite simple to connect to my house wifi and set an on/off timer for all of my Christmas lights; also, I can monitor and adjust on/off status from anywhere at any time, which is extremely helpful...\n\nAlexa (and other applications) can also control it, which is a nice feature for when I want to switch on or off all the lights sooner or later...\n\nThe RGB light on the plug can be altered to other colors or turned off, but I kept it on to use as a night light."
        }
    ]
}