{
    "Product Name": "Lip Smacker Coca-Cola Flavored Balm, 8 Count, Flavors Coke, Cherry Vanilla Sprite, Root Beer, Orange Fanta, Grape Strawberry Fanta",
    "Product Image": "https://m.media-amazon.com/images/I/71IRptDkCRL._AC_SX679_.jpg",
    "Unique Key": "B00CXK623E/",
    "Brand": "Lip Smacker",
    "Reviews": [
        {
            "Date": "Reviewed in Australia on 12 November 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I love these. I bought them for me and I use them all the time. I’m in the wind a lot and need to protect my lips. I have a couple to friends. I use them whenever I want something sweet. It’s almost necessary for the dieters. Love."
        },
        {
            "Date": "Reviewed in Australia on 15 November 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "These are great stocking fillers. My daughter loves them."
        },
        {
            "Date": "Reviewed in Australia on 24 September 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Im loving these lip balms"
        },
        {
            "Date": "Reviewed in Australia on 4 August 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great product and fast delivery. Highly recommended"
        },
        {
            "Date": "Reviewed in Australia on 13 January 2022",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Lip smackers are good quality and leave a nice smell and taste but not overly hydrating"
        },
        {
            "Date": "Reviewed in Australia on 10 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great value pack. Love all of these flavours"
        },
        {
            "Date": "Reviewed in Australia on 29 July 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great product, flavors are amazing! And very real."
        },
        {
            "Date": "Reviewed in Australia on 9 June 2019",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "All good. Product arrived quickly and as promised."
        },
        {
            "Date": "Reviewed in Australia on 13 December 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "These cola lip balms smell scrumptious"
        },
        {
            "Date": "Reviewed in Australia on 14 March 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "These lip balms taste just great and teens love them. They do a great job caring for lips"
        },
        {
            "Date": "Reviewed in Canada on 11 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Bought this multi-pack of Coca-Cola flavored lip balm as a gift for my kids and ended up stealing them for myself! Brings me back to the days of my youth and makes me really want a Coke. Addictively delicious and keeps my lips feeling smooth and refreshed."
        },
        {
            "Date": "Reviewed in Italy on 15 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Buono"
        },
        {
            "Date": "Reviewed in Germany on 27 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Alles wie erwartet."
        },
        {
            "Date": "Reviewed in the United Kingdom on 4 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Handy"
        },
        {
            "Date": "Reviewed in India on 8 December 2018",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "It was amazing I would definitely purchase another one , must buy"
        },
        {
            "Date": "Reviewed in France on 2 October 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Le colis est arrivé avec plus d’un mois de retard et d’an cet état…"
        },
        {
            "Date": "Reviewed in the United States on 23 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I have been using lip smackers since I was a child. I have them ( no exaggeration) in every room, of my home, in my car, in my backpack. I have used them every day for a lot of years. Same great quality, better flavors than any other brand of lip ointment. Keeps my lips soft and supple all day. I highly recommend this pack if you love soda. The coke really smells like coke, and the other flavors smell just like the name on them. Great value, less than what I pay in stores."
        },
        {
            "Date": "Reviewed in Spain on 30 March 2018",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Muy buenos, me encantaron, humectan los labios, su fragancia es tal cual la cubierta que tienen, lo volvería a comprar"
        },
        {
            "Date": "Reviewed in India on 28 June 2018",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "its superb know words to say about it"
        },
        {
            "Date": "Reviewed in Germany on 5 September 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Alles gut"
        },
        {
            "Date": "Reviewed in Canada on 17 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The Lip Smacker Coca-Cola lip balms are truly special with their unique soda flavors. It's so fun to have my favorite pop flavors in a lip balm! They not only taste great but are also priced well and of excellent quality. My lips feel soft and moisturized, and I love the nostalgic, refreshing taste each time I use them. Highly recommended for anyone who loves a fun twist on lip care!"
        },
        {
            "Date": "Reviewed in Mexico on 11 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Son muy agradables y si lubrican muy bien los labios."
        },
        {
            "Date": "Reviewed in Italy on 4 April 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Sembra di bere una bibita"
        },
        {
            "Date": "Reviewed in India on 27 March 2018",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "It’s perfect."
        },
        {
            "Date": "Reviewed in the United States on 30 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "These have been around since I was a kid. My school aged granddaughter loved them as much as I did. 🙂"
        },
        {
            "Date": "Reviewed in Mexico on 23 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Los he regalado por separado y agradan mucho, huelen y saben a lo que dice, pero no son tan buenos para hidratar"
        },
        {
            "Date": "Reviewed in Germany on 16 February 2021",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Preis etwas teuer"
        },
        {
            "Date": "Reviewed in the United Kingdom on 2 January 2022",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Was part of Christmas present for 11 year old ; got it spot on as she loves it"
        },
        {
            "Date": "Reviewed in India on 11 January 2017",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "very good"
        },
        {
            "Date": "Reviewed in Germany on 14 December 2020",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Top Ware"
        },
        {
            "Date": "Reviewed in Canada on 20 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "J’utilise les baumes à lèvres lips smacker depuis l’adolescence et j’ai jamais été déçues. Leur goût et odeurs demeurent longtemps. De plus, elles laissent mes lèvres toutes douces."
        },
        {
            "Date": "Reviewed in the United Kingdom on 20 March 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Very poor quality, product already open, looks old and used. Would not recommend"
        },
        {
            "Date": "Reviewed in Canada on 23 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Still love lip smackers for myself but this package says 13+ recommended age so either theres a story there or some of the ingredients are not ideal for the younger group. Either way these were a gift for a younger girl so returning and not repurchasing until I do a bit more research."
        },
        {
            "Date": "Reviewed in Mexico on 30 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Huelen muy bien, te ayudan con los labios agrietados."
        },
        {
            "Date": "Reviewed in the United States on 10 May 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "I recently tried the Lip Smacker Coca-Cola Flavored Balm set, and overall, I'm quite pleased with it. Here's a breakdown of my experience:\n\nPros:\n1. **Fun Assortment**: I love the variety of Coca-Cola flavors included in the set. It's a fun way to switch up my lip balm flavor.\n2. **Hydrating & Protecting**: The lip balms are very moisturizing and provide great protection against dry lips.\n3. **Vegan**: As a vegan, I appreciate that these lip balms are cruelty-free and vegan-friendly.\n4. **Compact & Portable**: The small size makes them perfect for carrying in my purse or pocket wherever I go.\n\nCons:\n1. **Scent Overpowering**: While I love the scent of Coca-Cola, I found that the scent of the lip balms can be a bit overpowering at times.\n\nOverall, I would recommend the Lip Smacker Coca-Cola Flavored Balm set to anyone looking for a fun and moisturizing lip balm option. Just be aware that the scent can be quite strong."
        },
        {
            "Date": "Reviewed in the United States on 1 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Son más grandes de lo que imaginé y saben idéntico"
        },
        {
            "Date": "Reviewed in Germany on 30 April 2023",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "most of them are disgusting, BUT fanta is pretty nice, trust me on this one."
        },
        {
            "Date": "Reviewed in Canada on 11 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I got Marvel Avengers ones, the classic and new faves plus this. It’s gonna last me a good year or so. Maybe 2-3 years!\n\nI would rather pay this much and get all yummy types instead of regular Lipsyl boring ones from the dollar store. It’s good, but boring.\n\nThese are tasty and they don’t change your lips to colours!\n\nMy future wife is gonna love em! Heheheh"
        },
        {
            "Date": "Reviewed in the United States on 3 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I’ve bought before great product"
        },
        {
            "Date": "Reviewed in Germany on 23 March 2021",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Nicht so ganz toll, ... riechen gut aber schwach."
        },
        {
            "Date": "Reviewed in Canada on 21 February 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "So I'm a very picky person when it comes to chapstick. I've tried to many of them and living where I do, it's super expensive. I was a bit nervous to try these as I hadn't used them since I was super super young but I am super surprised and pleased. The scents smell super good. Now the chapstick itself, has my lips feeling super soft and I don't find myself wanting to reapply it every 5 seconds or find my lips feeling bumpy or anything. I love these lip balms alot and will definitely find myself buying more in the future. I recommend these no matter what age you might be. Also, I ordered these ones and a pack of the hello kitty ones and they all arrived safe and sound and I recommend that pack to"
        },
        {
            "Date": "Reviewed in the United States on 16 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I love these so much. The flavors are so fun! I am in love with the \"Fanta\" flavors. I love the \"Coca Cola\" flavors and the \"Sprite\". These give plenty of moisture. I wish 'Dr. Pepper\" would make a return. I miss that particular balm so much with its blush of color. These flavors are fun, never boring. I have bought so many of these packets. I have gifted them to my kids, my grandkids....myself. I have some as backups...just in case... Worth every penny!!!!!"
        },
        {
            "Date": "Reviewed in the United States on 16 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "t love the flavior. i wish you have more flavior. you can give for birthday or party."
        },
        {
            "Date": "Reviewed in the United States on 27 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I bought these as stocking stuffers for my bigger kids. Im always looking for something different and fun for stockings. I separated them between stockings.Since we do so many stockings but they could be used as a small gift idea."
        },
        {
            "Date": "Reviewed in the United States on 20 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Well worth the money I spent! The Root-Beer and Fanta's are the strongest smell. Vanilla Coke is weaker in smell and flavor, but it has a hint of the original flavor. Cherry Coke smells and tastes like itself, but a little weaker. Coke Original confused me. Sprite had no scent to me, and the flavor was there."
        },
        {
            "Date": "Reviewed in the United States on 17 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Esta marca nunca decepciona! Me encanta"
        },
        {
            "Date": "Reviewed in Mexico on 22 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Tienen buen aroma"
        },
        {
            "Date": "Reviewed in the United States on 13 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I love the taste of the flavours."
        },
        {
            "Date": "Reviewed in the United States on 10 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Has a variety if soda flavors and al of them smell good."
        },
        {
            "Date": "Reviewed in the United States on 9 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I absolutely adore the Lip Smacker Coca-Cola Flavored Balm set! From the moment I opened the package, I was hit with nostalgia and excitement. Each lip balm smells exactly like the fizzy drinks we all know and love, and the flavors are spot on!\n\nNot only are these lip balms fun and cute, but they also do wonders for my lips. They're incredibly moisturizing and hydrating, leaving my lips feeling soft and smooth all day long. Plus, knowing that they're vegan makes me feel even better about using them.\n\nThe assortment of flavors is fantastic, offering a variety of options to suit any mood or craving. Whether I'm in the mood for classic Coca-Cola or a refreshing Sprite, there's a lip balm for every occasion.\n\nOverall, I couldn't be happier with this purchase. The Lip Smacker Coca-Cola Flavored Balm set is a must-have for any lip balm enthusiast or Coca-Cola fan. Highly recommend!"
        },
        {
            "Date": "Reviewed in the United States on 17 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "You know the one! The one they discontinued! One of these is close in flavor so I can handle that. lol. The other flavors aren’t bad and do the job here in Arizona. Would buy again."
        },
        {
            "Date": "Reviewed in the United States on 17 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "They tasted just like they were described. They were so wonderful of putting moisture onto our lips will order again"
        },
        {
            "Date": "Reviewed in the United States on 26 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "They taste like the soda pops."
        },
        {
            "Date": "Reviewed in the United States on 20 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I love lip smackers in general and then soda ones are my very favorite."
        },
        {
            "Date": "Reviewed in the United States on 29 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Been using these for a number of years. Smooth application. Love the flavors. Prefer these to Chapsticks that apply thick waxy coat and drag over my lips when applying. These go on smoothly. SO likes them too."
        },
        {
            "Date": "Reviewed in the United States on 1 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Seriously, I've been addicted to lip balm for decades now. I have tried a million different brands, flavors and types- beeswax, lanolin, everything. Lip Smacker is my absolute favorite brand and this package is my absolute favorite go-to for great lip balms. All the flavors rock, and this package is an incredibly good variety of the best of the best. Only Walmart has it at the same price point if it's in stock. Coca-Cola, Dr Pepper and Grape are my fave of faves, but I love all of them. There is no bad flavor in this pack. I but several packs a year and have it on subscription. In fact last year, Amazon kept telling me it would ship late or be unavailable, so I asked my office boss for Lip Smackers in my stocking (she does stocking stuffers every year), I saw a pack in stock at Walmart and got it, just in case, and the next day my Amazon subscription miraculously arrived. I got 3 of these packs in 2 days! I was over the moon! That'll hold me for six months. LOL! For real, I am obsessed with Lip Smackers and this pack in particular. Absolutely freakin' recommended!"
        },
        {
            "Date": "Reviewed in the United States on 16 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Got them for my daughter and she absolutely loves all the flavors"
        },
        {
            "Date": "Reviewed in the United States on 7 April 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I read all the reviews and a few said that these Lipsmackers burned their lips. I was hesitant but wanted to try flavored lip balm and this was a brand a remembered from my childhood. (Plus I like the smell of Chapstick brand but the taste is awful to me). So I took a chance and learned a little more after getting them. 1st thing was the smell and taste is awesome and spot on! It's like a lingering taste of crisp Coca-Cola on your lips, the fruit ones are on pointe as well. I found myself constantly smacking my lips (hence the name! lol) as it was a neat surprise that the flavor and smell stays longer than 5 minutes.\n\nWell one night after using them and smacking my lips all day, I had settled down to watch a movie. Then my upper lip started tingling. At first I was thinking that they were right, it does have a slight tingling sensation, then I realized that I'd been licking at my lips all day, and sat down to a bowl of salty popcorn. My lips were extra sensitive from playing with them all day with the Lipsmackers and the salt cause a slight irritation! Later on, no more tingling, and that's only because I had made my own lips tender by going overboard being amazed at how much they tasted like the soda they represented.\n\nMy lips have been smoother and I have cut down on licking my lips all day when I use this balm! I'm glad I tried, and now I realize that the people said it was \"burny\" might just have done the same thing I did, licked their lips like crazy then had some salt or vinegar, some food substance that caused a little irritation. ***At least for me, I know it was my own fault and not the Lipsmackers!***\n\nIn the future, I would definitely get these again! I'm saying bye-bye to my long history of being chained to Chapstick and back to where I was when I was a kid, the world of yummy tasting Lipsmackers! :D (My favorites are the Coca-Cola, Fanta Strawberry and Root Beer: You'll be amazed at how much they smell and taste like the soda they represent!)"
        },
        {
            "Date": "Reviewed in the United States on 15 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I have been using Lip Smackers since they were first introduced in the early 70's. They absolutely revolutionized lip care! (Ok, maybe I am overstating it, but for it did!) I have always suffered from dry lips, and after just a few times of them getting so dry and cracked bits were peeling painfully off of my lips, I knew I had to change something. I've tried Chapstick (too waxy), I've tried EOS (too awkward), I've tried Burt's Bees (taste funny), I've tried Carmex (too greasy and comes off too easily), and...the list goes on. Lip Smackers are my absolute go-to--and sooooo many fun flavors and scents. They offer a light gloss that I can wear over my lipstick, or just on it's own. I literally have one in every room of my house! They last a long time, aren't waxy, smell great, and are fun! After using Lip Smacker for 51 years, I ain't gonna stop now! Oh, and the Dr. Pepper is my absolute favorite!"
        },
        {
            "Date": "Reviewed in the United States on 11 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "These worked great a stocking stuffers and she loved all the flavors"
        },
        {
            "Date": "Reviewed in the United States on 2 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I got these solely for the novelty. My husband lovingly teased me for them when the pack first showed up, but it's become a game for him now over the last few weeks to guess which flavor I have on and it's adorable. They work well, too. I do not like putting most things on my skin or lips, I don't touch most name brand balms, but these are actually nice."
        },
        {
            "Date": "Reviewed in the United States on 18 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I bought this pack for my 30 yr old daughter for Christmas as a throwback to her childhood. She loved it. It was very inexpensive but brought joy and fond memories of years gone by."
        },
        {
            "Date": "Reviewed in the United States on 15 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "We are I love with these flavors and it smells just like it should. It’s amazing and I will definitely get these again. Well worth my money if I could give it more stars, I would."
        },
        {
            "Date": "Reviewed in the United States on 14 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My kids LOVE soda and only get to drink it every once in a while as a special treat. I thought they'd like this flavored chap stick and so I divided the package evenly between my boys (ages 7 and 4) and put it in their stockings as a last-minute addition. Let me tell you - this was the sleeper hit of Christmas. The boys went NUTS over these, comparing the flavors they got. They designated special spots where they store their chap sticks, and they negotiate borrowing each others' flavors. Here we are - nearly two months after Christmas - and I'm writing this review because they are STILL raving over this gift. Don't think about it, just get this for your kids. It's an inexpensive gift that is most definitely worth every penny!"
        },
        {
            "Date": "Reviewed in the United States on 4 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I love it. very happy."
        },
        {
            "Date": "Reviewed in the United States on 3 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I searched high and low in my area for lip smackers! It's a brand that is the absolute best in my opinion! They go on smoother and last longer than anything I have ever tried! Shipped fast and I will continue to order from this vendor."
        },
        {
            "Date": "Reviewed in the United States on 26 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Like all of the flavors"
        },
        {
            "Date": "Reviewed in the United States on 21 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Es mi favorito me encantó, amo todo lo de Amazon"
        },
        {
            "Date": "Reviewed in the United States on 21 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great lip balm!"
        },
        {
            "Date": "Reviewed in the United States on 27 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I am an adult who absolutely has to wear chapstick everyday hahaha and no one beats lipsmacker!!! These chapsticks smell sooooo good and they are super soft on your lips. Your lips feel like silk after applying it and they go on extremely softly as well. And I love the fact that none of them actually leave a bright or bold color on your lips, they just leave a beautiful shine! It doesn't matter If the chapstick itself is pink, purple, or brown- it will only leave a silky shine on your lips so they match any outfit and any make up style. Highly recommend them!!!!!"
        },
        {
            "Date": "Reviewed in the United States on 14 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Can’t go wrong with lip smackers — they’re a classic!"
        },
        {
            "Date": "Reviewed in the United States on 10 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I absolutely love lip smackers"
        },
        {
            "Date": "Reviewed in the United States on 4 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My honey enjoyed the lip bomb. He likes to smell the taste in the feel."
        },
        {
            "Date": "Reviewed in the United States on 6 July 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "I didn't use it. Gift that was well received"
        },
        {
            "Date": "Reviewed in the United States on 28 January 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "My kid loves the smell of these (or perhaps the idea). We live somewhere dry, and they have helped her get in the habit of using chapstick more often."
        },
        {
            "Date": "Reviewed in the United States on 21 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I’ve been using this gloss since the 1970s. It’s one of the few brands that doesn’t dry out my already-dry lips. Love the range of subtle colors and flavors. Delivered promptly with enough tubes that I can carry one in my purse, put one in the car, and one in the nightstand. Great product!"
        },
        {
            "Date": "Reviewed in the United States on 16 February 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "It was a Christmas gift. She liked it."
        },
        {
            "Date": "Reviewed in the United States on 14 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My granddaugther loves them all. I put them in her Easter basket"
        },
        {
            "Date": "Reviewed in the United States on 2 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "These are my childhood memories, I’m 47 and I still look for these lip balmers. They smell the same and taste great."
        },
        {
            "Date": "Reviewed in the United States on 28 January 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "the kids and grandkids really liked these."
        },
        {
            "Date": "Reviewed in the United States on 16 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Plain and simple; gifted and loved the flavors. As a friend to the one gifted, I did not kiss or taste! Price - up to you guys."
        },
        {
            "Date": "Reviewed in the United States on 3 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "We bought this set as party favors for my daughter’s birthday. Her friends loved them!"
        },
        {
            "Date": "Reviewed in the United States on 8 January 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Used them for stocking stuffers and they went over well."
        },
        {
            "Date": "Reviewed in the United States on 29 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My kids absolutely love these. This pack comes with an awesome variety of soda flavors. I tested each one of them for possible \"poisoning\" before handing them over to the kids (my oldest wasn't amused)."
        },
        {
            "Date": "Reviewed in the United States on 7 January 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "I ordered these weeks before Christmas they didn't arrive in time. Super cute though!"
        },
        {
            "Date": "Reviewed in the United States on 17 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I love these chapstick lipsmackers!\nGreat smells , colors and long lasting moisture.\nPleasant taste. Very slightly sweet."
        },
        {
            "Date": "Reviewed in the United States on 25 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I decided this year to buy my two nieces backpacks and then fill those backpacks up with little gifts that I found for them. Aria has been going through a massive candy phase (due to her having braces) and I just so happen to take my responsibility as an auntie extremely seriously (as one should) she absolutely loves these Coca Cola flavored chapsticks!"
        },
        {
            "Date": "Reviewed in the United States on 8 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This balm is a refined combination of soda and petroleum-based balm. It tastes delicious, all while soothing chapped, irritated lips. Whether climbing Everest or sitting in a 9th grade science class, I highly recommend this balm."
        },
        {
            "Date": "Reviewed in the United States on 1 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Perfect for stocking stuffers"
        },
        {
            "Date": "Reviewed in the United States on 2 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "excelente producto"
        },
        {
            "Date": "Reviewed in Canada on 16 February 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "The orange fanta, and vanilla coke dont taste too accurate but still taste really good. Root beer is very accurate aswell as the rest"
        },
        {
            "Date": "Reviewed in the United States on 18 November 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Ah, the Soda Lip Smackers lip balm is like a trip down memory lane! It's got these amazing soda flavors that totally take me back – cola, root beer, and orange soda. The scents are spot-on, like I've just cracked open a can. Plus, it keeps my lips soft and moisturized, making it a fun and tasty way to take care of them. If you're into sodas, this lip balm is a must-try!"
        },
        {
            "Date": "Reviewed in the United States on 29 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "We first saw this set at a Coke store in Orlando. We were happy to find online at a great price. My kids love these and keep a few in their pencil pouch at school."
        },
        {
            "Date": "Reviewed in the United States on 22 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Lip Smacker Coca-Cola Flavored Balm, 8 Count, Flavors Coke, Cherry Vanilla Sprite, Root Beer, Orange Fanta, Grape Strawberry Fanta Great for kids"
        },
        {
            "Date": "Reviewed in the United States on 18 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Son perfectos, cumplen con su función y es extremadamente divertido escoger entre sus aromas y diseños. Es un excelente regalo e igualmente para compartir."
        },
        {
            "Date": "Reviewed in the United States on 26 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Kids love it. Taste a little waxy for adults."
        },
        {
            "Date": "Reviewed in the United States on 12 March 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Creo que los sabores son idénticos a las sodas pero si los quieres para humectar los labios no funcionan muy bien la verdad ni los uso"
        },
        {
            "Date": "Reviewed in the United States on 24 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "So many chap sticks feel like candle wax! Not Lip Smackers! They go smooth and stay that way. I love all the flavor packs they sell. This one has different soda scents and I love them all! I hope they never stop making these!"
        },
        {
            "Date": "Reviewed in the United States on 19 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Smells great, and really helped my lips!"
        },
        {
            "Date": "Reviewed in the United States on 11 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The kids loved them!"
        }
    ]
}