{
    "Category": "Amazon",
    "Product Name": "Apple Watch SE (2nd Gen) [GPS 40mm] Smartwatch with Starlight Aluminum Case with Starlight Sport Band S/M. Fitness & Sleep Tracker, Crash Detection, Heart Rate Monitor",
    "Product Image": "https://m.media-amazon.com/images/I/61wjDV8p6PL._AC_SX466_.jpg",
    "Unique Key": "B0CHX7R6WJ",
    "Clean URL": "https://www.amazon.com/Apple-Smartwatch-Starlight-Aluminum-Detection/dp/B0CHX7R6WJ",
    "Brand": "Apple",
    "Average Star": "4.6 out of 5",
    "Reviews": [
        {
            "Date": "Reviewed in the United States on August 20, 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "My watch can barely hold a battery for 1 day and I don’t even use it that often! So not happy with it at all. I have several other Apple products and they have been great but not the watch."
        },
        {
            "Date": "Reviewed in the United States on August 20, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "My daughter does not have a phone and this watch won't work for family sharing. I didn’t know this when purchasing (it doesn’t say this anywhere on the listing). I'm now out a lot of money because the return window closed before I was aware of the issue. Very unhappy about this."
        },
        {
            "Date": "Reviewed in the United States on August 20, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Very disappointed in this watch. It will not hold a charge over 18 hrs. I missed the window of return as too busy and slacked. But ver disappointed. Also the time to return was less then 15 days."
        },
        {
            "Date": "Reviewed in the United States on August 20, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Do not purchase from this seller. The iwatch was for my daughter’s birthday gift and it doesn’t work. Her bday is a fail thanks to this seller who made it impossible to get a refund. I will be taking this to court if I do not get refund."
        },
        {
            "Date": "Reviewed in the United States on August 20, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "There is nothing more to write about this watch. This js the industry standard. Having said that, if the battery life had just been a little more, it would have been unparalleled."
        },
        {
            "Date": "Reviewed in the United States on August 20, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "This is device number two I have bought from Amazon that, after powering it on, found was activation locked. My expectations of a preowned device is that it actually has a use. This is just a brick. Apple won’t unlock it. Just going to a landfill like many others I suspect. Seems like that goes against Amazon Renewed mantra to me. Apple should also have some better way to manage this."
        },
        {
            "Date": "Reviewed in the United States on August 20, 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "I may have missed it in the reading but this DOES NOT come with a charge cube We bought one and it doesn’t charge fully and dies mid day Hopefully it’s just mine but beware for this price I should have bought in store"
        },
        {
            "Date": "Reviewed in the United States on August 19, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Apple Watch was locked and it’s been hell trying to return it since the day I got it"
        },
        {
            "Date": "Reviewed in the United States on August 19, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Purchased this as a gift for my adult daughter who had recently became a runner. Was skepticle since it was used, but she has had no issues at all and she's had it for a year. Keeps a great charge as well!"
        },
        {
            "Date": "Reviewed in the United States on August 19, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "I purchased this watch as a gift for my husband. He was using the fitness features on a Fit Bit, but the data on the device was too small for him to see. He seems to like this one pretty well. The only complaint we had was the size of the watch band. It was terribly small and had to be replaced with a larger one. That is why I rated the watch 4 stars instead of 5. I got a good deal on the watch, so having to purchase another band was not a deal breaker."
        },
        {
            "Date": "Reviewed in the United States on August 19, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Bought it for prime day I wear it through the day and it dies it doesn’t last a whole day mind you I’m not using it 24/7 at all. Very disappointed because the return window is closed so I can’t send it back"
        },
        {
            "Date": "Reviewed in the United States on August 19, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Unfortunately you need iPhone or you can't set it up. So it doesn't work for me."
        },
        {
            "Date": "Reviewed in the United States on August 19, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "It's an entry-level Apple Watch that I bought to determine whether watches were for me. It's pretty impressive. The main downsides I have noticed are that the battery doesn't last very long and the sport loop is very, very itchy."
        },
        {
            "Date": "Reviewed in the United States on August 19, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I bought brand new apple watch SE only 15 days now it doesn’t charge\nTry follow instructions help but doesn’t help\nVery disappointed"
        },
        {
            "Date": "Reviewed in the United States on August 19, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "May apple watch, series 1, died about six weeks ago. It had given me top notch service. I was going to buy a refurb, but my son, an IT, steered me to this option. It has been working perfectly, and at a fraction of the cost of even a refurb series 6-7-8-etc. that I was finding online. This watch, for me, is worth the price I paid."
        },
        {
            "Date": "Reviewed in the United States on August 19, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Came on time , it is brand new and came in apple box"
        },
        {
            "Date": "Reviewed in the United States on August 18, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I love all the features. Mainly love the health features."
        },
        {
            "Date": "Reviewed in the United States on August 18, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I tried a few much less expensive smart watches, but after experiencing various problems with incorrect recording of activity and calories burned etc I decided to just get an Apple watch. So glad I did. This watch functions with great accuracy and no weird glitches. The only negative is the shorter battery life compared to other watches. I just make sure to charge it while sleeping and if I forget it only takes an hour or two to get a full charge."
        },
        {
            "Date": "Reviewed in the United States on August 18, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "This is a fake Apple Watch do not buy!"
        },
        {
            "Date": "Reviewed in the United States on August 18, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Went with the cheaper version and my wife loves it. Comfortable and stylish plus it does so much. Much better than all the other workout trackers available. Plus you get all the other functions available with the I-watch."
        },
        {
            "Date": "Reviewed in the United States on August 18, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Very happy with my watch. Switched from a Fitbit flex to this guy and wow and I’m impressed! Wish the battery held longer as I want to track me sleep and not charge over night. I did buy additional charging cords (generic off Amazon) and they work great."
        },
        {
            "Date": "Reviewed in the United States on August 18, 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Unfortunately this item did not work for me. Wouldn’t hold a charge and was much more complicated than I thought it would be. I guess my biggest disappointment is having to wait 30 days for a refund which I still haven’t received. I returned it 3 days after I received it."
        },
        {
            "Date": "Reviewed in the United States on August 18, 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "I have used other smart watches and they compare to apple with all their apps.\nThe problem with this watch is that you have to charge it every day. There are smart watches that have batteries lasting for 5 days."
        },
        {
            "Date": "Reviewed in the United States on August 18, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I have had the watch for two weeks and it won’t charge."
        },
        {
            "Date": "Reviewed in the United States on August 18, 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "This product came with no clear plastic seal…the inner boxes were still sealed though. This just makes me wonder if this product is actually legit or brand new"
        },
        {
            "Date": "Reviewed in the United States on August 17, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Very useful for my busy life"
        },
        {
            "Date": "Reviewed in the United States on August 17, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Despite product descripton, this watch had no cell service functionality and it is too late to return by the time we figured it out"
        },
        {
            "Date": "Reviewed in the United States on August 17, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I thought that i would save money buying an Apple Watch from Amazon. The watch arrived on schedule but i bought the SE version, which was too small. Had trouble viewing what was on the screen. As i began the return process, i realized that the watch wouldn’t even charge. I think the watch had been refurbished . Waste of time and money. - Star"
        },
        {
            "Date": "Reviewed in the United States on August 17, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Bought this to replace a Fit Bit, and purchased at a great price during Prime Days. Went to the Apple store for a free class and discovered that our teacher had the same watch. I don't need all the fancy things a watch can do these days - but at the right price, this is the same price as a Fit Bit and does so much more. My watch doesn't have cellular capability, so the phone has to be within 30-40 feet - but if I'm busy I can answer calls on it! Read messages, emails, keep track of steps, sleep; easily change watch faces to match mood or outfit. And, I can see the time and all writing outside in the sunlight. Great improvement over my last FitBit. Great product."
        },
        {
            "Date": "Reviewed in the United States on August 17, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Fits & Looks Great!"
        },
        {
            "Date": "Reviewed in the United States on August 17, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Bought this on Prime Day to replace a series 3 that I had that was out of date for some apps I wanted (FordPass for my new 2021 Ford Ranger). Hopefully I’ll get lots of use and time out of it and be very outdated when I replace it!"
        },
        {
            "Date": "Reviewed in the United States on August 16, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Adds a layer of safety although I have to carry my phone out in the pastures and woods for connectivity. Having fun with Activity and Heart Rate."
        },
        {
            "Date": "Reviewed in the United States on August 16, 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "I like the watch and how easy it is to use and how easy it was to sync with my phone. However the battery life is horrible. It will not hold a charge more than 24 hours, causing me to have it on the charger at night when I sleep. If I knew this I wouldn’t have bought it"
        },
        {
            "Date": "Reviewed in the United States on August 16, 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "The battery dies quickly, I set the watch for walking at work, if I’m on the computer, it always asks if I’m done"
        },
        {
            "Date": "Reviewed in the United States on August 16, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Easy to set up. Battery life could be improved. Overall good product"
        },
        {
            "Date": "Reviewed in the United States on August 16, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Love it"
        },
        {
            "Date": "Reviewed in the United States on August 16, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Very good watch & price"
        },
        {
            "Date": "Reviewed in the United States on August 15, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "As described"
        },
        {
            "Date": "Reviewed in the United States on August 15, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Product arrived like this. A $300 product with no cushioning, no packing material. Disappointed.\n\nArrived with a scuff on the Apple box and product was completely uncharged. No charger was included to plug charger cord into!\n\nWhat the heck."
        },
        {
            "Date": "Reviewed in the United States on August 15, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I did research on this and read reviews before buying this for my daughter who does not have a phone. Well, the fact that this watch won’t work for family sharing was not flagged. I’m now out a lot of money because the return window closed last week, only a little more than 2 weeks after I received the watch and before I had time to realize the issue. I’m now stuck with a useless watch I cannot return."
        },
        {
            "Date": "Reviewed in the United States on August 15, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Touch screen often not responsive and there is a white line across it. Was told to attempt software updates, reset, and unpairing. Did all this, took to Apple store where I was told they didn’t know what to do, was told to send in but would be charged.\n\nIneligible for return or trade-in. Have not used it but did spend $180 on it for a broken piece of technology. Do NOT get an Apple Watch."
        },
        {
            "Date": "Reviewed in the United States on August 15, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Very easy to use, I got it for my wife because her Garman was not working. She was apprehensive when she got it but she is now very satisfied and happy with her Apple watch."
        },
        {
            "Date": "Reviewed in the United States on August 15, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "It’s a nice watch. I would like it more if the charge lasted more that a day but for the price it was worth it"
        },
        {
            "Date": "Reviewed in the United States on August 15, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Just an upgrade and this new style band is my favorite"
        },
        {
            "Date": "Reviewed in the United States on August 15, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Love the use"
        },
        {
            "Date": "Reviewed in the United States on August 15, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I am very happy and please with my watch! I also order the screen protector and extra bands.. I'm very pleased I decided to go with the Apple watch instead of going back with a Fitbit. It has everything I needed. It is perfect especially for Senior adults! Very reasonably priced."
        },
        {
            "Date": "Reviewed in the United States on August 14, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I thought I could use this as cellular, but I can’t. The description should have been more clear about this."
        },
        {
            "Date": "Reviewed in the United States on August 14, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The person we sent it to really liked it and is using all the features"
        },
        {
            "Date": "Reviewed in the United States on August 14, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Watch excellent shape, band was definitely used\nSo far working okay SE2\nBattery life same as my old Apple Watch Series 8."
        },
        {
            "Date": "Reviewed in the United States on August 14, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Todo perfecto"
        },
        {
            "Date": "Reviewed in the United States on August 14, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "No scratch and I work a job that’s not exactly gentle with my tech. Easy to use and battery life is great. Quality is perfect and the size is too. Priced well for what you get."
        },
        {
            "Date": "Reviewed in the United States on August 14, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Horrible battery life"
        },
        {
            "Date": "Reviewed in the United States on August 14, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "It came in a beautiful package like Apple is known for. It also was half charged upon arrival which makes setting it up easier. Super clear instructions and easy set up. Comes with a band I didn’t need because I bought a separate one, but I love that it does. Everything works beautifully and this is just one more step to converting to Apple."
        },
        {
            "Date": "Reviewed in the United States on August 14, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My daughter love it"
        },
        {
            "Date": "Reviewed in the United States on August 14, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "It’s a great beginner watch for those that never had an Apple Watch before to become familiar with it. I gave it 4 starts because it doesn’t come with a keyboard. That’s my fault because I didn’t do research before purchasing. The Series 7, 8 and 9 comes with keyboards. The SE 2nd generation only allows you to scribble to text or voice to text. Apart from that I have no complaints. The battery is long lasting though I mainly just use it at work. I will probably upgrade to one of the watch series that offers keyboard use unless Apple decides to bring out an update for this one"
        },
        {
            "Date": "Reviewed in the United States on August 13, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "She really likes it"
        },
        {
            "Date": "Reviewed in the United States on August 13, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I have gone through 3 smartwatches in the last 2 years. They were all rated first on the reviews. I switched to this Apple Watch 2nd generation and really like it. Very user friendly!!!! Garmin and Fitbit are worthless……"
        },
        {
            "Date": "Reviewed in the United States on August 13, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "great to have when you work out. more bang for your buck, better than a fit bit"
        },
        {
            "Date": "Reviewed in the United States on August 13, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Amazon's website description for this watch - as of the day I purchased and the day I'm writing this review - is not accurate. This is NOT a cellular compatible watch and you CANNOT use this watch with family setup."
        },
        {
            "Date": "Reviewed in the United States on August 13, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Disappointed and too advanced for me.\nI want to return it"
        },
        {
            "Date": "Reviewed in the United States on August 13, 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "This watch generally works fine, but the “wake on wrist rise” that I’m used to from previous Apple Watch doesn’t work. I have to repeatedly shake my wrist, or tap screen, sometimes several times. Very annoying, and getting worse. Would exchange, but don’t want to be without watch for however long this would take. Frustrated."
        },
        {
            "Date": "Reviewed in the United States on August 13, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Do not purchase! The battery life on this device is terrible!!"
        },
        {
            "Date": "Reviewed in the United States on August 13, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Good watch bands for the price. They are easy to take on and put off. The material feels similar to the original bands. Colors are as described in the page. No complaints would buy them again."
        },
        {
            "Date": "Reviewed in the United States on August 13, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Encantada con este precioso reloj…"
        },
        {
            "Date": "Reviewed in the United States on August 12, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Like It looks good, easy to set up.\nDislike: needs to be charged evetyday."
        },
        {
            "Date": "Reviewed in the United States on August 12, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I don’t know why I waited so long to get one. I got this on a prime day deal and am very happy with the features this watch comes with. Will be upgrading soon just for the extras."
        },
        {
            "Date": "Reviewed in the United States on August 12, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "For years I put off getting an Apple watch because I didn't think it would compare to my Garmin watches or be as tough as my G-Shocks. While some of that is true this is still an item that I found to be worth the purchase. It is my go to watch at the office because it helps me keep up with meetings, texts, phone calls and what my kids are up to (i.e. location services). Because of the Apple watch I also find that I am not constantly grabbing my phone as most things I can simply turn my wrist to see and respond to. The only reason it was not a 5 star for me is you pretty much have to charge it each night. Not a deal breaker for me as I am not looking to sleep in it anyway but better battery life would be nice. Really easy to use and there are lots of channels like \"Watch Jumble\" on YT that provide easy step by step directions to get you started. Well worth it, I wish I would have bought one earlier."
        },
        {
            "Date": "Reviewed in the United States on August 12, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Worked perfect! Will prob buy another one"
        },
        {
            "Date": "Reviewed in the United States on August 11, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Exactly what we ordered"
        },
        {
            "Date": "Reviewed in the United States on August 11, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I love my Apple Watch, I actually like it better than the iPhone. But of course you can’t have watch without the iPhone. It’s so convenient at just a glance. Love to track my sleeping patterns."
        },
        {
            "Date": "Reviewed in the United States on August 11, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Just opened the box and watch won’t even turn on!"
        },
        {
            "Date": "Reviewed in the United States on August 11, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Bought it for my kid and learned that it must be paired with an iPhone at all times. It’s WiFi only. So it cannot be set up as family sharing."
        },
        {
            "Date": "Reviewed in the United States on August 11, 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Unless your within 20 feet of your phone, the phone part of the watch does not work and text will not come through. Also, the fitness part is not accurate at all or the sleep schedule. The watch will say that I got nine hours of sleep when I wasn’t even in bed for nine hours. And when I track my steps, it is way off. This watch is not good for anything but telling in time and looking at the date. Fitbit is a much better way to go."
        },
        {
            "Date": "Reviewed in the United States on August 11, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This Apple Watch may not be perfect for everyone, but it is perfect for me! It has as many bells and whistles as I need… Probably more than I need. Apple Watch Series 3 worked great for seven years, but the screen started to fade, so it was time to get a new watch. The main functions that I use are the workout settings, timers, notifications, and weather very few places I would ever go without my phone so I didn’t need cellular data. I am really happy with my decision to not spend boatload of money."
        },
        {
            "Date": "Reviewed in the United States on August 11, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Product not working. Discharge ery quickly. Didn’t realize the short return window. Want to return or resell"
        },
        {
            "Date": "Reviewed in the United States on August 11, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Met my expectations; when my wife’s happy everybody’s happy! 😊"
        },
        {
            "Date": "Reviewed in the United States on August 11, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I am so happy with my Apple Watch… great price and great product. Love it"
        },
        {
            "Date": "Reviewed in the United States on August 10, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I realize that this is a used and returned watch. I was told that it was back to factory quality. It, however does not hold a charge for even one day! That is a pain😡😡 I would like to return it, but I can’t find how to do it."
        },
        {
            "Date": "Reviewed in the United States on August 10, 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Wanted to use this to take calls, based on the pictures in the product details, cellular was an option. Apparently this one does not support cellular and I am past the return window"
        },
        {
            "Date": "Reviewed in the United States on August 10, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Me encanto, es excelente comprare otro"
        },
        {
            "Date": "Reviewed in the United States on August 10, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Don’t know how I survived without it. It lets me know what’s going on when my phone is in another room."
        },
        {
            "Date": "Reviewed in the United States on August 10, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Excellent! Arrived quickly and promptly with no issues. The watch is exactly as described and has done fantastic."
        },
        {
            "Date": "Reviewed in the United States on August 10, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I watch is light and durable. Works for everything I need it to!"
        },
        {
            "Date": "Reviewed in the United States on August 10, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "La caja vino un poco sucia, pero el reloj esta en perfecta condiciones, cualquier novedad se las cuento por aqui."
        },
        {
            "Date": "Reviewed in the United States on August 9, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Very good"
        },
        {
            "Date": "Reviewed in the United States on August 9, 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Was scatched up guess that happened during delivery seemed made it seem like a second hand watch than brand bew"
        },
        {
            "Date": "Reviewed in the United States on August 9, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I was immediately addicted to my watch."
        },
        {
            "Date": "Reviewed in the United States on August 9, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Exactly what’s expected!"
        },
        {
            "Date": "Reviewed in the United States on August 9, 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Watch seems to slip off of charger easily. I charge it overnight, and many times the charger indicator is still red in the am. The watch does not measure blood oxygen or EKG like my last one. Disappointed."
        },
        {
            "Date": "Reviewed in the United States on August 9, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "I like the watch a lot but have two complaints. I wish you could make the font larger in the workout app while in a workout. Even with only time and distance showing, the font stays smaller. I also wish I could remove/reorder the list of apps on the watch."
        },
        {
            "Date": "Reviewed in the United States on August 9, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Battery life disappointing."
        },
        {
            "Date": "Reviewed in the United States on August 9, 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "I like the different excercise options. It is difficult to clear text messages and other items. Sometimes you have to tap about 15 times to get them to clear sometimes they won’t clear it all."
        },
        {
            "Date": "Reviewed in the United States on August 9, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I love it! I feel like Dick Tracy answering my phone on my watch"
        },
        {
            "Date": "Reviewed in the United States on August 9, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Llego perfecto y a tiempo!"
        },
        {
            "Date": "Reviewed in the United States on August 9, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "It's an apple watch, what can you say!? It's a solid design with a minimal form factor. Just what I need to cover the tan line around my wrist."
        },
        {
            "Date": "Reviewed in the United States on August 9, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Missing charger and I couldn't just get the charger sent"
        },
        {
            "Date": "Reviewed in the United States on August 9, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Exactamente lo que pedí llegó y muy rápido"
        },
        {
            "Date": "Reviewed in the United States on August 8, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "so far we love it!!"
        },
        {
            "Date": "Reviewed in the United States on August 8, 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "The charge last less than 24 hrs can't wear it all day. It kind of defeats the purpose"
        },
        {
            "Date": "Reviewed in the United States on August 8, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Love the size of watch face and the band is so comfortable to wear. Love that I was able to buy covers and additional bands to change the color of them"
        }
    ]
}