{
    "Product Name": "Apple 2024 MacBook Air 13-inch laptop with M3 chip: 13.6-inch Liquid Retina display, 8GB Unified Memory, 256GB SSD storage, backlit keyboard, 1080p FaceTime HD camera, Touch ID - Space Grey",
    "Product Image": "https://m.media-amazon.com/images/I/71ItMeqpN3L._AC_SX466_.jpg",
    "Unique Key": "B0CX267S5H/",
    "Reviews": [
        {
            "Date": "Reviewed in Australia on 15 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The fact that I can only be mildly annoyed about the ports being on the left side, and nothing else, should say how fantastic this MacBook is. Completely replaced my heavy, slow as a brick $4400 MacBook Pro 2019 model which feels ancient in comparison to the amazing and somehow super efficient M3 chip. Battery lasts forever and even doing video processing it barely get slightly warm. Light, portable and fast enough for most people, defeats the purpose of spending more on a pro model for everyone other than content creators/graphics designers."
        },
        {
            "Date": "Reviewed in Australia on 10 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Lightweight, fast and reliable with a great screen. Easy to set-up and plug and play. Perfect for my son for senior school."
        },
        {
            "Date": "Reviewed in Australia on 6 June 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "This is a good Laptop delivered fast from Amazon and cheaper that Apple Shop.\n\nI comes with macOS Sonoma and an upgrade to latest version (14.5) was needed (this was normal and OK).\n\nMy biggest concern is the difficulty in setting up macOS Sonoma which is quite complicated (even for an experienced Mac user like me). I needed help from Apple support, which is provided free for 7 days. Several hours of discussion with several Apple agents was provided.\n\nOne issue, Networking may be a Sonoma 14.5 bug? and it was referred to Apple Engineering. I am waiting for a reply on this complex issue. Apple support is generally good but, I would advise getting Applecare Plus for at least 1 year. macOS Sonoma has had 5 upgrades so far in a few weeks. I am expecting more."
        }
    ]
}