{
    "Category": "Amazon",
    "Product Name": "BLACK+DECKER 3-in-1 Waffle Maker with Nonstick Reversible Plates, Stainless Steel, G48TD",
    "Product Image": "https://m.media-amazon.com/images/I/7126geE2NYL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "Unique Key": "B000063XH7/",
    "Clean URL": "https://www.amazon.com/DECKER-Nonstick-Reversible-Stainless-G48TD/dp/B000063XH7/",
    "Brand": "BLACK+DECKER",
    "Average Star": "3.8 out of 5",
    "Reviews": [
        {
            "Date": "Reviewed in the United States on August 10, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I do not like the grill plates will not stay locked in place. They unlock while cooking, I cannot return the waffle maker, because I do not have the original box. I will not buy is item again."
        },
        {
            "Date": "Reviewed in the United States on August 10, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I’ve had this same one for a few years and it’s great! Makes delicious soft or crispy waffles l. It’s just like the one I grew up with. All the holes make the syrup soak in better too!"
        },
        {
            "Date": "Reviewed in the United States on August 1, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I wouldn't recommend this product if wanting something durable. Cheaply made plates are held on with a little clip that was bent and wouldn't hold the plates well. And I mean crooked bent from the factory. It's thinner metal on the exterior ..I was completely disappointed."
        },
        {
            "Date": "Reviewed in the United States on July 27, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "otherwise excellent"
        },
        {
            "Date": "Reviewed in the United States on July 21, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Nothing to dislike! It makes four 4” waffles. I use it more often for cornbread though than for waffles. Two great cornbread benefits…doesn’t take as long as in the oven AND butter in all those indentions."
        },
        {
            "Date": "Reviewed in the United States on July 14, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I used this waffle iron today and was totally disappointed. My old Black and Decker waffle iron was well built - heavy cage, heavy grill plates , good controls and produced excellent waffles. This machine is flimsy by comparison -- though it's design is very close to the old one. The heating is uneven and produced waffles that went from overdone to underdone depending on which side you looked at. I am disappointed that Amazon even carries this item."
        },
        {
            "Date": "Reviewed in the United States on July 1, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Makes perfect grilled sandwiches with any bread and thick or thin. Easy to use."
        },
        {
            "Date": "Reviewed in the United States on June 24, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Even though I mostly cook waffles with this, I also cook pancakes, grilled cheese sandwiches, and you can use it like a frying pan to cook anything you can think of. The non stick top and bottom make this easy to clean. The light turns from red to white to give me a good indication of whether it's hot enough to cook with yet. Then I can choose different temperatures to so I can choose the right temperature for me to cook with.\n\nThe only downside I would say is that the top and bottom sometimes pop off when I'm cooking waffles and I need to pop them back into place. Aside from that, this simple to use, easy to clean, and it's helped me find my love for waffles all over again.\n\nThanks for reading and I hope this helps :)"
        },
        {
            "Date": "Reviewed in the United States on June 20, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "The plates wouldn’t stay on. Felt really cheap too."
        },
        {
            "Date": "Reviewed in the United States on June 20, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I was very excited about purchasing this toaster/waffle maker, but it came scratched on the plate and also seems misaligned, making it difficult to open and close. Seeing it like this, I didn't even attempt to use it. I'm not sure if someone had already used it, but it certainly looks that way."
        },
        {
            "Date": "Reviewed in the United States on June 19, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "As other reviews have said, the plates pop off when the unit heats up. Not good! Don't buy this one."
        },
        {
            "Date": "Reviewed in the United States on June 2, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Easy to use. Made good waffles. The cooking plates have tendency to come loose."
        },
        {
            "Date": "Reviewed in the United States on May 20, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Plates constantly detach. It’s a very poor design."
        },
        {
            "Date": "Reviewed in the United States on May 20, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I bought this griddle for nostalgic reasons since my grandmother owned one. It is not as well built as hers. The plates do not stay in place , the top one falls off and has already burned my wife. It has fallen on my hand when cool so I was lucky. Do not buy this ."
        },
        {
            "Date": "Reviewed in the United States on May 18, 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "I bought this particular waffle iron recently because I had the same one many years ago and it worked perfectly. It's the only style I've found where you can switch to either grill or make waffles and the plates can be removed for easier cleaning. But this new one I bought doesn't work as well because the plates pop out. I've seen other reviews complaining about this. The clips don't hold the plates in securely enough. When you insert the bottom plate in, the heating control mechanism inside pushes it up. The inside mechanism is designed with springs to push down when you insert the bottom plate, but apparently the springs are too strong and they push the plate back up out of the clip. So when a waffle is ready to be removed, I have to hold the plates in with potholders so that the plates separate from the waffle. I'm thinking of returning it because I've seen other reviews saying that the plates pop out, but I'm guessing this would be a problem with any replacement that I would receive. I really want this to work and I'm planning to call Black & Decker to see if they've got a fix for this."
        },
        {
            "Date": "Reviewed in the United States on May 15, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I make a waffle batter out of whole rolled oats, raw cashews, dates, water, etc. Mixed in a Vita Mix.\nI have had one of these waffle makers for 54 years and it is time to get a new one. This surface is truly non-stick on this new one. I don't have to use non-stick spray. The waffles cook to perfection. Worth every penny."
        },
        {
            "Date": "Reviewed in the United States on May 12, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "The plates popped out the first time they got hot. We let them cool down and tried again. We let tried all different configurations - we couldn’t get them to stay once they heated up and we weren’t able to make a single waffle. Returned."
        },
        {
            "Date": "Reviewed in the United States on May 7, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Should have known from a B&D product that there is no QC. As soon as I opened it one of the plates clearly did not fit. Now I am the one that has to drive an hour away through the mountains to return it."
        },
        {
            "Date": "Reviewed in the United States on May 5, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Flip the plates to the flat sides and make pancakes fry eggs and bacon as well. Totally versatile."
        },
        {
            "Date": "Reviewed in the United States on May 2, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This is my 3rd waffle iron in 50 years. I have tried other but keep coming back to the black and decker. It heat more evenly and the waffle are crisp and browned to just the right color. Takes less time to heat up.\nmy only problem with them is the hinge spread over time. I mean over 5 or ten years. They have never stopped working but kind just got old. So i have had to replace them. Over all a good product."
        },
        {
            "Date": "Reviewed in the United States on April 28, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Very easy to use"
        },
        {
            "Date": "Reviewed in the United States on April 22, 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Removable gridle/waffle plate looser than should be."
        },
        {
            "Date": "Reviewed in the United States on April 17, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Muy buena calidad funciona perfecto"
        },
        {
            "Date": "Reviewed in the United States on April 13, 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Scratch brand new out the box...bottom pops out of place while on use"
        },
        {
            "Date": "Reviewed in the United States on April 13, 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Doesn’t hear up very well at all"
        },
        {
            "Date": "Reviewed in the United States on April 9, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "This is a wonderful waffle maker, my only complaint is that the plates don’t stay on as well as I wish they would, otherwise great purchase"
        },
        {
            "Date": "Reviewed in the United States on April 5, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Don't Buy it ! The plates kept falling down. I had to send it back. It is a really bad Waffle Maker."
        },
        {
            "Date": "Reviewed in the United States on April 4, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I love my waffle maker!!! I like the square waffles so much better than the Belgium waffles.\nI make sourdough waffles and they are so good."
        },
        {
            "Date": "Reviewed in the United States on March 26, 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "browns up nicely on bottom side but to light topside. have to manually flip over to get it close to proper texture finish!"
        },
        {
            "Date": "Reviewed in the United States on March 26, 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "The clips that hold the plates in place are easily bent and nearly impossible the get them so they will hold the plates in place. When I opened it the top clip was already bent."
        },
        {
            "Date": "Reviewed in the United States on March 23, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I ordered this waffle maker to replace one I had for 30 years that looked exactly the same but recently died. As others have noted, when heated to Waffle setting, the lower plate pops up (disengages) from the clip, making it unsafe and impossible to use. I also found that the plates on this appliance weigh less than those on my old one and the item has a slightly cheaper feel. I even tried heating it with my old heavier plates attached but the lower one still pops off when hot. Some reviewers reported a positive experience so unsure if the one I received happens to be defective or if this is a new design flaw, but I will definitely be returning it as it is totally useless."
        },
        {
            "Date": "Reviewed in the United States on March 17, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Remember to keep the bottom piece with the longest spout on the bottom to avoid plaques falling or loosening when closing the unit. I had to tighten a bit the clip that holds the plaques to the unit."
        },
        {
            "Date": "Reviewed in the United States on March 13, 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Es un producto no recomendado . No tiene mucha estabilidad y es un poco peligroso a la hora de manipularlo por que se calienta completo. Sería bueno valorar otras ofertas ."
        },
        {
            "Date": "Reviewed in the United States on March 9, 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "I purchased this in “Like New” condition but even if it was in brand new condition I cannot recommend this product. The plates are not non-stick like the listing claims. Cooking waffles is such a hassle (the lid is heavy and the handle to lift the lid is slippery and small, the clips holding the cooking plates will unclip in the middle of cooking which is a safety hazard) that I cannot recommend this product.\n\nAlso like other reviews have stated, it’s VERY unstable. The “feet” on the unit (if you can even call little stubs feet) do not have rubber on them or anything. Trying to lift the heavy lid when cooking and it’s very hot is near impossible, the black handle on the top slips every time and will either push the unit backwards or it will start to open and then slip crashing back down.\n\nAlso the lid never seemed stable. It just would lean back precariously like it was on the brink of crashing backwards if given the slightest push.\n\nI like the fact that the plates are removable, however, the “clips” that are meant to hold the plates in place DO NOT WORK. I had to physically pull the clips for the top and the bottom down because they wouldn’t hold the cooking plates in place. Terrible design choice, especially if you’re cooking and it’s around 400* and the clip decides to pop off. Complete safety hazard.\n\nDecided to return this unit and instead purchased a Cuisinart panini grill with removable plates. Have used it already and it’s a night and day difference. If buying a small sandwich grill, it’s important to get a unit with removable plates, otherwise it’s a pain to clean. The plates on the Cuisinart lock securely in place and are a breeze to take out. The non-stick feature works great instantly and when hand washing the plates, they clean in SECONDS. The quality is literally NIGHT and DAY. Don’t waste your money on the Black and Decker as you won’t be happy with it and you could possibly get hurt. I would recommend getting the Cuisinart instead. It’s a little bit more expensive but it’s worth it in the end.\n\nHope this helps anyone looking for a reliable indoor grill."
        },
        {
            "Date": "Reviewed in the United States on March 3, 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "The product works ok. In general it's very cheap and flimsy but it does work."
        },
        {
            "Date": "Reviewed in the United States on February 28, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I was so excited to see that B& D was still producing this model after my old one stopped working after 40 years.\nThis one makes perfect waffles just like my old one. See you for the next review in about 40 years.\nThanks Black & Decker"
        },
        {
            "Date": "Reviewed in the United States on February 27, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The best for grilled cheese"
        },
        {
            "Date": "Reviewed in the United States on February 25, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Even though I oil it as directed, it still sticks badly."
        },
        {
            "Date": "Reviewed in the United States on February 24, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Better than Roscoe’s I’d say, and I’m freezing them too. They don’t make them like this anymore… or I guess they do lol. Not like the average plastic ones, this one deserves 5 stars people"
        },
        {
            "Date": "Reviewed in the United States on February 23, 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Makes thin waffles. They are too thin. If you like thick waffles do not purchase"
        },
        {
            "Date": "Reviewed in the United States on February 22, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "We're not big fans of Belgian waffles, but it's almost impossible to find a standard waffle iron anymore. We bought this after reading the reviews, and we're very pleased. The waffles come out crisp on the outside and fluffy inside. I like that it makes basically 4 waffles at a time. That way a couple people can start eating while you're making more. The iron takes a while to heat up, but if you start heating and then make your batter, it works out well. One important note (and not mentioned in the instructions), the indicator light comes back on when the waffle is done cooking, which is helpful. :-)"
        },
        {
            "Date": "Reviewed in the United States on February 21, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Item is not working, but return date is passed,\nCan I return this item?\nPlease advise"
        },
        {
            "Date": "Reviewed in the United States on February 18, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Cons: Definitely not worth the money. Poorly constructed out of the cheapest material. Fit and finish is horrendous. Griddle plates will not lock into the top or bottom well, and as soon as the bottom starts to heat the spring loaded thermostat pushes the plate out of the latch.\n\nPros: The mirror like finish will allow you to see your reflection well enough to gage just how upset you're getting trying to use this piece of garbage."
        },
        {
            "Date": "Reviewed in the United States on February 18, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Tried using as a griddle. Everything you cook it sticks no matter how much oil you use.\nThe plates keep falling out when trying to use. It is cheaply made."
        },
        {
            "Date": "Reviewed in the United States on February 18, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "When the machine heats up, the bottom plate pops. The latch is not the proper material to resist the heat produced. Other wise a great item."
        },
        {
            "Date": "Reviewed in the United States on February 14, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I don't even know how this item could be sold to the public... its so poorly made and constructed as well as being crazy unsafe.... RETURNING ASAP!"
        },
        {
            "Date": "Reviewed in the United States on February 14, 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "I made waffles but the plates would not stay in place, the top plate continues to pop out of place. It is definitely not made as well as the ones that were made years ago. Poor quality."
        },
        {
            "Date": "Reviewed in the United States on February 12, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Works fine until you plug it in, plates warp and pop out of single front clips that hold them in (back of plate fits into hinge). I would not recommend this purchase."
        },
        {
            "Date": "Reviewed in the United States on February 12, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Do not like Belgian waffles, too sweet. Wanted an old fashioned style maker that also had larger capacity than what most round ones offer. Only two in our family, but we can each have two squares to eat while a second batch is cooking. Not digital either which for me is a big bonus."
        },
        {
            "Date": "Reviewed in the United States on February 11, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "This is a piece of junk and very dangerous the hot plates will fall out when hot . At first i thought I just didn't put them in right . but no matter what i did they pop out when hot and you have to risk a burn trying to put them back in . only to have them come loose again. I will definitely be returning I thought Black and Decker was a little better then this piece of trash"
        },
        {
            "Date": "Reviewed in the United States on February 8, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "The top half would not align with the bottom half, therefore no closure. It was never used, we threw it in the trash!!"
        },
        {
            "Date": "Reviewed in the United States on February 7, 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Ended up returning this product. It was very cheap and felt like it was going to fall apart at any moment"
        },
        {
            "Date": "Reviewed in the United States on February 6, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "After reading many reviews I almost backed out. My main concern was not getting burned by loose hot plates. It ticked all the buttons of what my friend was looking for and she has years of being in the kitchen. She wanted to be able to make old fashion waffels for the grand kids. She said the first couple uses she fid have issue with bottom plate being loose but once she learned her way around that she is thoroughly pleased with the functioning of the unit over all."
        },
        {
            "Date": "Reviewed in the United States on February 1, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "We just ordered this one to replace one we received 40 years ago as a wedding gift. Exactly the same except digital temp. If this one is half as good it will outlast me!"
        },
        {
            "Date": "Reviewed in the United States on January 27, 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "We had the same product at my house for a few years and it was great. I decided to purchase one for my house and the quality was just not the best. I really wanted to love it but couldn’t"
        },
        {
            "Date": "Reviewed in the United States on January 21, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "We have had this product for just over 2 months. We have used it once or twice a week to make grilled sandwiches and waffles. The housing and clips that are supposed to retain the plates are very flimsy. The retention clip for the upper plate failed this morning while my 10-year-old and I were making waffles. The hot upper plate fell out of the housing as he was lifting the lid to check if the waffle was done cooking. Fortunately, the plate bounced but was prevented from falling completely out by the waffle. After it had cooled down, I attempted to reattach the plate, but the housing where the retention clip attaches and the clip itself flex too much to retain the plate. Frankly, this product should be recalled. I will be reaching out to the US Consumer Product Safety Commission. Do not buy."
        },
        {
            "Date": "Reviewed in the United States on January 21, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Bought this waffle maker to replace one about 35 years old. Used couple times already, cooks good, just put little Pam on first one and nothing after. Takes 8-10 minutes to heat, and about 5 to cook to golden brown, we like them crispier so let them stay in about minute longer. I'm 75 so this will probably outlast me."
        },
        {
            "Date": "Reviewed in the United States on January 21, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Makes waffles that fit in toaster. I can make batches and freeze them for cheaper than from the store"
        },
        {
            "Date": "Reviewed in the United States on January 20, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "The clips are too weak to hold the griddles in place. When opening while making waffles the griddles fall and either pull the waffle apart or don't separate so that you can't retrieve the waffle. Don't buy this brand until they fix the clip situation."
        },
        {
            "Date": "Reviewed in the United States on January 19, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "The Black & Decker Waffle Maker is of very poor quality. Upon first attempted use, the smell of burning plastic from the handles happened and then the waffle plate popped out of place. Quickly turned off, unplugged and vented the kitchen. Warning DO NOT buy this product."
        },
        {
            "Date": "Reviewed in the United States on January 16, 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "I don't care for \"Belgian\" waffles and this is the only brand I can find offering \"real\" waffles. This is the 4th time I've purchased this item for use in various locales. The style has always been marginal, but useable. The price has gone way up in the past 3 years, but that is to be expected under the current fiscal policy. Unfortunately, quality control has also disappeared. The cooking plates spontaneously pop out in use, ruining the waffle. The non-stick coating has several flaws. The stainless steel was marred right out of the box. I returned it after one use and may have to learn to like the Belgian variety!"
        },
        {
            "Date": "Reviewed in the United States on January 16, 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Only small problem is one of the tabs holding the upper plate in wasn’t tight so the plate would fall out. My son on law bent the tab inward so problem solved. It does demonstrate the poor quality control many of the reviews mention."
        },
        {
            "Date": "Reviewed in the United States on January 15, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "The plates don't fit well which may be one reason why the top and bottom of the waffles bake to different doneness levels. Too much heat escaping. (I've since learned that an advantage to having fixed plates is temperature consistency). The ring burner cooks hotter on the outside of the ring on top and hotter on the inside of the ring on the bottom. The metal case is thin and gets hot. The light only serves to let you know when preheating is complete, even though it continues to go off and on throught cooking. I'm returning it. Don't need a griddle so will try a closed system waffle maker. I was excited to try this because I don't prefer Belgian style waffles and there are very few waffle irons available that are for the thinner type."
        },
        {
            "Date": "Reviewed in the United States on January 11, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I love this product. It’s great for toasted sandwich’s & waffles."
        },
        {
            "Date": "Reviewed in the United States on January 9, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "First, it has FINGER SMUDGES th all over when we opened it. The plate corners were scuffed up. The plates do NOT GO ON. The little tabs are NOT strong enough to hold anything. The waffle maker started SMOKING when when we turned it on. It had NO instruction manual. The light does not blink or turn off to indicate it is ready. Also, it is smaller than advertised. Sadly yes, that is what she said!"
        },
        {
            "Date": "Reviewed in the United States on January 6, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Liked it very much. I gave it as a gift. She was delighted!"
        },
        {
            "Date": "Reviewed in the United States on January 6, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Pros:\nIt's nonstick.\nIt definitely gets hot\n\nCons:\nCheaply made\nExtreme Fire and burn hazard\nCooking plates always fall off due to cheap design\nOver priced\n\nI have no idea how people are giving this 5 stars... Cheap piece of garbage, no shielding from the heating element and the outside body makes the outside get just as hot as the cooking plates. If it had proper handles I might overlook this but it just has a thin piece of plastic on the lid, that also gets warm during cooking by the way giving it a melting plastic smell.\nPlates are only held on by a single thin metal clip that warps in the heat and results in the plates always falling off.\n\nI saw reviews for this on websites recommending this as a good low/mid price range waffle maker and I have other black & decker kitchen appliances that I love. I will be immediately asking for a refund, if this was $15-$25 I might excuse the cheap design but at $60+ it's a rip off."
        },
        {
            "Date": "Reviewed in the United States on January 5, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "This product is super dangerous, the outside heats up more than the inside. Plates fallen off of rack and burned my hand. Grill opción is crappy everything sticks even if you put butter or oil. A completely waste of money."
        },
        {
            "Date": "Reviewed in the United States on January 3, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Cheap, flimsy, and dangerous. I thought the design would make for easy cleaning but the tiny clips do not hold the plates in. They fell out 3 times while trying to make a single batch of waffles. The exposed element burned my pot holders while I tried to make the plates stay.\n\nDo not recommend."
        },
        {
            "Date": "Reviewed in the United States on January 3, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Wife wanted a waffle maker with removable plates - did a bunch of research and found & the B&D to be the best value for the money - haven't had a chance to make waffles - yet - but - seems to be a nice little unit over all ...."
        },
        {
            "Date": "Reviewed in the United States on January 1, 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "This is a $20 waffle iron hiding behind a much higher price tag.\n\nOut of the box it just wouldn't work right...\n- the lip of the top and bottom parts weren't the same shape as the griddle plates\n- the spring mechanism on my BRAND NEW iron wouldn't hold the plates in place, and the bottom one would pull on the top one when opening, and the plate would drop out\n\n- waffle pattern is very shallow. To each their own I guess, but I do not like this aspect.\n- waffle plates are very thin. Even with the electric element having a good shape to it, there was a degree of uneven heat distribution."
        },
        {
            "Date": "Reviewed in the United States on December 28, 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I was so excided to see that our 25 year old waffle iron was still made\nthis was and now is the best waffle maker."
        },
        {
            "Date": "Reviewed in the United States on December 27, 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "This thing SUCKS!! I’ll keep this short and sweet:\n\n1) It’s so cheaply made that the clips that are supposed to keep the heating trays in do not actually hold them in place. The whole body/frame looks like it’s warped.\n\n2) The outside gets SO hot, it’s unsafe. And yes, I’m aware it’s common for waffle makers to get hot. This one is over the top though. What’s worse is that it’s still not hot enough! This leads to issue 3:\n\n3) The waffles are so small and thin that they come out dry and rubbery.\n\nThis thing sucks!!!"
        },
        {
            "Date": "Reviewed in the United States on December 27, 2023",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Disappointed that the instructions do not fulfill the expectation of good baking."
        },
        {
            "Date": "Reviewed in the United States on December 25, 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Found flakes of the non stick coating coming off when we opened the box. Several silver spots showing on the grills before we even used it. Very cheap."
        },
        {
            "Date": "Reviewed in the United States on December 25, 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My original multi waffle maker is over 45 years old and still working love the size and it’s multi functions"
        },
        {
            "Date": "Reviewed in the United States on December 22, 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Has removable plates for cleaning. Be sure not to overfill, allow batter to spread out or you will have a mess to clean up. Browned up the waffles nicely."
        },
        {
            "Date": "Reviewed in the United States on December 20, 2023",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "I should’ve read some more reviews before purchasing this. The whole unit feels cheaply made with the way the plates remain loose and did not stay snapped in place when I used it ….it was also extremely hot, even when trying to use the plastic pieces to open it the steam scalded my fingers. I would not trust this unit anywhere near children because everything gets extremely hot!"
        },
        {
            "Date": "Reviewed in the United States on December 18, 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Cheaply made. Clips do not hold plates securely, they pop loose while you are cooking. Will be returning."
        },
        {
            "Date": "Reviewed in the United States on December 12, 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "The worst item by far. No matter what you do, it will stick to the waffle maker. Would really love my money back"
        },
        {
            "Date": "Reviewed in the United States on December 9, 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Let me count the ways. The plates fall out any time you open and close it. There is no way to make it better. It doesn't brown evenly, if you can even get the waffle out at all. Lots of grease used and still stuck. Light on one side and dark on the other. What a waste of money."
        },
        {
            "Date": "Reviewed in the United States on December 5, 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Love my waffle maker. Compact too!! Fits easily in cabinet."
        },
        {
            "Date": "Reviewed in the United States on December 3, 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Plates do not fit well. Clips do jot hold plates securely and unit is not evenly hearing."
        },
        {
            "Date": "Reviewed in the United States on December 1, 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Very, very disappointed in this product. Will return and never buy this brand again. I've used Black & Decker waffle irons for years. My latest stopped browning and the new one will not clip the plates to the frame. Used it once and struggled the whole time it was baking the waffle. Too bad."
        },
        {
            "Date": "Reviewed in the United States on November 23, 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Fue un regalo para mi hija, esta semana me invitó a estrenarla para hacer pancakes, un desastre! La tapa no ajusta bien, se pegó la masa, en fin es un desastre."
        },
        {
            "Date": "Reviewed in the United States on November 23, 2023",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "The plates were already chipped. Was very disappointed"
        },
        {
            "Date": "Reviewed in the United States on November 22, 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Nothing!!\nThis is my 3rd one. I got my 1st one when I was in my late teens from my mom as a Christmas gift.\nI bought my 2nd one when I was in my middle to late 30's.\nI am 71 years old and just got this 3rd one for my birthday.\nThis is a GREAT product, I would recommend it to anyone.\nDolores"
        },
        {
            "Date": "Reviewed in the United States on November 21, 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Muy buena calidad."
        },
        {
            "Date": "Reviewed in the United States on November 19, 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "This waffle maker is a death trap. I was burned 4 times when I first used it. I discovered the whole waffle maker becomes scolding hot when you use it. Then the metal waffle molds are not held in place very well. That’s how I received another one of my burns. I opened the waffle maker and it fell out of the brackets and burned my hand. I would not have this around kids. It’s just dangerous."
        },
        {
            "Date": "Reviewed in the United States on November 13, 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "The metal part of the waffle iron is so thin it can’t hold the weight of the cooking plates. The cooking plates pop off the clip when you move the lid in any way. This causes loss of heat and very uneven cooking.\nTotally a complete pile of junk."
        },
        {
            "Date": "Reviewed in the United States on October 28, 2023",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Poor quality for B and D. Glad I waited and didn’t pay full price!"
        },
        {
            "Date": "Reviewed in the United States on October 28, 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Wish I had read the reviews before I ordered. I wanted to replace my 50 year old waffle iron with a similar one, not a Belgian waffle type. This waffle iron came while my husband was in ICU for 36 days and I was unable to try it until after he came home. Big mistake because now I cannot return it. The sides are bent so that the waffle plates to not fit correctly. The top plate does not fasten so that every time I open the waffle iron it falls off--and it's hot to touch! Also, some of the finish came off after the first and only use. I am truly disappointed in this waffle iron and would not recommend it to anyone. Because of my situation with my husband in the hospital, I am stuck with a waffle iron that is impossible to use!"
        },
        {
            "Date": "Reviewed in the United States on October 27, 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Lifted the lid to remove waffle and the upper plate fell off the unit, just missing my hand. The clips that hold the plates in place are flimsy and let go. Also, the overall feel of the unit is poor and cheaply constructed. No quality put forth."
        },
        {
            "Date": "Reviewed in the United States on October 25, 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "this is the second one of this waffle maker i had,, the first one was warn out, easy to use and 2 very good recipes with it,, i have to be careful as how many i make as it seems they go right to my hips,,"
        },
        {
            "Date": "Reviewed in the United States on October 24, 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This is the current version of the unit I bought several years ago. New version is almost identical to the older unit except the chrome housing appears to be slightly thinner. Works great!"
        },
        {
            "Date": "Reviewed in the United States on October 20, 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I tried using a smaller waffle maker but it didn’t give the same quality that I have had with a previous iron like this one. Looking forward to making breakfast with it tomorrow."
        },
        {
            "Date": "Reviewed in the United States on October 18, 2023",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "My old. Griddle quit. Bought this because it has flat and waffle plates. Waffle plates are extremely thin. Almost roll up like waffle cone. But it gets hot and I normally use the flat sides."
        },
        {
            "Date": "Reviewed in the United States on October 17, 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "This is one of worst products I have purchased. Shame on me for believing in the black and decker brand. The plates on this product move constantly and when making grilled cheese sandwiches I wound up with more cheese under the plates than on the sandwiches. I can’t return this fast enough."
        },
        {
            "Date": "Reviewed in the United States on October 12, 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Opened for the first time and the plates fall right off the top- will not stay in. Am unfortunately outside my return window"
        },
        {
            "Date": "Reviewed in the United States on October 12, 2023",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "I don't like this Waffle maker. It's sticky. Extra oil is needed. Also the outside gets super hot. I can't just have it on the kitchen table, I need something under it."
        }
    ]
}