{
    "Category": "Amazon",
    "Product Name": "Water Bottle 40 oz 1180ml Insulated with Straw&Brush, Coolflask Vaccum Stainless Steel Metal 3 Lids Water Flask for Sports, Gym or Office, Keep Cold 48H Hot 24H, Magic Black",
    "Product Image": "https://m.media-amazon.com/images/I/81ORd3tmthL.__AC_SX300_SY300_QL70_ML2_.jpg",
    "Unique Key": "B0973328MJ",
    "Clean URL": "https://www.amazon.com.au/Coolflask-water-bottle/dp/B0973328MJ",
    "Brand": "Coolflask",
    "Average Star": "4.6 out of 5",
    "Reviews": [
        {
            "Date": "Reviewed in Australia on 9 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Kept water cool"
        },
        {
            "Date": "Reviewed in Australia on 7 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Very very sturdy and the cover it comes with has been a great help in carrying such a big bottle around. Water temperature stays consistent for a very long time"
        },
        {
            "Date": "Reviewed in Australia on 26 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The best They awesome drink bottle I ever bought and owned ! Very well made and worth every dollar.. highly recommended"
        },
        {
            "Date": "Reviewed in Australia on 14 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I really enjoy this bottle. I like to keep a bottle by my bed side at night, so I have some water nearby if I feel the need for a sip in the middle of the night, or when I wake up in the morning. It keeps the water temperature in check over night, whether it is cold or hot. Perfect for both summer and winter. Also it has a handle for easy carry, I just take in around the house, so I can stay hydrated without having to get water from the kitchen."
        },
        {
            "Date": "Reviewed in Australia on 30 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Perfect"
        },
        {
            "Date": "Reviewed in Australia on 29 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I just received this drink bottle and I am really impressed with the design and quality of the bottle.\nThe bottle comes with an outside cover which provides a handle or strap to carry the bottle over your shoulder, the handle is great for my arthritis as a normal bottle is difficult to hold as my hands are weak and painful"
        },
        {
            "Date": "Reviewed in Australia on 27 June 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "It great."
        },
        {
            "Date": "Reviewed in Australia on 7 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "It’s a great buy at the right price can’t go wrong"
        },
        {
            "Date": "Reviewed in Australia on 20 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Good"
        },
        {
            "Date": "Reviewed in Australia on 13 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "good quality good price quick delivery and packed well"
        },
        {
            "Date": "Reviewed in Australia on 8 May 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "The bottle has this synthetic smell that shoots through your nose and the water taste is a little off too. Happy with the bottle quality except for the smell. How do I remove this smell?"
        },
        {
            "Date": "Reviewed in Australia on 6 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Excellent gift. Great product. Exceptional quality."
        },
        {
            "Date": "Reviewed in Australia on 1 May 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Arrived, but didn't have straws or cleaning brush included as stated."
        },
        {
            "Date": "Reviewed in Australia on 17 April 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Overall I like the feel and design of these bottles.\nThey do a decent job of keeping water cold.\nYou get an option of 3 different types of lids.\nWhat I don't like is the lid which is supposed to be a chug type design is so small it's line using a thick straw. I much prefer the chug lid of my yeti. I have to use this without any of the provided options and it's awkward and can't drink while driving. I'll prob buy something better."
        },
        {
            "Date": "Reviewed in Australia on 7 April 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Great product, would definitely recommend for another person"
        },
        {
            "Date": "Reviewed in Australia on 3 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Water bottle fits perfectly under water dispenser in my fridge. 2L is perfect for a long day at work. Water stills cool all day, even if the bottle has been in the sun. Really pleased with this bottle."
        },
        {
            "Date": "Reviewed in Australia on 21 March 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "I have only used this drink bottle a couple of times and I am happy so far."
        },
        {
            "Date": "Reviewed in Australia on 14 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Very good drink bottle"
        },
        {
            "Date": "Reviewed in Australia on 6 March 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Really surprised and disappointed - this doesn’t keep the water cold as expected and the nozzle just broke - will return."
        },
        {
            "Date": "Reviewed in Australia on 2 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Thank you, it was great"
        },
        {
            "Date": "Reviewed in Australia on 25 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The product is amazing"
        },
        {
            "Date": "Reviewed in Australia on 7 February 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Okay it's summer and it's Australia so the car gets hot. BUT I should not burn my mouth drinking from a water bottle that is apparently triple isolated, protected in a neoprene sleeve and left in a light coloured cottone tote bag in the car. And no I didn't fill it with hot water. The water was fresh and cool when I left the car. But a few hours later and 20min into my drive home I was desperate for a refreshing sip. Luke warm would have been okay but I don't need a hot tea without teabag at 32C outside. I was going to buy the larger version for my partner. Boy am I glad I didn't. I know it's not a Stanley or CamelBak but I think a plastic bottle would have been better then this."
        },
        {
            "Date": "Reviewed in Australia on 7 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great drink bottle, amazing value, comes with everything you could want. Buy this now."
        },
        {
            "Date": "Reviewed in Australia on 6 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "High quality water jug. Easy to clean. I use it everyday to ensure my water intake. When I go for walks, I use the carrying case and strap, it's awesome 😎 Oh and water stays fresh and cool for hours on, no weird smells or taste"
        },
        {
            "Date": "Reviewed in Australia on 13 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Came with all accessories as advertised. Keeps water cold all day in hot Australian weather, even without ice. You have to suck the straw a bit harder than expected and this particular lid option leaks a tiny bit. The bag was ripped a little bit but received a full replacement with no fuss. Very conviement especially with the carry bag and would definitely recommend!"
        },
        {
            "Date": "Reviewed in Australia on 9 January 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "The drink bottle was used for just 2 weeks and was only hand washed then it developed a rattle due to something inside the drink vottle breaking."
        },
        {
            "Date": "Reviewed in Australia on 1 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Best Insulated bottle i have"
        },
        {
            "Date": "Reviewed in Australia on 13 December 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Bought for big capacity, a bit heavy as expected. Good quality, stays cold during the day, but does not stay cold for 48 hours, may be because it is summer now.\nOverall satisfied."
        },
        {
            "Date": "Reviewed in Australia on 20 January 2022",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Didn’t receive multiple accessories that came with the bottle"
        },
        {
            "Date": "Reviewed in Canada on 20 August 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "My husband has one of these and I absolutely love it. Keeps the temperature for hours upon hours. We left ice in it and it lasted from like 3pm until around noon the next day. Awesome bottles!! I decided to get my own and am super happy with the colour and how much it comes with, but my straw lid (main lid I would be using) leaks pretty badly. Not sure what happened because my husband's doesn't leak at all. Really disappointed that my favourite lid is the one I can't use, but very happy otherwise."
        },
        {
            "Date": "Reviewed in the United Kingdom on 19 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "You can add ice cubes into the wide neck to keep extra cold in the hot weather, nice to drink out of the straw that is attached under the lid. Non spill with a carry handle. Sturdy top which is easy to open. . Comes with straw brush. So easy to keep clean. Really excellent value."
        },
        {
            "Date": "Reviewed in the United States on 17 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Best bottle ever built🫡🇯🇲 I bought two them."
        },
        {
            "Date": "Reviewed in Canada on 16 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "L’eau reste froide toute la journée . La glace ne font pas vite comme dans une bouteille en plastique\nJe suis satisfaite du résultât . Ça permet d’avoir de l’eau fraîche plus longtemps par temps chaud à l’extérieur . Par contre elle ne rentre pas dans les espaces prévu pour mettre les nos verres à café ou bouteille régulière ."
        },
        {
            "Date": "Reviewed in the United Kingdom on 16 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Bought this for a trip to Spain thinking it will keep my rum cold next to the pool. Cold is an understatement. The ice was still present for 4-6 hours and my drinks were still cold for up to 24hrs. Filled it with water and took it out on our travels each day and it kept us perfectly refreshed. Best product on amazon and can't be beaten on price either. No leaks, loads of accessories and the carry case is fantastic. Fully recommend! 10/10"
        },
        {
            "Date": "Reviewed in the United States on 15 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "So glad I made this purchase! Coldness staffs check. Handlung check. Color check!!!"
        },
        {
            "Date": "Reviewed in Germany on 15 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Hält absolut dicht. Und tatsächlich ewig kalt bzw warm. Und durch die Hülle mit Tragengurt und -griff absolut leicht handlebar."
        },
        {
            "Date": "Reviewed in Canada on 15 August 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "The Straw lid doesnt suck up water at all"
        },
        {
            "Date": "Reviewed in the United States on 14 August 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Made in China - Fail.\nNot dishwasher safe? - extra hard FAIL"
        },
        {
            "Date": "Reviewed in the United States on 13 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My husband is constantly drinking bottles of water and he'll go through six or eight in a day with this one large water holder. He loves it no longer caring 1 million little bottles of water and leaving him in his truck. This also keeps water cold all day long.."
        },
        {
            "Date": "Reviewed in the United States on 13 August 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "The cup is great but the lid that uses a straw has this silicone washer that is messed up making the lid unusable. Unfortunately this is the lid I wanted to use. I already had water in it today or I would have returned it"
        },
        {
            "Date": "Reviewed in Germany on 13 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Also hab die Flasche nun paar Tage im Einsatz, in der Früh schmeiß ich 2-3 Eiswürfel in de Flasche und ab späten Nachmittag ist es immer noch herrlich kalt und das obwohl nur noch ein 5tel Inhalt drinnen ist.\nDie Flasche liegt immer im Auto da ich immer zu verschieden Kunden berufsbedingt fahre und obwohl das Auto brennt vor Hitze ist der Inhalt eis kalt... absolute Empfehlung"
        },
        {
            "Date": "Reviewed in Italy on 13 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Ottimo prodotto, ottima tenuta del fresco. Mantiene fredda l’acqua dalla mattina alla sera senza problemi. Provata in spiaggia. Consigliato!!"
        },
        {
            "Date": "Reviewed in Germany on 12 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Gute Trinkflasche zum angemessenen Preis.\n\nIsolierung funktioniert sehr gut und die verschiedenen Deckel wirken ordentlich verarbeitet.\n\nDie mitgelieferte Tasche, insbesondere der \"Griff\" könnte hochwertiger sein, allerdings hab ich das für den Preis nicht erwartet"
        },
        {
            "Date": "Reviewed in the United Kingdom on 11 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I thought the price was a little high but do know why now. It comes with three different caps - all can serve different purpose for different occasions, love it."
        },
        {
            "Date": "Reviewed in the United States on 9 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This bottle is cool, 3 different caps with a straw option, keeps ice for about 6 to 8 hours depending on climate. Overall I like it."
        },
        {
            "Date": "Reviewed in Italy on 9 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Bella borraccia per quelle lunghe giornate fuori casa!!! Mantiene fresco le bevande!!!"
        },
        {
            "Date": "Reviewed in Canada on 8 August 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Great pride, but you get what you pay for. Does NOT things cold beyond 3hrs. Very disappointed."
        },
        {
            "Date": "Reviewed in Italy on 7 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Grandissimo acquisto.\nLo uso per portarmi acqua fresca al lavoro.\nMantiene l'acqua fredda come appena messa per 36 ore."
        },
        {
            "Date": "Reviewed in Spain on 6 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Gran capacidad y dura muchísimo el agua fría. Ha sido la compra del verano sin duda."
        },
        {
            "Date": "Reviewed in France on 6 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Très belle gourde, jolie et isotherme avec beaucoup d’accessoires. Je recommande !!!"
        },
        {
            "Date": "Reviewed in Italy on 5 August 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Il prodotto ordinato dovrebbe presentare 3 coperchi , dentro la scatola ce ne erano soltanto 2. Procederò al reso del prodotto. Peccato"
        },
        {
            "Date": "Reviewed in Italy on 4 August 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "molto bella e fa il suo dovere ma fa troppa puzza all’interno anche dopo averla utilizzata diverse volte"
        },
        {
            "Date": "Reviewed in the United States on 4 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "It's definitely worth the money for how long these keep your drinks cool or hot. Of course, most do the same, but it also feels really nice with he sleeve it comes with. I don't have to worry much about dropping it or how heavy it is because that sleeve makes sure it doesn't fall off of my hand. Not bad in terms of weight, quality, and I'd day it's pretty durable from the amount of times I've dropped it. Not a single dent yet. A nice touch, but the sleeve hasn't shrank in the washer yet! 5 stars"
        },
        {
            "Date": "Reviewed in the United States on 3 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Size is good. 3 Options of the dispenser is very very innovative and good. Outside may scratch easily"
        },
        {
            "Date": "Reviewed in the United States on 3 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I travel a lot, and stopping and buying bottled water is annoying anymore, plus we all know it is hurting the environment. Anyways it is bulky, but fits all the water i need in a day, Throw it in the truck and hit the road. Now when i stop, i stretch my legs answer phone calls etc.....I am not looking for a place to buy water.\n\nGreat product, well made, only downside it is bulky...that is minor to me."
        },
        {
            "Date": "Reviewed in the United Kingdom on 2 August 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "So, this product looks amazing and the quality of the build is 10/10. I'm just disappointed that the wrong colour has been sent. I ordered the indigo black and received the bubble gum. Definitely not feeling the bubble gum colour. Hopefully the new order I've placed is the correct colour so I can review the coolflask 🤞🏻.\nUpdate 4th Aug 24.\nSo I ordered the coolflask again in indigo black after having received the wrong colour first time round ,and yet again i received the bubble gum colour which I will be returning (again) . Please be aware that the second order DOES state the colour as indigo black on the box so I'd say that a major mix up in the packaging department is to blame. Overall a rubbish experience but I guess these things do occur some times. Don't let this experience I've had put you off as it does seem to be a very good product. It just could be a lucky dip regarding what colour you end up with 🤣."
        },
        {
            "Date": "Reviewed in the United States on 1 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "We have multiple of these “chug jugs” as we like to call them. They are very durable, keep ice cold for days and the lids are great!"
        },
        {
            "Date": "Reviewed in Saudi Arabia on 1 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "تحفظ البروده و الحرارة لمدة طويلة و جودة عالية و سهله الحمل و معها ادوات التنظيف و مصاصه انصحكم فيها"
        },
        {
            "Date": "Reviewed in Canada on 1 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I don't know what you're doing if you decide not to buy this water bottle, I have literally had it for over a month in Ontario. Canada, through one of the hottest summers we have ever had, I take it with me absolutely everywhere, carrying it with its case and sling is absolutely easy.It holds 2.2L liters of water 💧 💙 And I have had ice stay in it for UP to 50 hours before almost melting, and the water's still being cold. It is absolutely great and very well. Insulated, very tough and all the attachments for the drinking part are absolutely amazing depending on what I am doing for the day! This company is Way underpricing what this water bottle should be. Congratulations to them for saving the environment. And I hope more of these get sold, I will be buying 1 for my girlfriend and more for my family And hers as well, I think i'm going to collect a couple of them, to be honest, they look absolutely stunning and the quality is absolutely unbelievable.Very well done."
        },
        {
            "Date": "Reviewed in Canada on 31 July 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "This item was very obviously returned as all the packaging was ripped open and there was a straw missing. Will be returning this right away I don’t want to catch anything from someone else"
        },
        {
            "Date": "Reviewed in Italy on 30 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Borraccia ottima di qualità,un po' cara."
        },
        {
            "Date": "Reviewed in the United States on 29 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Keeps super hot for more than 18 hours"
        },
        {
            "Date": "Reviewed in the United States on 29 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This works great with hot or cold"
        },
        {
            "Date": "Reviewed in Canada on 28 July 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "The bottle is nice however the lids suck, break very easily. I kicked by accident it broke right away. I have the Costco one I’ve dropped the thing a gazzilion times. Looks like it’s been through a war zone still works great. Recommend getting one from Costco."
        },
        {
            "Date": "Reviewed in the United Kingdom on 28 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I have tried a lot bottle and this one is the best one. Keep the cold water all day 😍"
        },
        {
            "Date": "Reviewed in the United States on 27 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Keeps drinks cold for hours and hours!!! Love it!!"
        },
        {
            "Date": "Reviewed in Saudi Arabia on 26 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Good quality saves cold, and hot water"
        },
        {
            "Date": "Reviewed in Germany on 26 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "An sich ist die Flasche mir Ihrem ganzen Zubehör super gut verarbeitet. Aber leider riecht die Flasche und vorallem die mitgelieferte Tasche sehr unangenehm nach Chemie."
        },
        {
            "Date": "Reviewed in Saudi Arabia on 26 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "الحافظة قوية و تحفظ البرودة لمدة طويلة بالإضافة إلى حجمها يعتبر سهل الحمل في الصيف"
        },
        {
            "Date": "Reviewed in Saudi Arabia on 25 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "تحافظ على برودة الماء لاكثر من يوم ما شاء الله وحجمها اكبر مما توقعت. فقط تحتاج لتنظيف جيد قبل الاستخدام حتى تروح الرائحة ولا تعدم المشروب."
        },
        {
            "Date": "Reviewed in the United States on 25 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "I got this for work to replace a different faulty thermos, and I thought a sip top would be a good fit. From first use, it never sealed. Maybe the other caps'll be better.\n\nThe other features are good. It's been easy to move around. I actually have used the strap and I hope it'll hold up. The insulation seems good too.\n\nJust fix these cap issues. I'm noticing a trend. You're so close just get over the line people."
        },
        {
            "Date": "Reviewed in the United Kingdom on 25 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Sturdy build keeps water cold in the sauna"
        },
        {
            "Date": "Reviewed in the United Kingdom on 25 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Love this bottle, great quality"
        },
        {
            "Date": "Reviewed in Canada on 24 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Donner en cadeau et les personnes très satisfaitent"
        },
        {
            "Date": "Reviewed in Germany on 24 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Flasche hält was sie verspricht, Getränke bleiben Stundenlang kalt und dicht hält sie auch selbst mit Kohlensäurehaltigen Getränken!"
        },
        {
            "Date": "Reviewed in Canada on 24 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I'm after getting so many water bottles to see which will keep my water cold and the ice still intact during my 12 hour shifts *I'm a nurse* I've bought very expensive ones but nothing comes close to this. Very very happy with this product"
        },
        {
            "Date": "Reviewed in the United Kingdom on 23 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I have bought this size and also the one roughly half the size, both are excellent. This one comes with the outer sleeve which helps it stay colder longer. I highly recommend them if you like your cold drinks fridge cool."
        },
        {
            "Date": "Reviewed in Italy on 23 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Il prodotto è ottimo. Materiale buono e tiene perfettamente il freddo anche due giorni. Bello pure il colore. Unico difetto é il tappo che essendo di plastica ha quel odoro diplastics che per mandarlo via ci vuole un sacco di tempo."
        },
        {
            "Date": "Reviewed in the United Kingdom on 22 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great product, as described."
        },
        {
            "Date": "Reviewed in the United Kingdom on 22 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "i like the color and its really great in keeping water cold."
        },
        {
            "Date": "Reviewed in Canada on 22 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I have both Thermoflask and Iron Flask water bottles and wanted a bigger one. At 20$ less than the big brand competitors I was slightly worried. As it stands now the quality is on par with the others so I am pleased. It holds ice overnight with no problem and thats a big win for me.\n\nThe only “con” if i’m being honest, is the cover for it.(This does not affect the stars as this review is for people who are wondering about quality of the water bottle) the cover seems like an afterthought and kinda tossed at it. Its not poorly made its just basic and it looks like i tried to make it."
        },
        {
            "Date": "Reviewed in the United States on 21 July 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "24hrs? Hahah! If you are thinking this is a y**I, it's not even in the same league.\n\nIt won't get super cold (too little insulation) and the top is really too small of an opening to easily get ice in it.\n\nTo their credit, there are a bunch of straps and types of tops to loose before you use them but please be very careful of the default top as it absolutely needs the straw thing to work and the straw thing loves to fall off and roll places when you're filling it.\n\nAll in all, a stainless (or maybe it's just aluminum) container for under 30 isn't bad these days but this is not really any better than wrapping a 2L bottle in a towel at the beach - just know what you're getting."
        },
        {
            "Date": "Reviewed in Saudi Arabia on 21 July 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I purchased this waterbottle a three months ago and have been very disappointed with it. The main issue is that the straw makes an extremely loud, annoying noise when I try to drink from it. It makes a high-pitched squeaking sound that is frankly unbearable. I've tried adjusting the straw, cleaning it, and everything else I can think of, but the noise persists.\n\nOn top of that, about a replacement, as this seems to be a manufacturing defect, but they said the product is non-returnable. So I'm stuck with a waterbottle that I can't even use because the straw is defective.\n\nI would not recommend this waterbottle to anyone. The noisy straw makes it completely unusable, and the lack of a return/replacement policy is very frustrating. Save your money and buy a different brand that actually works properly. This has been a very disappointing purchase."
        },
        {
            "Date": "Reviewed in Germany on 20 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Alles gut"
        },
        {
            "Date": "Reviewed in Canada on 20 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Je le remplis de glasse et je rajoute l'eau et 24 heures plus tard j'ai encore de la glasse dans la tasse. ( je travail dans la construction et ma tasse est dehors tout la journée) je le recommande fortement."
        },
        {
            "Date": "Reviewed in the United States on 19 July 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Had it for about a year and it won’t stop leaking now. :("
        },
        {
            "Date": "Reviewed in Canada on 19 July 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Had leaked and the fabric has teared up."
        },
        {
            "Date": "Reviewed in Saudi Arabia on 18 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "يحفظ البرودة والحرارة وماندمت اني شريته ويجي معه حزام"
        },
        {
            "Date": "Reviewed in Germany on 18 July 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Die Flasche ist schnell geliefert worden.\nSie hält troz direkter Sonnenbestrahlung im Sommer lange kalt (warm habe ich bisher nicht getestet).\n\nLeider muss ich jedoch bemängeln das die Flasche, insbesondere die Verschlüsse, und die Tasche sehr stark nach Chemie stinken, trotz mehrmaligen Spülen und Waschen.\nIch hoffe sehr der Geruch verfliegt bald."
        },
        {
            "Date": "Reviewed in Canada on 17 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Gourde facile a nettoyer, isothermie très satisfaisante.\nMais attention car la texture \"Granité\" de la gourde peut abimer les table/bureau en acier"
        },
        {
            "Date": "Reviewed in the United States on 17 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This stays cold for a longgggg time. Can’t go wrong for the price."
        },
        {
            "Date": "Reviewed in Germany on 15 July 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Bis jetzt ist mir der Stränge geruch aufgefallen und die Deckel sind ein wenig billig aber im großen ganzen ist die okay . Weiß jemand vielleicht ob man die Hülle in die Waschmaschine stecken kann"
        },
        {
            "Date": "Reviewed in Canada on 15 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Moi-même"
        },
        {
            "Date": "Reviewed in Italy on 14 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "prodotto che tiene benissimo la temperatura sia a freddo che a caldo, ha una qualità dei materiali e una finitura eccezionale. complimenti alla fabrica"
        },
        {
            "Date": "Reviewed in the United States on 14 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great water bottle. Good quality and keeps beverages cold. I use for when playing Pickleball. Come with 3 different tops which make for versatility. Will buy a larger size."
        },
        {
            "Date": "Reviewed in the United States on 13 July 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "It broke after the first month of use. The the lid leaked a bunch"
        },
        {
            "Date": "Reviewed in the United States on 11 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "The bottle hold a good amount of water and keeps it cold for more than a day!! I was worried that the material on the outside wasn't strong enough to hold the full bottle. It turned out the clasp for the strap gave out first! it could be made with a better material. That is the only short coming with this item!"
        },
        {
            "Date": "Reviewed in Italy on 10 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Tutto il giorno fuori e l'acqua rimane fredda, il tappo con la cannuccia non perde una goccia d'acqua, al massimo forma un po di condensa sul tappo e anche se la bottiglia viene tenuta al sole al suo interno rimane fredda"
        },
        {
            "Date": "Reviewed in Spain on 10 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Excelente, muito bom mesmo!"
        },
        {
            "Date": "Reviewed in the United States on 9 July 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Lid broke after I took it apart 1 time to clean and wash out. The lid straw no longer makes a proper seal to be able to suck water out thru the straw. Otherwise amazing bottle and keeps cold for days especially with thermal sleeve over it."
        }
    ]
}