{
    "Category": "Amazon",
    "Product Name": "Lefant Robot Vacuum Cleaner and Mop, Robot Vacuum Cleaner 4000Pa, Lidar Navigation Laser, Multi-Floor Mapping, Virtual Boundary, Small body 32cm Dia, WiFi/App/Alexa, Ideal for Pet Hair, Carpet, M1",
    "Product Image": "https://m.media-amazon.com/images/I/61Xy4e4SjUL.__AC_SX300_SY300_QL70_ML2_.jpg",
    "Unique Key": "B0C7QPZ5JP",
    "Clean URL": "https://www.amazon.com.au/Navigation-Algorithm-Boundary-Self-Charging-M1/dp/B0C7QPZ5JP",
    "Brand": "LEFANT",
    "Average Star": "4.4 out of 5",
    "Reviews": [
        {
            "Date": "Reviewed in Australia on 24 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The product effectively fulfills its intended purpose, and its cost-effectiveness is commendable."
        },
        {
            "Date": "Reviewed in Australia on 23 August 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I've just had the M1 delivered.\nI bought it after reading quite good reviews from happy customers.\nIt is currently on charge, I haven't used it yet!!\nWhilst I'm waiting for the battery to charge I decided to look at purchasing spares that I presume I will need in the future. Mops, brushes, filters etc.\nAmazon sell only the brushes for the M1.\nBut the mops and filters are only available, on Amazon, through copy Chinese Sellers and they don't look the right shape.\nIf you go directly to the Lefant Site you can add these replacement accessories to your cart but upon check-out Australia is NOT available !!\nLooks like I might need to return the M1."
        },
        {
            "Date": "Reviewed in Australia on 23 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Does an excellent job in cleaning & mopping. It as very powerful cleaning action. Good customer service in issue resolution."
        },
        {
            "Date": "Reviewed in Australia on 22 August 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Play Video\nVacuum is done well - however a bit too loud.\nHaven't had a chance to test the mop yet."
        },
        {
            "Date": "Reviewed in Australia on 22 August 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "The robot is great, it cleans well.\nThe software is so terrible the company should be embarrassed. I’ve had robots half the price that have a better app. Not only is it badly translated to English, it totally ignores “no go zones” and doesn’t even have an option for “no mop zones”.\n\nI cannot use the mop function because I can’t keep it off the carpets."
        },
        {
            "Date": "Reviewed in Australia on 19 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I have a pup that sheds a lot of hair so this mini roomba vacuum was just amazing! The app is also easy to use and the mapping also works great! For the price it’s of great value"
        },
        {
            "Date": "Reviewed in Australia on 18 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "As others say battery life isn’t long but it just goes back to its dock after 1.5 hours to recharge then starts again so have had no issues - but I do have a small house.\nExcellent otherwise"
        },
        {
            "Date": "Reviewed in Australia on 13 August 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "As the title suggests, this is my first robot vac and it exceeded my expectations. It mapped the house really well, does a decent job and had above average sucking power. The battery gets through a whole House clean and it will recharge itself when low. The mop function is better than nothing but it won't change your life.\n\nOverall it performs well 80% of the time, occasionally it will forget where to charge or will clean a room for 60 seconds before going back to recharge."
        },
        {
            "Date": "Reviewed in Australia on 12 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This was our first robot vacuum and we couldn't be happier with this purchase. We definitely recommend this product."
        },
        {
            "Date": "Reviewed in Australia on 8 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "From the first clean this robot cleaner mapped perfectly. It seemed to work in a systematic pattern and covered all areas of my home, then took itself back to the recharge station. I have only used it a few times at this stage but very happy with the cleaner at this stage."
        },
        {
            "Date": "Reviewed in Australia on 7 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great on the hard floor. Also climbs on to about 20mm thick play mat carpet. Working as expected. Avoiding obstacles nicely, not missing areas to clean.\nHaven't used mop function yet. Good value for the money."
        },
        {
            "Date": "Reviewed in Australia on 7 August 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Good product. Battery life needs improvement. Overall does great cleaning and mopping."
        },
        {
            "Date": "Reviewed in Australia on 6 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I liked everything about it.\nLet it go and map your cleaning area.(it also cleans on that as well). Next time you use it, it will do it all by itself and go back to its docking station.\nControl it from your phone.\nCleans and vaccums at the same time.\nYou should see the amount of dirt comes out and I didn't even cleans rugs just laminate."
        },
        {
            "Date": "Reviewed in Australia on 4 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "We love our Lafant robo vac it does such a great job at vaccuming and mopping! We can set it on a timer for it to clean each night or even just set it to clean one area of the house."
        },
        {
            "Date": "Reviewed in Australia on 4 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Works well, great mapping features and has helped immensely being able to schedule a clean every couple days even when I'm not home"
        },
        {
            "Date": "Reviewed in Australia on 2 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Works great and good customer service"
        },
        {
            "Date": "Reviewed in Australia on 1 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Bought it when it was on sale, I think it very good value,as now I don't have to clean my floor very often"
        },
        {
            "Date": "Reviewed in Australia on 1 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "So easy to use and very powerful, I was completely surprised how well this worked, would recommend to everyone"
        },
        {
            "Date": "Reviewed in Australia on 31 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great robot vacuum at a great price. Very happy with the product."
        },
        {
            "Date": "Reviewed in Australia on 30 July 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "I paid $274 for this robot and on the next day the price dropped even lower to $259. I was still going to keep it, but after testing and comparing decided to return (by the way, still waiting for the refund 10 days after posting!).\n\nHere is my impressions about this vacuum:\n\n- It really struggles with mapping and often creates another mirrored map (see the picture).\n- Not the best climber comparing to Roborock S7 and Dreame D9 Max that I bought instead.\n- Pattern of vacuuming may be a bit chaotic.\n- Often struggles returning to charge even after being manually placed next to the charger.\n- Still does a good job on the hard floors and ok on the rugs (I would buy it for the big carpeted home yet!).\n- Small, compact and light, but built quality can hardly compete with some other models such as the Roborock.\n- Seller contacted me and offered the complimentary parts; it was nice but a bit useless considering that I decided to return the product.\n- They were still demanding to send them some videos although I mentioned a few times that the vacuum was posted back to Amazon.\n- All in all, even for $259 it’s not the best value, although it might be an option for under $200.\n\nPS I purchased this model after looking at some positive reviews on YouTube but my impression was very different. Will still give 3 stars considering some positive features."
        },
        {
            "Date": "Reviewed in Australia on 29 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This vacuum is fast, efficient and charming! Very quiet and works well."
        },
        {
            "Date": "Reviewed in Australia on 27 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Recently bought and used it three times for my 2-storey house. The lidar works great, quickly mapping the layout accurately and working its way around the house by itself. As long as you remove general obstacles (especially wires), M1 will cutely and automatically find its way. After a week, received the OTA update and saw that the M1's performance improved. Have not tried the mopping feature yet (as my house is mostly carpet). Able to identify stairs and find its way around chair legs. I have to clean the waste bin manually, but it's very easy to do. Very happy with the purchase. Value for money!"
        },
        {
            "Date": "Reviewed in Australia on 27 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This is our first robot Vacuum. We were wanting to try something that wasn't too expensive, we managed to get it for a great price on Prime Day. It was very well packed and we are impressed with the quality of the unit for what it cost us. The mapping function seems very intelligent so far. The app is user friendly. Great for a house with 3 cats and a dog as it cleans up lots of unseen dust and hair! Have not tried the mopping feature yet but very impressed with all features so far. The battery life has also impressed us as we have a large floor space to cover. We love our new member of the family, Lefant!"
        },
        {
            "Date": "Reviewed in Australia on 26 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Vacuums well, easy to set schedule, mopping not as good and water tank not big"
        },
        {
            "Date": "Reviewed in Australia on 24 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Have owned for 2 weeks now and is making house work so much easier and quicker. We love it!"
        },
        {
            "Date": "Reviewed in Australia on 24 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Bought as a replacement for my Viomi V3 which has served me well. Got it on special and have to soon great value for money. Runs every day to remove pet hair from the house. Most intelligent one I have seen for getting itself out of trouble! Everyday a full tank of pet hair. Highly recommend."
        },
        {
            "Date": "Reviewed in Australia on 22 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Loving this robot vacuum, it mops as well which is great I am able to clean all floors or select what rooms to clean all via the app which is easily useable. 10/10 product!"
        },
        {
            "Date": "Reviewed in Australia on 22 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This little vacuum is amazing! Got it on prime day for more than half price. Whilst it doesn’t have a self empty station, the charging dock is small enough to fit nicely under the sideboard so the robot is nice and hidden away. With regular vacuuming, the unit only needs to be emptied about once a week. It is great for picking up surface dust/debris off carpet but definitely still a place for a once a week go over with my stick vacuum. If a bulk of your house is hard floor like ours, it’s certainly worth the money. Navigates well under dining chairs to do a good enough job under the table after my messy little kids. Haven’t tried the mopping function yet but I only purchased for vacuuming anyway anticipating I’ll still need to do a weekly go over with the proper mop."
        },
        {
            "Date": "Reviewed in Australia on 20 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Works great, such good value"
        },
        {
            "Date": "Reviewed in Australia on 19 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Have been using it for a few weeks now. Does everything as intended. Makes vacuuming easy!!"
        },
        {
            "Date": "Reviewed in Australia on 16 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Vacuum works well and Navigation is good. The mop function doesnt function as well as what is expected and not great for areas that have both floor boards/ tiles and carpet.\nThe vacuum broke after about 6 months of use. Lefant replaced with new vacuum as it was covered under warranty. The customer support team is very responsive."
        },
        {
            "Date": "Reviewed in Australia on 16 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Vacuum is very good with good suction but mop is not good as there is not enough pressure applied while cleaning by the robot. Vacuum function is excellent with suction. Robot is very smart with mapping and going back to the charger when done. Overall happy with the purchase because of the good price."
        },
        {
            "Date": "Reviewed in Australia on 16 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Me and my husband wanted to try out a basic robot vacuum without breaking the bank and came across this Lefant robot . It was very easy to set up and use and does a decent job at cleaning up in between mopping. Because our home was a little bit bigger it didn’t map out everything properly but other than that we are satisfied customers"
        },
        {
            "Date": "Reviewed in Australia on 12 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "An amazing addition to my home. Does a great job"
        },
        {
            "Date": "Reviewed in Australia on 11 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Love how much dust it collects"
        },
        {
            "Date": "Reviewed in Australia on 7 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Very happy with the product, the app control and interface works great and easy to setup. Like how well it operates and able to scan the rooms. We would buy another one!"
        },
        {
            "Date": "Reviewed in Australia on 4 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I bought the Lefant M1 a werk ago and there's no looking back! Not only is it cleaning my home fastidiously but it's also enticing me to keep my home cleaner where it can't reach.\nI have laminate flooring throughout with one rug and then M1 easily breezes through on the lowest setting and removes all dust and dirt. When I follow up with the mopping function the mop barely gets dirty, that's how clean the floors are.\nFiguring out the mapping was a little difficult, particularly because it was important to me that the direction of the sweeping and mopping is the same as the floor boards. The M1 kept reverting to a perpendicular pattern until I played around with the location of the docking station. Once I found a location that enticed the robot to follow the alignment of the floorboards I was able to place the docking station in the location I favoured for it, and the robot still maintains the direction.\nOverall, I'm very happy with my purchase. It might be a little louder than I wish for, but the app allows me to sufficiently direct the robot from afar, so I can run it in any capacity while not at home."
        },
        {
            "Date": "Reviewed in Australia on 1 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great product! \n\nMy favourite feature is the mapping, which is very accurate.\n\nI would buy it again in the future."
        },
        {
            "Date": "Reviewed in Australia on 18 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Have been very happy with our Lefant M1. Very easy set up and use on the app. We had it scheduled to run frequently and, not only did run with no problems, it was very thorough indeed. A hard worker and very reliable.\nWhen interacting with customer service, they were promt to respond, worked with us, and made communications very easy.\nSuper happy with the machine and experience :)"
        },
        {
            "Date": "Reviewed in Australia on 18 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I like the ease of setup and the compatibility with Tuya platform so I don't need to install yet another smarthome app. The robot quickly maps out my floor area and does a good job in cleaning the floor.\n\nThe only minor complaint I have is the noise level, which is pretty loud. But I used my machine when the house is mostly empty and this is less of an issue for me persobally"
        },
        {
            "Date": "Reviewed in Australia on 14 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Excellent Product! We use it everyday and it is soooo easy to use with the app! Love the auto schedule function. We sleep, it vacuums"
        },
        {
            "Date": "Reviewed in Australia on 13 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "It is not as strong as a normal vacuum cleaner, but it does make life easier! It is great to keep the house clean. It's easy to use. I recommend this product."
        },
        {
            "Date": "Reviewed in Australia on 7 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "⭐⭐⭐⭐⭐\n\n\"Move Over DJ, We've Got a Cleaning Rave!\"\n\nI recently joined the robot revolution and welcomed the Leant Robot Vacuum & Mop into my home, and let me tell you, it's been a game-changer! No more tedious vacuuming and mopping for me – this little marvel does it all.\n\nNot only does it effortlessly glide around my large downstairs area, but it also leaves my floors sparkling clean. It's like having a dedicated cleaning crew without the hefty price tag!\n\nThe best part! I now have more time to enjoy the things I love, like hosting impromptu dance parties, knowing my floors are taken care of. Plus, setting it to work its magic overnight means waking up to sparkling clean floors – it's like having a silent cleaning fairy tiptoeing around while I sleep!\n\nConsider me a convert! I'll be recommending this cleaning dynamo to everyone I know. Trust me, you won't be disappointed!"
        },
        {
            "Date": "Reviewed in Australia on 2 June 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "I am no robo vac expert but these things have come a long long way. See attached picture for its mapping ability and room cleaning coverage. This is very good for the cheapo price (sub $300 AUD) when this item is 50% off.\n\nWhen doing its first map, you must remove all obstructions, put all chairs up e.t.c but after that it will navigate around all obstructions very well. It has not gotten lost or stuck once. Auto map save is OFF by default, so first thing you must do is go into 'map management' in the app and turn Map Save to ON.\n\nNo go zones works perfectly, but the room splitting function in the app is clunky. You only have to do it once I guess. And you will have to do it, as the first mapping will combine some rooms that need to be split.\n\nI have no idea how the mopping aspect works. Lets be real these vacs that drag a pad behind are not real mopping vacs, that's why it's so cheap. If you want a real mopping vac you need to get one with the spinning mops and the base station mop washer at 4x the price or more.\n\nWhy 4 stars? Well the rated battery and cleaning time does not even come close to what is listed, even on lowest power mode. The rated battery on the description is 4000 mAh. But when I look up replacement batteries for this vac they are all 2600 mAh. So I suspect if we open it up to change the battery we will see a 2600, not a 4000. But at this price you cannot complain too much."
        },
        {
            "Date": "Reviewed in Australia on 2 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great product. The app also makes navigation easy and maps the house nicely. You can select the rooms to be cleaned or do just the spot clean. It does a good job and is worth the buy."
        },
        {
            "Date": "Reviewed in Australia on 31 May 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Faulty charging, never charged from new, have no idea whether the product worked or not to its potential\nDisappointment by this product, not the first time I bought online and the product was faulty 👎"
        },
        {
            "Date": "Reviewed in Australia on 24 May 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "I like the cleaning as it removes a lot of dust despite my cleaning on a weekly basis. The mapping is not so great as it keeps missing my master bedroom and the bathroom. Beside of that, I like my vacuum and it helps me a lot with the house cleaning. Seller very cooperating to help resolving the issue. Thank you very much"
        },
        {
            "Date": "Reviewed in Australia on 23 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great little vacuum, love the spot cleaning and no go zones!"
        },
        {
            "Date": "Reviewed in Australia on 22 May 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Gift for daughter who loves it. Can’t connect via Bluetooth though."
        },
        {
            "Date": "Reviewed in Australia on 15 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great product. Terrific value for money. Cleans really well and just as effective and fully featured as many much more expensive models."
        },
        {
            "Date": "Reviewed in Australia on 12 May 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Play Video\nVacuum feature is good, mop not so much, as it doesn’t remove stains from the floor properly. Very satisfied with the product overall as it was an affordable option and does its job."
        },
        {
            "Date": "Reviewed in Australia on 12 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Good"
        },
        {
            "Date": "Reviewed in Australia on 9 May 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Using for carper and tiles. Is doing a good job.\nLike the feature of partial cleam.\nWould love feature like to program to clean only the carpet areas and tiles separately in the partial cleaning( Not adjacent ones) and include support for working in 5 Ghz and 2.4 Ghz"
        },
        {
            "Date": "Reviewed in Australia on 9 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I bought it as a secondary vacuum however M1 is powerful same as my primary vacuum."
        },
        {
            "Date": "Reviewed in Australia on 8 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Very happy with this product, very easy to program and is effective at doing what we expect it to do. Was easy to program multiple runs during the day at different volume levels e.g silent during the night when asleep. Would recommend this as a good value Robot Vacuum."
        },
        {
            "Date": "Reviewed in Australia on 7 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great robot for our place. It’s very easy to set up and as long as you empty after each clean it works wonderfully."
        },
        {
            "Date": "Reviewed in Australia on 6 May 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Quite good..mopping is a bit disappointment.. Lidar scanning and obstruction recognition needs more improvement..looks like thus cannot detect an obstruction if it is white or mirror or reflecting..may be new software upgrade would improve?\nCarpet cleaning is satisfactory..not excellent..\nBut overall it is indeed useful foe specific area cleaning."
        },
        {
            "Date": "Reviewed in Australia on 5 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This robot has been a game changer. Now it does the Vacuuming and not me. We send it off everyday day and it is a bit embarrassing to see how much Dog hair and dust it collects from the carpets each trip. The house feels much cleaner now. So glad we got the robot"
        },
        {
            "Date": "Reviewed in Australia on 5 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Absolutely perfect for our home. No more vacuuming up after the kids - it automatically starts the kitchen, living, two of the bedroom , bath and toilet once we leave the house. I empty it every day which takes maybe 30 seconds. Mopping is ok, but it doesn't best hand mop with warm water. The rader technology is amazing and very accurate. Very happy with this purchase."
        },
        {
            "Date": "Reviewed in Australia on 1 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great product. Easy navigation through app as well and maps the house nice and easy. Can select the rooms to be cleaned or do just the spot clean. Does a good a job and worth the buy."
        },
        {
            "Date": "Reviewed in Australia on 28 April 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Don't waste your time and look elsewhere - mopping didn't work from day 1, now the device doesn't even charge after 2 months and barely using it. Goodluck trying to get a response from this company to fix the issues"
        },
        {
            "Date": "Reviewed in Australia on 26 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "What a gamechanger this product has turned out to be. At first when I saw the price, I was skeptical thinking it won't be good. But it has been remarkable!\n\nThe LiDar technology and mapping function is great, it effectively maps all 3 levels of my house and vaccums each room sequentially and methodically, not just in random patters like other cheaper models do. You have to turn the 'auto save' button on to save the map, then you can pick to use whichever map you have saved. It has a really good anti-collision system and sensors to avoid falling down stairs, goes right to the edge of the stairs which I love so it doesn't miss a spot.\n\nThe suction is great, has 3 options between silent, normal and powerful which can be adapted for each room if required. App is great and very user friendly. Has the ability to do partial cleaning (pick a room) or just draw a square and it will do that area, or the whole floor and then returns to base once its almost out of charge or finished. Works in the dark too so you can turn it on whilst you are sleeping.\n\nVery very impressed with this product given the low price range, it is way better than cheaper models which don't have mapping technology or anti-collision. Only 1 very small downfall of this product is that only 1 person can log into the app at once. Not a huge deal, but sometimes if my wife logs in it logs me out. If that is the only negative comment I have, they clearly have done a good job with this one!"
        },
        {
            "Date": "Reviewed in Australia on 21 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Play Video\nEasy to connect easy to use been nearly a week and loving it"
        },
        {
            "Date": "Reviewed in Australia on 18 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "prompt delivery of order and order as described and works well."
        },
        {
            "Date": "Reviewed in Australia on 3 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I found the product to be highly effective and offering excellent value. I recommend it to anyone seeking their first experience with a robot vacuum at home, without any regrets."
        },
        {
            "Date": "Reviewed in Australia on 28 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "We absolutely love this Vacuum Robot. I switch it on. Go out & come home to clean floors. Works best if you lift up chairs on tables & move other objects. Easy to operate from the App on your phone. Just make sure you clean the cartridge after each time using it. This is simple to do. LOVE IT SO MUCH !!!"
        },
        {
            "Date": "Reviewed in Australia on 27 March 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "3rd time using and won’t charge up even though on charging dock. Really frustrating and waste of money"
        },
        {
            "Date": "Reviewed in Australia on 25 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I’ve set a time for daily cleaning, it’s great"
        },
        {
            "Date": "Reviewed in Australia on 24 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The product was well packed and is strong enough to clean carpets."
        },
        {
            "Date": "Reviewed in Australia on 22 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I was surprised that this robot cleans very well and intelligently, considering the low price compared to some others. It is saving me a lot if time. Once you get used to the quirky software, you can map up to three areas and set no-go zones where needed, which is very convenient. Customer support was very friendly too.\nThe only negatives are that the mopping function isn’t that great; I mean it doesn’t vigorously mop, it just drags a wet cloth over the floor, which is ok every now and then. And the software doesn’t come with any instructions, so you have to figure that out or ask support. All in all, very impressive."
        },
        {
            "Date": "Reviewed in Australia on 22 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Probably the best thing I’ve ever bought. I have lots of rugs and it has no problem even with high pile. Now if someone could design a robot to pick up toys…"
        },
        {
            "Date": "Reviewed in Australia on 20 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I just bought the robot few days ago and I love it. It’s work good, clean, save my time . Good value. Recommend for everyone."
        },
        {
            "Date": "Reviewed in Australia on 18 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Pros:Works ok. Lidar tech makes it more smarter. Powerful suction.\n\nCons: you can't turn off moping, you just have to remove the water from the compartment. Consumes power even when idle. I switched off the dock after the vacuum was fully charged, battery drained next day morning. This one need power supply always unless you turn it off physically. Moping is very light and doesn't dispense enough water even at high setting. Missed few spots while cleaning. App can be improved - very confusing options and limitations.\n\nI returned the product after 2 days"
        },
        {
            "Date": "Reviewed in Australia on 10 March 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Have to supervise all the time. Stop working for no reason. Doesn’t go back to the charger. I had cleaning robot before so I can see the difference. Not recommended."
        },
        {
            "Date": "Reviewed in Australia on 9 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Cleans pretty well, generally good value"
        },
        {
            "Date": "Reviewed in Australia on 6 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I purchased this after my old robot broke. I didn't want to spend a lot as it wasn't a planned purchase. After reading about quite a lot of reviews I decided on this one. The 50% off voucher made it cost just over $250.\nAnd it's great it's quiet which isn't a big thing for me I schedule it to do its work generally when I'm not in.\nIt does a great job vacuuming I can tell where it's cleaned something I couldn't always see with my other robot. All the bits that end up on the kitchen floor are always cleaned not scattered over the floor.\nThe app if being used for the basic functions is great. For the more sophisticated things like saving maps is not great.\nYou can manage the robot from anywhere so you can see where it's been and if it's got stuck somewhere from work or anywhere.\nGetting stuck is something it rarely does.\nIn summary if you want a good spec robot at a good price even at full price this is one you should consider."
        },
        {
            "Date": "Reviewed in Australia on 6 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Absolutely fantastic, we've had it for over a month now. We are really happy with the performance and the price we paid."
        },
        {
            "Date": "Reviewed in Australia on 4 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "It's a pretty cool Vacuum Robo, actually my first one, and best over others,\nI chose it over - Honiture, Eufy, Lubulelu.\nInternet connectivity was no issue - a tip for you and others, if on the wifi router, both 2.4 and 5 gig ssid names are kept the same, then devices automatically mitigate the right frequency.\n\nWhat I would like added is -\n1- Self-emptying water-filling station ( even if it is a cost-effective separate purchase or a bundle)\n2- Some algorithm which tells robo to not suck up cables and wires. as the floor is full of them\n3- Carpet identifying algorithm\n4 - It doesn't always climb up room floor difference of 2.5 cm\n\nLidar works well\nBranding is clean\nApp is robust\nspare brushes are awesome\nThe unboxing I watched had separate HEPA filters, but you just offered them so it's cool\n\nI am happy so far. I would like you to make cordless hand-held vacuums like Tineco ( In a simple white colour) I'll buy them quickly :)\n\nThanks"
        },
        {
            "Date": "Reviewed in Australia on 4 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great product. Cleans really well. Covers about 100 square meter in 90min with all the navigation. Keeps the floors clean despite the 2 kids. Great service, as I received an additional 4 filters for the machine"
        },
        {
            "Date": "Reviewed in Australia on 2 March 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Scared the buggery out of me when I turned it on! It started to talk to me. That's when I thought I'd better read the instructions. Haven't quite worked it all out yet but would recommend it. I have mainly wooden floors and the came up well.\nYou need to make life easy for it like removing cables and obstacles that will tangle it. Pretty obvious I suppose but I've never had one before.\nNext automated unit, lawn mower and beyond!!!!"
        },
        {
            "Date": "Reviewed in Australia on 26 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "really like this for the money I paid it was well worth it . very happy with it."
        },
        {
            "Date": "Reviewed in Australia on 26 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great vacuum for the price. Was able to use straight out of the box with no WiFi. Picks up so much stuff.\nMop function isn't great, does a very quick clean but doesn't clean stains from tiles, definitely need a mop and bucket to do a thorough job but for the price I think it's great."
        },
        {
            "Date": "Reviewed in Australia on 24 February 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "Otherwise it was good..."
        },
        {
            "Date": "Reviewed in Australia on 22 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I am very satisfied works super well with carpet and moquette. Recommend"
        },
        {
            "Date": "Reviewed in Australia on 17 February 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "The suction was ok but I could not connect to wifi as my home internet apparently is too fast and so the Robot is not compatible."
        },
        {
            "Date": "Reviewed in Australia on 16 February 2024",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "The vacuum function works well, though the mapping seems hit or miss. Mopping is very superficial. Won't get any stains out. Seems to wander aimlessly for the regular service going over some spots multiple times and others only once or not at all. Haven't yet got the partial area cleaning to work. Will try again later. Mapping function is hard to understand. By default, saving a map is turned off. Stupid! After turning it on, it saved a nice map, then when I wanted to sweep a particular area the map it showed didn't match the saved map. I could find nowhere to change to the saved map.\n\nFeatures good and bad:\nRuns for a long time, over two hours.\nPicks up a good amount of dust and debris\nMopping not very good\nCan cover a large area, though it isn't very systematic about it. Will do a partial room, leave to do someplace else, then return to the first room going over much of the same area again."
        },
        {
            "Date": "Reviewed in Australia on 14 February 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "In terms of sweeping and mopping it's doing good job. I couldn't linked my lefant device to mobile requested help a few times. Email response is not solving the problem. I would be happy if they call me to go through the instruction."
        },
        {
            "Date": "Reviewed in Australia on 11 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The robot vacuum arrived a few days later I bought it and in perfect condition. I was positively surprised by the instructions to help me set it up. The robot vacuum is efficient and is worth every single cent. I compared it with other brands and this one was my choice and I am happy I got it right. The seller is reliable and attentive as well."
        },
        {
            "Date": "Reviewed in Australia on 11 February 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Battery last for 2 hours of operation. Goes well into the charging dock when battery runs low. Mapping features is great. Smooth operation on hard and wood surface. Slightly bouncy on shag carpet. Value of money."
        },
        {
            "Date": "Reviewed in Australia on 10 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This has LiDar technology compared to the other 100$ cheaper option for same brand. I highly suggest buy this one as this is 100x time better in find obstacles and ways with the Lidar mapping tech. I bought the other one first but returned it next day to get this one. Great vacuum, no hassle, finds its way around easily and goes back automatically to its station once done. You can assign no-go zones, spot cleaning, multi map saving, and partial area cleaning by drawing a square on your map. It has silent, standard and strong modes for all your needs. Mop function is good but best value is its vacuuming"
        },
        {
            "Date": "Reviewed in Australia on 9 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Shows a colour map of your house on your phone app.\nIt also shows which areas are completed, which is very handy."
        },
        {
            "Date": "Reviewed in Australia on 6 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great product highly recommend for vacuuming!!"
        },
        {
            "Date": "Reviewed in Australia on 4 February 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Product stopped working, no longer recharging. Only used for 1 month. No response from their support team to rectify the issue."
        },
        {
            "Date": "Reviewed in Australia on 29 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "First robot we buy, cannot believe how easy it was to set up and how clever this thing is. It goes in everywhere and suction power is superb, got 3 levels but prefer level 2 to make battery last. First operation was to map the house, it did that perfectly with lidar system, battery went from 100% to 16% in 96 minutes, then charged to full in just under 3 hours. Dyst bin was 70% full although carpetscwas cleaned that morning. Worth the buy, very impressed."
        },
        {
            "Date": "Reviewed in Australia on 23 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Our old machine died and we needed to replace it. We looked at many different models and brands and landed on this one. We have had no issues at all and can't fault the product. It does a great job on both the hardwood floors and carpets. We also like the feature of being able to stop it from cleaning certain rooms if we want. We were pleasantly surprised by this vacuum."
        },
        {
            "Date": "Reviewed in Australia on 19 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Very easy to connect to wifi and setup.\nWorking well."
        },
        {
            "Date": "Reviewed in Australia on 18 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "We absolutely love this product. Easy to use and many many features that are found on the really expensive brands but at a really affordable price! Will definitely buy again"
        },
        {
            "Date": "Reviewed in Australia on 18 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I'm using it for over 2 months now and I'm extremely happy with this robot vacuum cleaner and it does it's job quite well. Powerful suction and quiet performance are it's highlights.\n\nOnly suggestion is to make changing the room I'd easily to switch between stored rooms in the app."
        },
        {
            "Date": "Reviewed in Australia on 17 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The product is really good and we also recommend to buy from this seller. Thanks"
        },
        {
            "Date": "Reviewed in Australia on 17 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great service. The product was fast-delivered, and as describe. Working perfectly, smoothly and easy to use."
        }
    ]
}