{
    "Category": "Amazon",
    "Product Name": "Chotto Motto Crispy Chilli Oil 212 ml",
    "Product Image": "https://m.media-amazon.com/images/I/61DObkYuQGL._AC_SX679_.jpg",
    "Unique Key": "B0BTM969DV",
    "Clean URL": "https://www.amazon.com.au/Chotto-Motto-Crispy-Chilli-Oil/dp/B0BTM969DV",
    "Brand": "Chotto Motto",
    "Average Star": "4.4 out of 5",
    "Reviews": [
        {
            "Date": "Reviewed in Australia on 2 August 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": ""
        },
        {
            "Date": "Reviewed in Australia on 4 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I really love this chilli oil, i always make sure i have at least 2 jars in my cupboard. But this time 2 of the three jars leaked in transit."
        },
        {
            "Date": "Reviewed in Australia on 10 March 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Not crispy or spicy enough, would prefer lao gan ma which is 1/4 price"
        },
        {
            "Date": "Reviewed in Australia on 6 March 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "I was initially disappointed with this oil because I was expecting with more crunch. But as I’ve used it more, I’ve come to really like it. I just use a tiny amount to enhance flavours as I can’t tolerate too much chilli. It’s actually quite good."
        },
        {
            "Date": "Reviewed in Australia on 17 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I love this chilli oil."
        },
        {
            "Date": "Reviewed in Australia on 4 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Loved this chili oil for the texture and su the chili flavours, for those who are looking for a spicy kick I would recommend something, but this is a great chili oil for those who van tolerate mild spice only"
        },
        {
            "Date": "Reviewed in Australia on 6 October 2023",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "I wasn’t a fan of this one. I was expecting the garlic and onion pieces to be crunchy but most of the ingredients were chewy and the garlic still had quite a raw uncooked flavour to it.\n\nThe oil flavour itself is nice but the texture isn’t what I’d describe as “Crispy”"
        },
        {
            "Date": "Reviewed in Australia on 19 August 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I put it on almost everything - I have gone through half a jar already and I’m already thinking I need a backup jar - and I want to give it as a present to all my sisters - it’s fantastic!"
        },
        {
            "Date": "Reviewed in Australia on 28 April 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Loved this. Great crunchy bits and nice and smoky. Not too hot."
        },
        {
            "Date": "Reviewed in Australia on 15 April 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This stuff is amazing. I used it on a very bland lasagne to give it a boost and it was so tasty. Full of delicious crispy garlic, you will definitely need a mint afterwards"
        },
        {
            "Date": "Reviewed in Australia on 25 March 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This oil is absolutely delicious. I have bought another 2 jars."
        },
        {
            "Date": "Reviewed in Australia on 16 March 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This taste is phenomenal, I’ve devoured a jar in under a fortnight. I put it on everything, eggs, sandwiches, cereal, icecream. It’s just so addictive. My wife thinks I have a problem. I think she’ll leave me and take the kids. She thinks that using chilli oil is an insult to her cooking. And it makes me gassy, and I smell like something has died inside of me.\n\nI got off track. Oil is great. Too expensive to use it like I want to. I’ll have to remortgage the house to buy more after my wife takes the kids to her mums."
        }
    ]
}