{
    "Category": "Amazon",
    "Product Name": "Tamagotchi Original Pink Glitter",
    "Product Image": "https://m.media-amazon.com/images/I/818YLF2+u0L._AC_SX679_.jpg",
    "Unique Key": "B0BSYLKG3M",
    "Clean URL": "https://www.amazon.com.au/TAMAGOTCHI-42941-Tamagotchi-Original-Glitter/dp/B0BSYLKG3M",
    "Brand": "TAMAGOTCHI",
    "Average Star": "4.5 out of 5",
    "Reviews": [
        {
            "Date": "Reviewed in Australia on 29 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Just like the original"
        },
        {
            "Date": "Reviewed in Canada on 12 August 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Super cute, super amusant"
        },
        {
            "Date": "Reviewed in the United States on 5 August 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Totally great stocking stuffer easy says what it does totally great purchase. I would recommend giving it as a gift."
        },
        {
            "Date": "Reviewed in the United States on 29 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I don't know how to keep this thing alive, but it's fun to try. I'd buy it again."
        },
        {
            "Date": "Reviewed in the United States on 26 July 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Presentación y funcionamiento excelente"
        },
        {
            "Date": "Reviewed in the United States on 24 July 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "cute and fun to play with. Sounds quality needs to be improved"
        },
        {
            "Date": "Reviewed in the United States on 3 July 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "We could never figure it out to make it work and by that time it was too late to return it from Amazon"
        },
        {
            "Date": "Reviewed in Japan on 29 June 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Don't think too much, just buy it."
        },
        {
            "Date": "Reviewed in the United States on 27 June 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "These are definitely not what they use to be and they die quickly"
        },
        {
            "Date": "Reviewed in the United States on 11 June 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I ordered 2 - different colors - one came as a Gen 1 and the other is a Gen 2 (didn't realize there were different generations?)\n\nMy 7 and 8 year olds are in tears because they keep their tamagotchis heath and hunger meters full, but never fails, day 3 they start frantically beeping with a skull suddenly die. Once this beeping happens, theres no way to stop it. Dead. Reset, repeat. Day 3 dies for no reason. I don't remember this happening with the Tamagotchis in the 90s. What a waste of money.\n\nI googled and a ton of forums say the same thing is happening to them with Gen 1 and Gen 2, which apparently is what these are. Some say you can't feed it snacks ever. (Dumb, then why is there a snack button then and why is this not mentioned in the instructions??). I don't remember not being able to feed snacks in the 90s. So after the second restart (waste of 6 days, and kids in tears) one of my kids tried to not feed snacks. Still dies for no reason on day 5.\n\nI want my money back. These are a waste of my kids time."
        },
        {
            "Date": "Reviewed in Spain on 19 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Ha gustado todo.Buen juguete"
        },
        {
            "Date": "Reviewed in the United States on 8 May 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This brought me back to my childhood. This is exactly the toy I played with as a kid and I love that they didn't change anything about it."
        },
        {
            "Date": "Reviewed in the United States on 17 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Es un buen regalo para un niño o una niña , ellos crean responsabilidad para tener su propia mascota es muy bueno se los recomiendo"
        },
        {
            "Date": "Reviewed in Mexico on 17 April 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Cumple con lo el propósito, tenerlo simplemente como coleccion"
        },
        {
            "Date": "Reviewed in the United States on 3 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Purchased for my daughter after seeing one of these on the movie Turning Red. She loves it!!! Great buy!!"
        },
        {
            "Date": "Reviewed in the United States on 2 April 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "After receiving the incorrect color, I did get the right one. Besides this, this little Tamagotchi is a blast from the past! People definitely compliment my Tamagotchi which I have hanging from my pant's belt loops! Battery life is surprisingly good too. It's on all the time even when dead and the battery still hasn't died."
        },
        {
            "Date": "Reviewed in the United States on 28 March 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "I ordered for my granddaughter and my kids said it did not have any directions. Be prepared to google what to do if it’s new to you."
        },
        {
            "Date": "Reviewed in the United States on 27 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "It’s still in the box. I’m sure it perfect, just not sure I want to raise it. 😂"
        },
        {
            "Date": "Reviewed in the United States on 24 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My eight year old got this as a gift. They haven't changed a bit since I remember them, and that is a good thing! Easy to use and set up - hers grew from a baby to teen to and then two more times to get to an adult. It did take a lot of work and if she didn't catch a sickness right away, it did die pretty quick. She loved feeding and watching it's happiness levels. The range of designs it comes in is great too! We look forward to seeing what we can do with amount of feeding and such to see if we can get different adults. It is a keeper and I would buy it again."
        },
        {
            "Date": "Reviewed in the United States on 18 March 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Got it for my daughter for Christmas. She loves it but when it’s time to clean up poop after her pet it just won’t do it! We looked at the instructions and did it correctly, but it still wouldn’t work so it keeps dying! It’s really cute but the one we got didn’t work well. I’m sure it’s just ours though."
        },
        {
            "Date": "Reviewed in the United States on 9 March 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Play Video\nMe remonta a la niñez, bellisima,"
        },
        {
            "Date": "Reviewed in the United States on 8 March 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "With kids being so used to tablets and phones, do yourself a favor and save your money on this one. Lasted 2 days of being used. The first day excitement, and the day after to bring it to school and let it beep all day and annoy your teacher. I wanted this to be a nostalgic purchase but lets face it, this was quality entertainment for the 90's, not todays youth lol"
        },
        {
            "Date": "Reviewed in Mexico on 29 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Me encantó,me parece genial el precio!"
        },
        {
            "Date": "Reviewed in the United States on 24 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Play Video\nThis actually works."
        },
        {
            "Date": "Reviewed in the United States on 24 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Bought this for my daughter, who had recently learned about this digital pet phenomenon. She loved it for the first month or two! We leave it at home often, so it’s usually in “Angel” mode 😉"
        },
        {
            "Date": "Reviewed in the United States on 17 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "It works good!"
        },
        {
            "Date": "Reviewed in Mexico on 15 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Todo excelente, ruidoso y molesto, justo como se esperaba"
        },
        {
            "Date": "Reviewed in the United States on 9 February 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "It was the perfect little stocking stuffer for kid. If you had one as a child, it's just as annoying as you remember. Kid thought it was fun for the first week. Sits in a drawer now, flying with the angels (dead pet). Until they are interested again and we reset it."
        },
        {
            "Date": "Reviewed in Mexico on 6 February 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Nunca me había dado cuenta que vienen en diferentes tamaños, este es buen pequeño . Funciona igual que el más grande al final de cuentas"
        },
        {
            "Date": "Reviewed in the United States on 25 January 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "The screen is really hard to read and the icons are hard to see. My daughter got frustrated after a little while of playing with it. Buttons weren't that easy to press either. I guess I also thought there'd be a little more to it. It's pretty basic."
        },
        {
            "Date": "Reviewed in the United States on 25 January 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Was so excited to get this my daughter has been wanting one for awhile and she was stalking the mail for this and the screen is very dark I can’t figure out how to adjust the picture so we can’t use it"
        },
        {
            "Date": "Reviewed in Mexico on 16 January 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Hola no tiene varios personajes y solo es una carita con ojos boca, y luego sueña toda la noche a pesar de que lo pone uno a dormir"
        },
        {
            "Date": "Reviewed in the United States on 8 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "much cheaper here than in stores, works perfectly, will buy again"
        },
        {
            "Date": "Reviewed in the United States on 7 January 2024",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Le regale a mi sobrina este tamagotchi y a los dos dias uno de los botones se daño (por lo que el tamagotchi muere cada 2 dias)"
        },
        {
            "Date": "Reviewed in the United States on 5 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Got them for 2 of my girls and they love them."
        },
        {
            "Date": "Reviewed in the United States on 5 January 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "It's just like the ones they had back in the day The only reason I'm giving it two stars because I wish there was a button to make it where the screen lit up It's kind of hard to see the icons when you're sitting in the room or living room or somewhere darker.. bought this for my daughter and she's 7 she does not have the patience for this lol"
        },
        {
            "Date": "Reviewed in the United States on 4 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Really cute and a great blast from the past. Kids loved it"
        },
        {
            "Date": "Reviewed in Canada on 4 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Il est pareil que celui que j'avais lorsque j'étais enfant. Ma fille l'aime beaucoup, même s'il bip parfois la nuit."
        },
        {
            "Date": "Reviewed in Mexico on 3 January 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Muy bonito y sirve perfecto a mi hija le encanto"
        },
        {
            "Date": "Reviewed in the United States on 3 January 2024",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "I got two for my 6 and 9 year old for Christmas. They were so good with taking care of it and were attentive to all its needs. Never ignored it and it just randomly died. Both of them. No warning. So we reset them and tried again. I even brought them to work with me to babysit them while they were at school. Died again after I fed it and played with it within 5 min. So dumb. The beeping is also so loud and annoying."
        },
        {
            "Date": "Reviewed in the United States on 29 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Bought for my 9 year old son and he LOVES it. So retro but so fun!"
        },
        {
            "Date": "Reviewed in Canada on 27 December 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Gave this to my daughter as a Christmas gift. She used it for 24hrs and it failed and lost everything. Poor cheap product will be returning."
        },
        {
            "Date": "Reviewed in Mexico on 26 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Muy bonito regalo"
        },
        {
            "Date": "Reviewed in the United States on 26 December 2023",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "My daughter got this for Christmas.. I wish I had not… trying to figure this out.. it’s small.."
        },
        {
            "Date": "Reviewed in the United States on 20 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Bought this for my granddaughter who loves her and now it’s Care is now a family affair"
        },
        {
            "Date": "Reviewed in Mexico on 20 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Es un juguete que trae buenos recuerdos. Muy buena calidad. Y excelente para regalo, le encanto. 100% recomendable."
        },
        {
            "Date": "Reviewed in the United States on 14 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Arrived perfectly well, on time, and operates as designed. Terrific gift."
        },
        {
            "Date": "Reviewed in the United States on 13 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "EXCELENTE"
        },
        {
            "Date": "Reviewed in the United States on 13 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My cousin loved it."
        },
        {
            "Date": "Reviewed in the United States on 5 December 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "These are just as good as when I was younger and had them. I got three different designs and all are adorable. The girls are going to love them ."
        },
        {
            "Date": "Reviewed in Mexico on 30 November 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Sin duda alguna me hizo recordar mi niñez, aunque en esta ocasion no era para mi, si no para mi hija, le encantó, es su juguete favorito\nEs pequeño, pero de buen tamaño, igualito a la version original, trae sonido, y opción para ponerlo en pausa y silenciarlo"
        },
        {
            "Date": "Reviewed in the United States on 24 November 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Cute colors and design. This was a gift and boy did the child love it. I have no specifics on how it works but I can say it does make a lot of noise ( almost annoying at times). The good part from what I'm told is it can be muted."
        },
        {
            "Date": "Reviewed in Mexico on 23 November 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Para jugar"
        },
        {
            "Date": "Reviewed in Mexico on 20 November 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Tuve mucho cuidado porque no quería que me tocara el juego de los números, por lo que leí en todos lados, ese solo les tocaba en el gen uno, sin embargo yo pedí el gen dos y trae el juego de los números, que es súper aburrido, les recomiendo el otro juego."
        },
        {
            "Date": "Reviewed in the United States on 13 November 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Excelente"
        },
        {
            "Date": "Reviewed in the United States on 1 November 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "It is a very annoying toy and hard to read and set up. My granddaughter gave it up quickly."
        },
        {
            "Date": "Reviewed in the United States on 30 October 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "I forgot how needy these pets are. the beeps are too loud to bring to work. pet dies every day while I'm at work."
        },
        {
            "Date": "Reviewed in the United States on 28 October 2023",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "You cannot see the screen. Need light in background."
        },
        {
            "Date": "Reviewed in Mexico on 23 October 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Si trae batería, el color es lindo aunque el sistema es ordinario, no tiene luz. Pero los niños son felices con eso."
        },
        {
            "Date": "Reviewed in the United States on 21 October 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Excellent quality"
        },
        {
            "Date": "Reviewed in the United States on 19 October 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Our granddaughter wanted one for years. She has not put it down. Great entertainment"
        },
        {
            "Date": "Reviewed in the United States on 17 October 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "es como lo recordaba del pasado, buena compra"
        },
        {
            "Date": "Reviewed in the United States on 9 October 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Recomendado."
        },
        {
            "Date": "Reviewed in the United States on 26 September 2023",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Bought the berry one for my daughter for her 7th birthday. The buttons stopped working and the screen was glitching, so I ordered one on Amazon to replace it. We had this one for about 2 weeks and it started to do the same thing. Very disappointing!!"
        },
        {
            "Date": "Reviewed in Mexico on 23 September 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Bueno, bonito y a buen precio. Es realmente hermoso! El detalle del glitter no se aprecia en la foto pero es muy brillante"
        },
        {
            "Date": "Reviewed in the United States on 23 September 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I bought this for my daughter for her 8th birthday. It’s cute and he loved it until we figured out you can barely see the screen and have to use a flash light. The loudness is obnoxious, but we figured out how to shut that off. I babysat while she was in school. Just before it evolved into an adult, the “B” button stopped working, so we couldn’t care for it and it died. Even I was disappointed after putting so much time and energy into caring for it. I pulled the battery out and reset it, but hours later the same thing happened. Fortunately, we can still return it since we haven’t had it long. I’m not impressed with his boring it really is."
        },
        {
            "Date": "Reviewed in the United States on 5 September 2023",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Dentro de la espectativa para precio"
        },
        {
            "Date": "Reviewed in the United States on 18 August 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Just like the original"
        },
        {
            "Date": "Reviewed in the United States on 6 August 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This was nostalgic and fun to play with over the summer."
        },
        {
            "Date": "Reviewed in the United States on 4 August 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "6 year old begging for a pet, we already have 2 dogs and fish. Mom, not wanting to clean up after anything else, informs son, it will be his responsibility. Son argues that he has kept a plant alive for a year. Insert tamagachi. After 1 day with this toy, son reconsiders the idea of being responsible for a living creature. Thank you tamagachi 🙏🏽"
        },
        {
            "Date": "Reviewed in the United States on 30 July 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I Love It You Should Buy\nSo Good percfet Quilty"
        },
        {
            "Date": "Reviewed in Mexico on 29 July 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Buen producto"
        },
        {
            "Date": "Reviewed in Mexico on 25 July 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Buen precio"
        },
        {
            "Date": "Reviewed in the United States on 21 July 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "MI HIJA ESTA FELIZ"
        },
        {
            "Date": "Reviewed in the United States on 2 July 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "perfect keychain size! Tip: if you do not want your tamagotchi to have sound push buttons A and C at the same time and the sound will go off. To turn the sound on again push A and C once more. perfect virtual pet!"
        },
        {
            "Date": "Reviewed in the United States on 30 June 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Got this as a gift for my mom, because she remembered me playing one as a kid. She has turned the poor thing into an alien so many times, I don't even think she touches it anymore. But honestly watching her trying to take care of it for days was pure entertainment 10/10."
        },
        {
            "Date": "Reviewed in Mexico on 17 June 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Se traba y hay q estarlo reiniciando"
        },
        {
            "Date": "Reviewed in Brazil on 13 June 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "O produto é original o mesmo Tamagotchi dos anos 90, só com com uma nova roupagem no Design de sua carcaça para deixar ele mais moderno aos dias atuais. Mesma jogabilidade e já vem incluido uma bateria nele mesmo pronto para o uso. Como também seu clássico manual. O melhor de tudo é a apresentação da caixa que é decorada com várias ilustrações realmente muito bonita, Bandai Namco está de parabéns."
        },
        {
            "Date": "Reviewed in Mexico on 22 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Realmente fácil de usar"
        },
        {
            "Date": "Reviewed in the United States on 17 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Just as I remembered"
        },
        {
            "Date": "Reviewed in the United States on 15 May 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Forgot I bought it, was super stoked when I got it. Just like the 90’s it is always on an pretty loud and need constant attention like a real pet. I’m in my 30s and love having it on my keychain I thankfully work in a very loud work environment, so I don’t hear it screaming when it takes a poop while I’m at work. Cute and I’m glad they’re back !! It wouldn’t let me post a pic but I have the cool little duck guy. I like how they kept the technology 90’s simple and didn’t mess with the original layout. 10/10 amusing."
        },
        {
            "Date": "Reviewed in the United States on 23 April 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My son put my other one in the toilet so, I just had to get a new one and I saw this pink glitter Tamagotchi and had to get it! It’s just perfect and it’s translucent and a pretty shade of pink. 90’s nostalgia 🩷"
        },
        {
            "Date": "Reviewed in the United States on 26 March 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This product is great. I use it a lot and its pretty fun. Had tough figuring it out at first but I got through it.\nTIPS:\nif you need to pause it, go to the clock and press A and C to reset it. keep it at where it says \"SET.\" and your tama will not die, grow, or make noise.\n\nif it is being to loud, simply hold the C button and press A. it will silence your tama. to turn the audio back on, press the C button and press A again.\n\nread the instructions for how to use the icons on your tama.\n\noverall great toy. 11/10."
        },
        {
            "Date": "Reviewed in the United States on 16 March 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I got this as a Christmas present for my 8 year old daughter... How nostalgic. These things were very cool when I was a kid. I can't believe they came back into \"style\"... I was super excited for her as I knew how much I enjoyed mine as a kid but they are just not made the same. After a month it quit working. It does not respond to the buttons/commands, or do the activities it is supposed to do. Battery is not dead. Would not recommend."
        },
        {
            "Date": "Reviewed in the United States on 7 March 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I have no complaints, it made me relive my childhood."
        },
        {
            "Date": "Reviewed in the United States on 24 February 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My niece loves it 💕"
        },
        {
            "Date": "Reviewed in the United Arab Emirates on 22 February 2023",
            "Stars": "3.0 out of 5 stars",
            "Review Text": "I got it as a gift for my daughter and it’s really cute but it’s super boring. I had one as a child and it had more features than this one. It’s a bit confusing for kids, and it ended up abandoned after 2 days."
        },
        {
            "Date": "Reviewed in Canada on 9 February 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Just as advertised, fun virtual pet"
        },
        {
            "Date": "Reviewed in the United States on 8 February 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Daughter played with it for a week then the noise went off and never turn back on. Had to reset it. Then it keeps on dying on its own when you watch it. It also hard to see the figure"
        },
        {
            "Date": "Reviewed in the United States on 4 February 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Dejo de hacer sonidos y no se puede corregir ☹️"
        },
        {
            "Date": "Reviewed in Canada on 22 January 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "not broken or in bad shape, had no difficulties with it so far"
        },
        {
            "Date": "Reviewed in the United States on 20 January 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Love this. My kids love it. Not a fan that you must tend to it daily in order to keep it alive"
        },
        {
            "Date": "Reviewed in Canada on 15 January 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "The screen characters and icons are barely visible.\nI do not recommend it.\nWaste of money."
        },
        {
            "Date": "Reviewed in the United States on 7 January 2023",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "I was so excited to buy this for my daughter for Christmas and it will not live past 3 years. We have tried numerous times and she is so disappointed everything that we had to throw it away. Please do NOT waste your money!"
        },
        {
            "Date": "Reviewed in Canada on 5 January 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Donner en cadeau à ma fille 8 ans, elle aime bien s’en occuper. J’ai du prendre le temps de bien découvrir le fonctionnement avec elle.\n\nN’oubliez pas de lui faire couper le son ça il peut sonné a n’importe quel moment 🤪\n\nMa fille de 6 ans n’a aucun intérêt par contre"
        },
        {
            "Date": "Reviewed in the United States on 2 January 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Exactly the same as the ones we had as kids! Gave this as a gift to a 9yr old but now I want one myself!"
        },
        {
            "Date": "Reviewed in the United States on 29 December 2022",
            "Stars": "1.0 out of 5 stars",
            "Review Text": "Ordered it and a case. Does not specify it is super tiny and the case is not. Definitely not worth what I spent. Not to mention how incredibly cheap it looks. It is a piece of junk. My daughter was so upset with it at Christmas."
        },
        {
            "Date": "Reviewed in Canada on 17 December 2022",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Fun to play with! Long battery life"
        },
        {
            "Date": "Reviewed in the United States on 8 December 2022",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "I was so excited to get this as I am a 90's kid and nostalgia and all. But the game on mine is LAME. The character looks left and right and you have to press the button facing that direction. I don't recall such a lame game when i had these growing up. Just based on the game alone I'd give this a 1 star. It literally is no fun to play at all with a game like that."
        },
        {
            "Date": "Reviewed in the United States on 25 November 2022",
            "Stars": "2.0 out of 5 stars",
            "Review Text": "Mine won't stop beeping an my daughter was very disapointed"
        }
    ]
}