{
    "Product Name": "CyberPowerPC Gamer Xtreme VR Gaming PC, Intel Core i7-13700F 2.1GHz, GeForce RTX 4060 Ti 16GB, 16GB DDR5, 1TB NVMe SSD, Wi-Fi Ready & Windows 11 Home (GXiVR8040A14)",
    "Product Image": "https://m.media-amazon.com/images/I/71cvBlbsQwL._AC_SX425_.jpg",
    "Unique Key": "B0CBL8N3FC/",
    "Reviews": [
        {
            "Date": "Reviewed in the United States on November 29, 2023",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I've had a Cyberpower PC for about 7 years and it never let me down. In 2023 I was able to play Cyberpunk 2077 on high settings even with a mere Nvidia GTX 1060 (3 GB) and that machine's now-ancient Intel i7-7700. But I felt it was time to upgrade and after a good week or two of comparisons I decided on this machine.\n\nWhat you should know right away is that this is a great computer if you're gaming at 1080 (which many sources agree is the best ratio for gaming, things get trickier at 4K and above). I ran a performance test from Cpu User Benchmark and the computer's results were \"UFO\" in all categories, the site's highest possible grade. This unit comes with an Intel i7-13700F, a 16GB Nvidia RTX 4060 ti, and 16 GB of DDR5 ram. The motherboard is an MSI Pro B760 VC wi-fi, a solid board from a reliable brand (though the parts in this computer may differ from user to user depending on what's available when it's built). This is a solid, solid machine. It might not be the same as an ultra-insane $5,000 supercomputer but if you have that kind of cash lying around you're better off sailing on your yacht anyway.\n\nThere was much talk of the RTX 4600 being an awful video card so if you're aware of that you may be reluctant to go for this build. The problem wasn't that the card itself was bad though, only that it wasn't seen as enough of a performance jump over the previous generation of cards to warrant the price. Even so, this card is specifically the 4060 *ti*, a better version of the card, and one that also has 16 GB of video ram rather than the 8 GB on the standard 4060, an amount that may soon be insufficient for gaming. This card is VERY good for gaming. In the aforementioned Cyberpunk, for example, my previous 1060 build ran the game at about 60-70 FPS with settings high and ray-tracing, a notorious FPS hog, turned off. On this new machine I ran the same game with ray tracing turned ON and every setting at maximum and averaged a fantastic 110 FPS. With ray tracing turned back off it reached as high as 145. Cyberpunk is regularly featured in tests of the most demanding modern games, so if this computer runs it that well I'm confident about its overall performance. The solid state drive also loads the game incredibly fast, about 8 seconds from clicking \"continue game\" to actually playing it, a massive jump from the 30 or so seconds it took for my previous hard drive. I'm satisfied that this computer will keep me gaming for years.\n\nOne thing that needs to be noted is the computer's CPU fan, which several users have said is inadequate. While the computer does come with just a simple air cooler, my temperatures have so far been perfectly fine. At idle (desktop, internet, etc.) I'm getting an excellent 32-35 degree average. During gameplay my average was about 70-80, with a peak at about 85. Some may think that this is overly hot but my previous build was averaging 45 at idle and about 90 for gaming and it ran for years. All the same I do understand the desire to have the best cooling to ensure the proper lifespan. Some people have said that the i7-13700 runs hot, so you may want to invest in a stronger cooler. Other reviewers mentioned getting a \"Peerless Assassin\" so I did the same. It was around $30, very affordable if you want that extra piece of mind.\n\nSetting up the computer was incredibly easy. I wondered how this would work being that the machine does not come with a dvd drive, the only way I've ever installed Windows in the past. I was quite surprised (and intrigued) by the fact that the installer comes in the form of a little paperboard USB stick. You simply snap the stick from the \"card\" that it's mounted to (don't throw it away when you open the box!), plug it into a USB slot, and turn the computer on. That's it. Windows will install, and you don't even need to mess with the BIOS or install drivers to get the computer to recognize the mouse and keyboard (which I've had to do when reformatting other computers in the past). Once running, the computer ran a program to get the drivers it needed. I didn't even have to install any Windows runtimes, something that's normally required before you can play games. Everything in this computer was just ready, plain and simple. After having gone through a month-long headache of messing with replacement parts on an unrelated computer, this was very much appreciated. Speaking of mouse and keyboard this computer comes with very nice ones, which I'll keep for backup for when my current ones break down.\n\nI don't have much more to say, really. The RGB lights are beautiful, adjustable and come with a simple remote control. The device supports wifi and is apparently bluetooth enabled. Anything I've plugged into it, from a USB headset to an Xbox1 controller, works immediately. My gaming test delivered excellent results. The computer's performance test gave back the highest rating on CPU User Benchmark. The parts are modern and the machine was incredibly easy to set up. So far I can't think of anything I don't like about this machine, and if it holds up as well as my previous Cyberpower unit I'll be happy with it for years to come.\n\nShould anything major change I'll come back and update this review. As it stands, I am more than pleased with my purchase.\n\nEDIT 12-8-23: I've received and installed the Peerless Assassin 120 cooler that I mentioned in my review and it's definitely made a significant difference in temperatures. Playing Cyberpunk 2077 with the computer's standard cooler yielded temps between about 75-95 degrees on average. With the PA cooler I'm playing the same game at an average of about 55-60, no higher (so far) than 70, and I've gained about 10 FPS in the process. If you'd like to extend the lifespan of your CPU I can now recommend replacing the stock fan with the PA 120 or another highly-reviewed cooler."
        },
        {
            "Date": "Reviewed in the United States on July 6, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Picked up the PC for gaming and 3d rendering/unreal 5 use.\n\nWorked straight out of the box, booted up right away. All components were seated correctly, still checked all the connections for good measure due to shipping. No damage to box either.\n\nThis thing is a beast for the price. I've been able to run every game that I play in 1440p high/ultra at a high frame rate to match my monitor, and the 16gb of vram on the 4060ti is perfect for the rendering work that I do.\n\nHighly recommend this build."
        },
        {
            "Date": "Reviewed in the United States on July 20, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "We couldn't be happier with this purchase. From the moment we unboxed it, we could tell that this PC was built with quality in mind. The sleek design, combined with the customizable RGB lighting, adds a nice aesthetic touch to our gaming setup.\n\nPerformance:\nThe performance is outstanding. Equipped with a high-end graphics card and a powerful processor, this PC handles the latest games on ultra settings without breaking a sweat. The gameplay is smooth, and the load times are impressively fast thanks to the SSD. You can also multi-task seamlessly, running multiple applications and streaming without any lag.\n\nOverall:\nI highly recommend the CyberPower Gaming PC to anyone looking for a high-performance gaming rig that doesn't break the bank. It has exceeded expectations in every way."
        },
        {
            "Date": "Reviewed in the United States on June 16, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "The computer is very fast and sleek. I bought this as an upgrade to my original computer and it works perfectly. The restart and power on speeds are excellent and the fps gain is noticeable. My one issue is that the fans are slightly loud but not impossible to tune out. From a personal view, the computer wouldn't fit into my cabinet but after removing the stilts, it fit very well. The computer was designed well for games and the design is clean, colorful, and nice to look at. We bought on father's day and for the reduced price, it is very good."
        },
        {
            "Date": "Reviewed in the United States on July 19, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I read tons of reviews and compared with dozens of other gaming PCs, very satisfied with this particular setup. Professionally packaged, excellent quick setup guide, worked seamlessly right out of the box. Fast, and silent. I transitioned from an Alienware Ryzen 5 and I'm actually much more pleased with Cyberpower PC's Gamer Xtreme VR gaming PC, a solid and elegant/cool case, 16GB GPU performance and quiet fans. Oculus connected for VR games off Steam app - very , very smooth! 100% recommend this box as setup by CyberPowerPC."
        },
        {
            "Date": "Reviewed in the United States on July 22, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Upgraded from a pc I bought 4 years ago and the quality difference between the two is night & day. Easy set up, awesome performance, and great price."
        },
        {
            "Date": "Reviewed in the United States on May 22, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I needed to replace my ROG laptop and figured I'd buy something that can actually be updated with new hardware instead of a whole new system.\n\nThis is a great pre built that runs all my editing software; video, audio, imaging, etc. As well as runs all my games perfectly. It's also a good price over other prebuilts and while maybe you can built it yourself. Cheaper this was a great solution to buy ready to use and the pice difference wasn't so much that it didn't make sense to not just buy this great prebuilt.\n\nOccasionally the fantasy are a bit loud but normally only for a few seconds to a minute. So far under a heavy load editing or gaming it's pretty quiet. Again fans kick in for a bit to cool things off then it's quiet as a mouse again."
        },
        {
            "Date": "Reviewed in the United States on July 4, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Upgraded from a bit of an older system (GTX 1650 Super, i5 10th Gen, 16GB DDR4 Ram) to this and I could not be happier. Anything I couldn't run well on my old computer runs super smooth now on this current PC, this includes the speed outside of games as well. The one and only complaint I have is the fans can get a bit loud during heavy loads but if you can either replace them or just get past that then this system is perfect for 1080/1440p usage. Another thing too is how easy it was to setup and how there was no bloatware pre installed whatsoever. As for the case, I personally love the tempered glass on the side which provides a really cool and aesthetically pleasing look at all the RGB. Finally, I'd like to mention the price, for 1300 this is a pretty good deal and I would really recommend it if you have no experience whatsoever with building your own PC."
        },
        {
            "Date": "Reviewed in the United States on July 23, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I just got this desktop to get an upgrade, Paid about 1099 before tax on prime day. All the games that were stuttering before on my previous 2060 are smooth with no frame drops. Tested with Helldivers 2 and Cyberpunk. Just what I needed. Unless something happens, it is very good specs for the sale price. Hopefully it keeps up well with next gen games made for the 5 series.\n\nUpgrades I did: I heard this unit got a bit hot, so I bought a Peerless Thermaltake cooler, and some additional ram other reviewers recommended. Bit of a pain to install, but not terrible. Its not too loud when gaming on high settings. Note: photo is post install of the new cpu cooler, it won't come like that.\n\nI appreciate the included keyboard and mouse, and wifi fin.\n\nOne thing to note: Make sure it is delivered in a secure location. They ship it in a very visually loud box, so it could be easy target for porch pirates."
        },
        {
            "Date": "Reviewed in the United States on July 26, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Lights only worked for 10 seconds after turning on the pc. Called the customer support number that came with the computer and they trouble shot for 1 hour until we found that one wire was not connected properly (by manufacturers).\n\nThe first customer support guy (not mentioning his name) hung up or was disconnected and he never called me back (although he definitely had my number). So I called again and spoke with someone else. Reconnected the wires and the lights work now. I asked the the tech guy how to change the colors on the computer from rainbow to different colors and he said they don't know how to do that. He gave me a number for Asus the software company and they didn't know how to do that either. What a waste of time!!! Why aren't customer tech support trained to know the product? So I am stuck with rainbow colors. Not the end of the world, but there is a way to control the colors, but I can't figure it out... And got no help.\n\nBesides that, computer seems to work fine!\nP.S. The one exhaust fan isn't enough though."
        },
        {
            "Date": "Reviewed in the United States on July 14, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Bought this as my first PC! After some extensive research I picked this one out and picked up the 16GB Ram version. PC has no problems running anything at all so far and shipped to my house a day early! So far i’ve run OverWatch 2, Dead By Daylight, and Zenless Zone Zero at 144FPS & High Graphic settings with no problems at all.\n\nThere was a bit of screen tearing on OverWatch 2 when I first played it, but that was because OverWatch has G-Sync disabled by default. Enable G-Sync and the tearing disappears.\n\nThe PC is also absolutely silent. Even when the fan settings ramp up, it’s still reasonably quiet to the point the games it’s running at low volume are still louder than the fans. Totally satisfied with the PC so far, loving it for my first gaming PC. No cooling issues at all yet either."
        },
        {
            "Date": "Reviewed in the United States on August 2, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I purchased this PC during Prime Day and I must say I'm very impressed! It is handling everything i throw at it on high/ultra graphics with no issues. I've been using DLSS whenever i get the chance to get an even smoother experience. I bought this to replace a computer i purchased two years ago that had a GTX 1650 in it. The difference between that and the RTX 4060 16GB is night and day! This is a awesome PC for gaming on a budget. The only drawback is the 16GB of RAM i will be upgrading to 32 ASAP."
        },
        {
            "Date": "Reviewed in the United States on July 20, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Pc showed up in great shape. Had to update the bios immediately along with the cpu and gpu drivers but that’s not the end of the world. The cheap cpu cooler is extremely lacking. In game it hits temps of 90+ degrees and actually crashed playing cod mw3. During cinebench it would hit 100c immediately and thermal throttle. Adjusted bios settings and got it stable enough to run but still sits around 85-90 degrees. Have a Thermalright cooler on the way and it should take care of that issue.\n\nThe lighting is cool, but had to install a 3rd party app to control it as armoury crate is a joke and refuses to work.\n\nPros- The computer is a beast and currently turned down it runs cod mw3 over 100fps and world of warships at around 200fps 1080p. With the new cooler it should be even better!\n\nCons- only cons I have is the cpu cooler and the fact it only comes with a single 16gb ram card."
        },
        {
            "Date": "Reviewed in the United States on August 3, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I had a laptop that I had for a few years that broke down and wanted to get a PC Tower that would last a lot longer than a gaming laptop lifespan of extreme gaming. I am already pleased with how everything works and looks. Hoping the AC won't burn out on me as I like to play for long hours before getting off so I bought some extra ACs Thermalright Peerless Assassin to go with it. Other than that computer works great and I can't wait to get to gaming."
        },
        {
            "Date": "Reviewed in the United States on August 1, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "So far, I've had no issues however, the case was damaged but, not the box it came in. That would mean that someone knew the back was dented in, they stuck it in a box anyway and shipped it. Says a lot about the seller. As for the PC, I haven't played anything yet that couldn't have all the video settings maxed out. This thing comes with a decent keyboard and mouse too which, you don't see often. It uses NMVe storage so, things load up extra fast. Hardcore gamers will tell you it needs more RAM and while more RAM is always better, I still think 16 GB is a great starting point. I'd recommend this device to anyone trying to get into PC gaming."
        },
        {
            "Date": "Reviewed in the United States on July 9, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This is actually the 4th Cyberpower PC for our family in the past 8 years. You can't beat them for the value - they really do offer some of the latest CPU's and GPU's for the same price that it would cost YOU to scratch build the same system from parts. I recommend using Passmark's website to look up CPU / GPU performance and compare models. Now my 4 kids are able to game together on one of the latest and most intensive video games (Helldivers) with very high graphics settings. Full disclosure - I did upgrade the oldest machine, which again was about 8 years old... but the upgrade was easy. This latest machine that I bought and that I'm mainly reviewing here is a stinkin' hot rod!"
        },
        {
            "Date": "Reviewed in the United States on July 17, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This is the second PC I have purchased on Amazon and this one is by far the best of the two. This one was so beautifully packaged, the case itself is very high quality. It is very well made and not full of proprietary parts that force you to never upgrade your PC. As soon as I received the PC, I was able to easily install some additional storage. The PC even came with some additional SATA cables that my previous Skytech Desktop did not. I had to purchase it individually. I haven't had a chance to test the graphics card but so far it has been a great experience."
        },
        {
            "Date": "Reviewed in the United States on May 6, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I had recently gotten into pc gaming about 9 or so months ago after meeting some friends in college. I quickly took a very strong liking to it and after months of trying to run games on my school laptop and deciding that a pc was an investment I found worth it for not only an improved gaming experience, but also to better run the programs I use for school. My friends are much more knowledgeable about pcs then I am, so I had them help me look for everything I needed. This was the tower I ended up choosing. My friends were extremely jealous because according to them, it has significantly better features and additional features compared to theirs and was hundreds of dollars cheaper. After looking at a surplus of reviews and doing some research and comparing, this was being shipped. It arrived and was packaged very securely, so that was a big relief. It was relatively light, came very well packaged, and was a struggle (in a good way) to get out of the box. It was also very easy to assemble and get set up and running. The only downside was that the warning sticker on the glass side panel does not come off easily. My and multiple friends tried peeling it off, but the colorful exterior and sticky stuff kept separating, so I now have a dead stickler stuck to the glass of my tower (If anyone has any safe ways to get this off without doing any damage, please let me know because I am terrified). Combining this tower and the monitor that I have, I am easily able to run games with some of the highest graphic settings, easily can hit over 400 fps, and my latency typically stays between 24-37. Overall, I really enjoy it and my unknowledgeable self thinks it works great :)"
        },
        {
            "Date": "Reviewed in the United States on July 24, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I went and ordered a Cyberpower PC gaming desktop as I have had one in the past, and enjoyed it for many years. When I received this latest PC, I was impressed with the packaging and quick instructions to get started pamphlet. I'm enjoying it thoroughly so far. Everything was as advertised. The cabling is very neat and the overall design is top notch. I recommend not just this PC, but also Cyberpower PC itself. They haven't lost a step as far as I'm concerned with offering a top notch product."
        },
        {
            "Date": "Reviewed in the United States on July 27, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This PC was ready to go right out of the box, but please read the instructions first. I literally couldn't figure out how to turn it on because there are 3 spots you have to check to make sure you have power. But it looks cool, runs great, and it's really easy for me to see what's going on inside and how I can improve it if needed. Great product, but what sealed the deal for me was getting 300 bucks off the price during prime day."
        },
        {
            "Date": "Reviewed in the United States on June 28, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "If you are looking for a prebuilt gaming PC, Cyber Power is great. My husband is on his second one and loves it. His first one has been running for years and it still does run great, he's only needed to replace it as his gaming needs have changed and the industry evolved. We both purchased the same one and are loving the upgrades! We looked around a bit and found this to have the best specs in our budget, even when we turned to custom built. Other reviews are right about the sound of the fan though, and I think it will be healthier in the long run for the PC if we upgrade it to the one a lot of the other reviews are recommending, the Peerless Assassin. If you search the reviews for it, you'll see other reviews with more info on it."
        },
        {
            "Date": "Reviewed in the United States on June 27, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This was my very first big purchase because I’ve been wanting a new pc and my old one my father gave me inevitably passed, and I’ve been without a pc for months now. My boyfriend helped me find this one after searching for so long and I’ve been super excited. It’s been a month since I’ve gotten it and been playing on it and it’s so quiet that the only time I hear it is when the fans speed up to cool the system down. The colors are beautiful, the whole thing is beautiful, and it’s easy to open and easy to move. I love the keyboard and mouse that came with it as well, both very great for gaming and the performance of everything overall is 10/10. The lighting effects are great as well, to change the lighting on the pc is super simple!"
        },
        {
            "Date": "Reviewed in the United States on July 16, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I’ve had my cyber power PC for two weeks now and everything is wonderful so far. Things went very well on set up except the LED cables in the back cubby for the wires came undone and I wasted a lot of time trying to figure out why they weren’t working. So far so good and I like it so strong Computer chips together into a rig to buy easily. I’m very impressed by the idea of having support over the next few years if I need it I feel very safe with this company and with this purchase."
        },
        {
            "Date": "Reviewed in the United States on July 21, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Let me start by saying that I'm not a PC guy. I love my Mac, but I sometimes do work that requires software that is PC only. I found this CyberPowerPC GXiVR8040A14 on a Prime Day deal, and I took a chance on it. I couldn't find much information about the hardware (I'm assuming not all builds have identical hardware), but from what I could tell the CPU and GPU would meet my needs. I will be upgrading RAM and Storage, and from reading other reviews, I'll be upgrading the CPU cooling fan as well. The machine right out of the box is a solid build and would probably meet most people's needs. The specs of my CyberPowerPC right out of the box are:\nIntel Core i7-13700F 2.1GHz\nGigabyte GeForce RTX 4060 Ti 16GB\nVulcan T-FORCE 16GB DDR5\n1 TB WD Blue NVMe SSD\nAsus B760M-A AX6 Micro ATX Motherboard\nApevia 850W Prestige Power 80+ Gold\n\nThe upgrades I've ordered are:\n64GB CORSAIR VENGEANCE DDR5 RAM (2x32GB) 5200MHz CL40\nThermalright Peerless Assassin 120 SE CPU Air Cooler, PA120 SE\n4TB SAMSUNG 870 EVO 2.5 Inch SATA III Internal SSD (MZ-77E4T0B/AM)\n\nI don't want to give the impression that this PC needs to be upgraded immediately; I think most people could start with the base build and upgrade over time as needed. I normally would have tried to build my own PC, but after speccing this out on PCpartpicker, I couldn't beat the price of the CyberPowerPC pre-built machine. I highly recommend this for anyone looking for a powerful machine at a reasonable price!!!"
        },
        {
            "Date": "Reviewed in the United States on July 6, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "After having been a console user for pretty much my entire life, I have made the jump into the PC gaming world. After countless searching and reading, this model definitely has stood out. First impressions after receiving it are that it is sleek, and exactly what I was looking for. Set-up was SUPER simple (I use Apple for my other computer, so that is something I was worried about) and it even came with a wi-fi extender. Not to mention, that it is a better model than I could have gotten at my local Best Buy for this price. 10/10 reccommend!"
        },
        {
            "Date": "Reviewed in the United States on July 27, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Arrived in perfect condition. Packed very well. Ready for gaming right out of the box. Looks just like the product image with strong tempered glass. The processor and graphics card specs will allow me to play all of the modern games that I need to."
        },
        {
            "Date": "Reviewed in the United States on August 2, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "First of all, the shipping for this was insanely quick and I rally appreciate that since this is my first PC. I love that they packaged everything so nicely and made the setup easy. So far I'm genuinely impressed with how it runs."
        },
        {
            "Date": "Reviewed in the United States on July 11, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Just received a CyberPower PC and it's working great, I can play all my games on it with no trouble at all and it runs nice and cool. I don't have a ton of games but this pc holds 1 tb which isn't bad. It actually runs better than a very expensive computer I once had. It also has a great graphics card and 16 GB of RAM which is fine for most games. I'm very happy with my purchase and would recommend it."
        },
        {
            "Date": "Reviewed in the United States on July 27, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I recently began streaming on twitch and my old gaming computer was very outdated. I couldn’t play anything on pc and stream at the same time. With this pc, I can download, stream to twitch and TikTok, and play games all at once. I am very happy with this purchase!"
        },
        {
            "Date": "Reviewed in the United States on July 23, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "As a person who isn't really knowledge about the vast world of gaming pcs. I can say that this computer does the job. Personally, I usually only play battle royale games and this computer fulfills all the necessary requirements. Definitely a good computer to buy when on sale and for a good starter for new gamers."
        },
        {
            "Date": "Reviewed in the United States on June 10, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "cyber power like iv said befor is the compeny you wana get a pc from. if you dont know where to go or what to do. you go online to look over whelmed by all the pc try some junky ones out till you pick up one of these bad boys. -slaps pc- this bad boy can have soo meny tabs open while playing a game! XD being a ex worker for amazon i havent seen a cyber power pc once ever show up in the return section but iv saw a couple sky techs from time to time but mostly ibuy power pcs. its just what happend honsitly they probly arnt as bad now but still cyber power will and allways will be the best probuild compeny to buy a rig from in my opinion"
        },
        {
            "Date": "Reviewed in the United States on July 24, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Was a little tentative ordering a PC online and having it shipped, but seemed like a good Prime day deal so i took the chance. PC box seemed in good shape, but upon opening the glass side to remove the foam packaging protecting the interior I noticed one of the fans was dangling. After mounting the fan again, PC seems to be fine and a big upgrade from my previous one."
        },
        {
            "Date": "Reviewed in the United States on August 3, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Arrived on-time, intact, and in one piece. Packaging was secure, instructions were easy to follow, making the setup easy and pretty straightforward. No damage to the product was seen. 10/10"
        },
        {
            "Date": "Reviewed in the United States on July 4, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Purchased this for my sons 9th birthday. Definitely a good choice for me especially knowing nothing about computers. Delivery went well. Packaged well, and having to sign upon receipt was a plus.\n\nThe pc has ran smoothly and honestly i can barely hear it running at all when my son is playing games.\n\nSetup and installation could not have been easier. No issues so far. Would definitely buy from Cyberpower again and they are an easy recommend."
        },
        {
            "Date": "Reviewed in the United States on July 26, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I can run all my games (BG3, Hunt: Showdown, WOW, Crab Champions, etc) on max without any issues at all.\n\nGraphics card gets a little noisy but not that bad."
        },
        {
            "Date": "Reviewed in the United States on July 18, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I finally replaced my old home built computer with a gaming computer from Cyberpower PC. It was on sale and a good value! I was surprised by the quality of the components. Asus motherboard, MSI video card, etc. So far it's running great and is very fast. Recommended!"
        },
        {
            "Date": "Reviewed in the United States on July 23, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "PC comes basically ready to go just needs updates like the chipset. Other than that it works like a beauty. I personally added 2x16GB RBG ram sticks. The ram adds an additional comfort to multitasking. Would buy again if i had more money!"
        },
        {
            "Date": "Reviewed in the United States on July 23, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I bought this PC during the Amazon Prime sales event, and it is probably one of the best buys I have ever made. It is quiet and very high quality without lagging playing games. Highly recommend to first time PC buyers."
        },
        {
            "Date": "Reviewed in the United States on July 19, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Solid bundle. Worked out of the box.\n\nWhen checking the connections, I freaked out because I couldn't locate the hard drive. Crisis averted and I'm possibly going blind.\n\nOther then that little snafu she's working beautifully and I am getting back into PC gaming without issue."
        },
        {
            "Date": "Reviewed in the United States on June 29, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The PC came with a simple quick start guide that made it easy to remove all the packaging material and make all the necessary connections before booting up. Windows 11 made the software setup easy as well, I was up in about 40 minutes. This model has the hardware necessary to process advanced audio/video upscaling using AI technology and it has been working well so far. I may eventually try playing games on it, but it is definitely doing what I bought it for."
        },
        {
            "Date": "Reviewed in the United States on August 3, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Shipped fast and was super easy setup and installation. best PC I ever bought. I will buy all my PCs through CyberPowerPC from now on!"
        },
        {
            "Date": "Reviewed in the United States on July 18, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Overall seems like a well built computer. I wish there was a fan already install on the ceiling. There may be a reason for that which I'm unaware of. So far it seems to be running games pretty well. I've heard the computer runs hot, so I guess we will see."
        },
        {
            "Date": "Reviewed in the United States on July 31, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great computer! Fast shipping. Love the colors and keyboard and mouse. The setup was easy. The computer runs great. Would highly recommend it."
        },
        {
            "Date": "Reviewed in the United States on July 22, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This computer is an excellent setup. Completely upgradable not that most users will need it. The lights on the tower can be turned off. Good value."
        },
        {
            "Date": "Reviewed in the United States on July 22, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Honestly a great value getting it on sale for black Friday in July. Pricing the pieces out individually, the value was almost equal without having to assemble myself. Runs smoothly and overall a great pre-built computer for all your gaming needs."
        },
        {
            "Date": "Reviewed in the United States on July 19, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Got it working quick. Though it only has one HDMI, I just got Display Port adapters and those work perfectly. I moved my HDD and SSD to this PC without issue. Simple and easy transfer from my old PC to this one."
        },
        {
            "Date": "Reviewed in the United States on July 12, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "For less than $1,600.00 the Intel Core i7-14700KF 3.4GHz with GeForce RTX 4060 Ti and 32GB RAM is genuinely an exceptional purchase for the pricetag. I ran Helldivers 2 on maxed-out settings on UWFHD and didn't drop under 80fps, even during the most intense firefights. The product arrived in a well-packed, sturdy box with no loose components. Very happy with the purchase!"
        },
        {
            "Date": "Reviewed in the United States on July 17, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Awesome computer, super powerful and one of the best dollar per dollar values out there for a prebuild. Came in great packaging. Everything is just as they said it would be. Mouse and keyboard are great too. Love this PC!"
        },
        {
            "Date": "Reviewed in the United States on July 27, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Upgraded to this as I am a gamer , this is blazingly fast and the graphics are smooth , very happy with this purchase."
        },
        {
            "Date": "Reviewed in the United States on July 18, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This was a great purchase. Came quickly and arrived without damage. Instructions were simple, able to set up the computer quickly in a single evening. Also, the computer itself has worked great, very happy with our purchase."
        },
        {
            "Date": "Reviewed in the United States on July 20, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Overall the PC is fantastic, I don't have many issues with it. Cable management is fantastic. Unfortunately the screws fastening the paneling on the case were tightened too far and I damaged them with my pliers while removing them."
        },
        {
            "Date": "Reviewed in the United States on July 24, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Ultra easy setup. Had a few other cords in the box. No way to identify them. Had to YouTube information to figure out what the other cords were for. Still don't know what the other cord set is for."
        },
        {
            "Date": "Reviewed in the United States on July 13, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "PC just came in after 3 days after placing order quite fast! was packaged carefully to no problems visible with the system outside or inside, setup was quick within 45minutes. came with complimentary keyboard and mouse! will renew review after using for a short period of time of usage!"
        },
        {
            "Date": "Reviewed in the United States on July 9, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "I liked how simple and easy it was to set up and it works great it being my first ever pc. But the fan lights turn on then off when booting up . Other than that Good storage space, very fast, easy to game, connection is good and no other problems with anything just the Fan."
        },
        {
            "Date": "Reviewed in the United States on July 21, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I love this PC! It was easy to setup and it works well for the things I want to play. This is my first PC and it has been a great experience so far!"
        },
        {
            "Date": "Reviewed in the United States on July 25, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This PC was very easy to setup a get going! The PC works perfectly and the RGB is a great touch!"
        },
        {
            "Date": "Reviewed in the United States on May 30, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "My beloved 8 year old computer finally died, so I bought this Cyberpower PC based on the great reviews. They were right on the mark. I had my son upgrade the memory and cooling fam. He said there was no way he could have built me one with comparable components for the offered price. It was the easiest computer I've ever had to set up. It's quiet and the benchmark test results are amazing. I was at the point where my old computer wouldn't run some new games, but this one handles everything with ease. You'll definitely want to replace the fan it comes with, though. Quite a bargain overall."
        },
        {
            "Date": "Reviewed in the United States on July 20, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I’m really happy with the system so far. It’s been an easy process to plugin the usb key and play."
        },
        {
            "Date": "Reviewed in the United States on July 16, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I love that this machine is extra quiet. Loving the vibe of the led lights on the tower, keyboard, and mouse. I'm not a gamer but this machine is perfect for video editing!"
        },
        {
            "Date": "Reviewed in the United States on April 11, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "I have had this PC for a week now, I'm happy with it so far .it has been running smoothly.\nI don't know much about PC when it comes to gaming on a desktop because I have been playing on PlayStation for years). This is my first ever time buying a PC for gaming purpose. By far I have been playing Warzone, Apex and my son has been playing Beamng Drive and Forza horizon 5 , no problem whatsoever.\nThe only issues I have encountered was I had a few crashes during Warzone, but the PC itself come with good specs it should handle these games easy so I think its probably caused by CPU high temp . After reading through other buyers comments and recommendations I decided to replace the stock fan . Yea this FAN is loud once I launch a game , like loud enough for me to worry about the CPU gets burnt . I did not enjoy that noise at all ! So I purchased Peerless Assasin 120 SE rgb and replaced the stock fan , I have to say its so worth it ! Now my PC is quiet even when I play games !I'm so glad I did listen to other ppl and did this, I'd suggest you do the same .\nIf it wasn't for the loud stock fan issue I would have rated it 5 stars cos that cost me extra money and my time trying to fix it. And then I spent more money purchased extra memory cards (This pc comes with 16g DDR5 memory ,I upgraded it to 32g).\nOverall It is a nice computer ,I do recommend it ."
        },
        {
            "Date": "Reviewed in the United States on June 17, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This product was purchased for my teenager as a replacement when our old system died. We did a lot of research and found this would best suit our needs and purchased on June 11. It was delivered as promised on June 13 with undamaged packaging and product. The setup was straightforward, both physically and software, and we were up and playing games in no time. We have had no issues with heat and the system runs extremely quietly. This was a success as online purchases go."
        },
        {
            "Date": "Reviewed in the United States on July 27, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "No issues with sipping and runs good. However, I will be buying a better cpu fan since it runs pretty hot while gaming."
        },
        {
            "Date": "Reviewed in the United States on July 16, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I use the pc mostly for gaming and so far ive had no issues. Games have run smoothly"
        },
        {
            "Date": "Reviewed in the United States on July 20, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "It is the best PC I have ever bought. I can play all my games without difficulty."
        },
        {
            "Date": "Reviewed in the United States on July 20, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Got this delivered the other day as a birthday present to myself. So far so good!"
        },
        {
            "Date": "Reviewed in the United States on July 9, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Very fast and downloads quickly. However, the signal for the internet was a bit weird even though my laptop connects just fine. Had to get an Ethernet cable."
        },
        {
            "Date": "Reviewed in the United States on July 20, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Showed up next day and came with a gaming keyboard and mouse. Booted up very fast and was able to get started very quickly. I would recommend this computer!"
        },
        {
            "Date": "Reviewed in the United States on July 7, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "a decent price for a prebuilt 4060tiruns fine loads a little slow I'm assuming some cheap parts somewhere in the build bottleneck a little bit although i haven't had issues when it comes to games. most games i run11440p on high and they run pretty smoothly all in all good pc would recommend just get the warranty just incase something breaks or your mail man plays baseball with packages"
        },
        {
            "Date": "Reviewed in the United States on July 20, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "Owned for several months now. No issues to complain about. Looks cool. Runs great. Wish it had a disk burner though."
        },
        {
            "Date": "Reviewed in the United States on July 18, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Booted up with no issues right out of the box. Everything works great. It is fairly quiet and extremely fast."
        },
        {
            "Date": "Reviewed in the United States on July 29, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Got this for my son who asked specifically for it. Works great and great service!"
        },
        {
            "Date": "Reviewed in the United States on July 24, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "excellent computer and easy set up. Cpu Fan is loud at times but it's an easy replacement. overall excellent upgrade from my 1060 and amd cpu"
        },
        {
            "Date": "Reviewed in the United States on July 4, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This was my fist PC and had little to no knowledge about them. Many people recommended this one to me. I do not regret it and it was defiantly worth every penny."
        },
        {
            "Date": "Reviewed in the United States on July 17, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Easy set up. Running right out of the box. Major upgrade for me"
        },
        {
            "Date": "Reviewed in the United States on July 23, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Muy buena calidad, super satisfecho con la pc, excelente, la recomiendo muchi"
        },
        {
            "Date": "Reviewed in the United States on July 22, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This is the 2nd PC ordered. Great price, great performance, no issues."
        },
        {
            "Date": "Reviewed in the United States on July 11, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "So far I love everything about this! I am so excited to set it all the way up and start playing the games I've been wanting to play for forever. Great started PC. 10/10. Easy setup."
        },
        {
            "Date": "Reviewed in the United States on July 28, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Nice solid build in a small size. Ready for use, right out of box."
        },
        {
            "Date": "Reviewed in the United States on July 25, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This was my partner's very first PC i recommended to get a prebuilt! He finally decided on this one and we were NOT disappointed!"
        },
        {
            "Date": "Reviewed in the United States on July 23, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "The computer came early. It been a breeze to setup"
        },
        {
            "Date": "Reviewed in the United States on July 27, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Computer is amazing compared to my older system! Would definitely recommend!"
        },
        {
            "Date": "Reviewed in the United States on July 29, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Games like a beast, everything already set up easy, love it"
        },
        {
            "Date": "Reviewed in the United States on July 6, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "really cheap price for all this awesome computer allow you to do, I stream easily with it playing the most fancy games that run on 120fps.\n(you can literally play anything with it)"
        },
        {
            "Date": "Reviewed in the United States on June 26, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This PC has been great so far! Very quiet and colorful. Noise level is a 5 star. ADDED bonus is a keyboard and mouse that work great as well. The side door on the PC opens up for easy to access and everything is magnet based with makes for great cleaning."
        },
        {
            "Date": "Reviewed in the United States on June 29, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This computer is amazing. I went from console gaming to somewhat playing on my midrange laptop from 2022. So to finally upgrade to something like this is just great for me and the type of games that I enjoy. Can't go wrong with this at ALL!"
        },
        {
            "Date": "Reviewed in the United States on July 23, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "love this would recommend to a friend."
        },
        {
            "Date": "Reviewed in the United States on July 28, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "i like the processing power and the quality graphics"
        },
        {
            "Date": "Reviewed in the United States on July 22, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Fast speed good quality parts high graphics"
        },
        {
            "Date": "Reviewed in the United States on July 19, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great performance, very happy with this system"
        },
        {
            "Date": "Reviewed in the United States on July 28, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Very easy to set up. Very powerful computer."
        },
        {
            "Date": "Reviewed in the United States on June 22, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "This is my first pc and the performance and graphics are amazing. Games I've played so far on here are Fortnite, Roblox, and Valorant. The fps and graphic settings were very smooth. One thing I had trouble with was RGB lighting on my pc, mouse, and keyboard as I couldn't find how to control the lighting."
        },
        {
            "Date": "Reviewed in the United States on July 21, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Great specs for the price"
        },
        {
            "Date": "Reviewed in the United States on July 24, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Arrived quickly and able to run well"
        },
        {
            "Date": "Reviewed in the United States on July 25, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Awesome gaming PC"
        },
        {
            "Date": "Reviewed in the United States on July 12, 2024",
            "Stars": "4.0 out of 5 stars",
            "Review Text": "I feel that the sound of the computer is acceptable, and I am very satisfied for the time being."
        },
        {
            "Date": "Reviewed in the United States on August 4, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "awesome"
        },
        {
            "Date": "Reviewed in the United States on July 12, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "This replaces a 5 year old rig and it blew me away."
        },
        {
            "Date": "Reviewed in the United States on July 6, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "Good Pc so far. Haven't had any complaints as of yet."
        },
        {
            "Date": "Reviewed in the United States on July 25, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "LOVE IT!!!!!"
        },
        {
            "Date": "Reviewed in the United States on June 19, 2024",
            "Stars": "5.0 out of 5 stars",
            "Review Text": "I have owned a CyberPower PC since 2018. I have had zero issues with it and decided it was time to upgrade! The price point beat any of the competitors I searched by hundreds of dollars. Definitely won't be disappointed if you purchase one!"
        }
    ]
}